[{"reviewerID": "A1POFVVXUZR3IQ", "asin": "B000H00VBQ", "reviewerName": "Z Hayes", "helpful": [12, 12], "reviewText": "I discovered this series quite by accident. Having watched and appreciated Masterpiece Contemporary: Place of Execution, I was keen to read the novel (which inspired the TV adaptation) by Val McDermid. The novel was very well-written, and a nail-biting suspense thriller. Then I discovered that Val McDermid wrote other novels as well, and a couple of them inspired the TV crime drama Wire in the Blood.I finished watching all of Season 1 and have become a fan of this gritty crime drama that follows the investigations led by DI Carol Jordan (Hermione Norris). She is assisted by clinical psychologist Dr. Tony Hill (Robson Green), a rather eccentric figure who delves deeply into the minds of serial killers, studies patterns of criminal behavior and profiles criminals. His methods may seem strange at times, but he always manages to get results. Both Jordan and Hill make a strange if compelling pair, with Jordan analyzing a case based on evidence, and Hill working based on his knowledge of deviant behavior and what makes people commit disturbing crimes.Unlike some of the \"cozy\" mysteries such as the long-running Midsomer Murders - Set One and The Complete Inspector Lynley Mysteries, Wire in the Blood is not for the faint of heart. The crimes are horrific, sometimes involving children, almost always patterned on deviant behavior and the suspects are almost always very disturbed individuals. The crime scenes are difficult to watch as are the way victims are found and even the forensic examinations are graphic and unsettling. Though compelling, this is not really a show to watch in one sitting, and may very well give viewers nightmares.The first season contains three main stories, each divided into two episodes:The Mermaids Singing - Hill is on the trail of a seriously disturbed serial killer who targets homosexuals.Shadows Rising - The skeletal remains of a young woman is found, and when further evidence turns up, DI Jordan and Hill realize they have a serial killer on their hands, one with a penchant for dark-haired young women.Justice Painted Blind - Another unsettling case, this time revolving around an old child abduction and murder case. A couple of apparently random murders turn out not to be so random after all when it is discovered that the victims do share a connection involving an old court case where the accused was found not guilty. This throws up a whole bunch of suspects, including the parents of the murdered girl.The writing on this crime drama is excellent, and Robson Green is credible as the clinical psychologist who has a rare knack for profiling and getting under the skin of some of the most dangerous criminals. The drama also explores the chemistry and tension between Hill and DI Jordan, all of which result in a riveting show that keeps viewers coming back for more.The streaming was good overall with only a little delayed streaming during Episode One. There were no glitches on the other episodes. The picture quality could be improved though as it did seem a bit grainy to me.", "overall": 5.0, "summary": "I purchased the series via streaming and loved it!", "unixReviewTime": 1318291200, "reviewTime": "10 11, 2011"}, {"reviewerID": "A356RFKNIG043B", "asin": "B000H4YNM0", "reviewerName": "K. Swanson", "helpful": [0, 0], "reviewText": "4.5 starsI knew nothing of this until a friend lent it to me this weekend. I laughed. Often. At things that aren't supposed to be funny, but as any serious fan of comedy knows, those can be the best laughs. I walked away feeling lighter and happier. If that ain't comedic success, what is?IASIP is like Seinfeld if the SeinFour were ten years younger, Irish, and ran a bar in South Philly. These guys have clearly studied Sein and Curb very closely, and their tight timing and topics and banter are all very Larry Davidesque...but they go places even LD won't. The best two shows of the 7-episode first season are about cancer and abortion; I howled at some moments. These guys have done what so many guys want to do: make a show about how funny they are. Except, these guys really are funny. Sometimes. But hey, no one's always hittin' homers, even on comedy 'roids, so I cut these three some slack and marvel at how tightly they work together. There's a lot to be said for working with old friends, if they have talent: the camaraderie and timing here are born of many years of drinking and laughing and thinking and falling down, no doubt. And these three guys are each pretty dang funny, each in his own fashion.DeVito is ok but I liked the first season best for its rawness. Still, as the later shows get a little more polished it's often in good ways.If you don't like drinking, if you insist on PC language from your friends and neighbors, and if you are in general just plain uptight about people living and thinking the way you want them to, look elsewhere. But If you enjoy tying one on and laughing your butt off at the endlessly silly idiocy that accompanies being alive in America these days, you may just find Always Sunny to be almost always funny.", "overall": 5.0, "summary": "It's Very Often Funny In Philly: occasionally hilarious in all the best wrong ways", "unixReviewTime": 1281225600, "reviewTime": "08 8, 2010"}, {"reviewerID": "A2BFIYZYNK54QX", "asin": "B000HAB4NK", "reviewerName": "James Donnelly \"Ave Atque Vale\"", "helpful": [15, 17], "reviewText": "Revel in his awesomeness!!! For he is a god amongst men and he is deserving of all praise that can possibly be heaped upon him. The one time the Emmys got something right!! Jack Bauer is as close as any fictional character has become to being superhumanly powerful, and at some times his recurrent circumvention of the bureaucratic system, assaulting his friends and co-workers, his flagrant abuse of \"prisoner's rights\" and his uncanny ability to fight his way out of any trap... it may require a little bit more suspension of disbelief than would normally be necessary in a lesser show, but the very core of this show is Jack Bauer, or more specifially, Kiefer Sutherland and his increasingly better performance each season of 24. When he is having a particularly emotional moment, you feel it exude from the screen.... this is just an example of the power that Sutherland brings to this show. Also standing out as always is Mary Lynn Rasjkub as the wonderfully ascerbic and wicked-tongued Chloe O'Brien. The introduction of her character is one of the best things that's happened to this show. But this season has some other stand-out characters: one that was introduced in season 4 and a brand new one. Fans of the show know these as President Charles Logan (the wonderfully slimy Gregory Itzin) and his first lady Martha Logan (the amazing Jean Smart). Their interplay and their performances are almost as key as Sutherland in this season. Another thing that came to be almost an in-joke is that three members of the cast of the original ROBOCOP film appear in different parts of the series, which as a fan of that film was just really cool to see. Whether or not that was intended, it's still a nice touch for genre fans. Julian Sands has lots of fun chewing up scenery as the evil Russian-yet-English-Accented Terrorist. The premise is per usual: Jack must defy all odds to save the country and avenge his personal losses. But the plot itself is of a higher level of complexity and tragedy this season than prior seasons. The way it begins is ALMOST as shocking as the way the season ends. And the ending of the final episode of the season... that scream you heard in the whole of the United States and parts of Canada and Mexico... that was me. January 2007 CANNOT GET HERE SOON ENOUGH!!!", "overall": 5.0, "summary": "Jack Bauer's Hour of Power Towers Over ALL!!!", "unixReviewTime": 1159228800, "reviewTime": "09 26, 2006"}, {"reviewerID": "A2I6MHMAZZDCRX", "asin": "B000HAB4NK", "reviewerName": "Mark Baker", "helpful": [9, 11], "reviewText": "In the aftermath of season 4, Jack Bauer (Kiefer Sutherland) had to fake his own death and go into hiding.  But he can't seem to stay in retirement for long.  Someone knows Jack is alive and targets his friends, forcing Jack to come out of hiding to face down terrorists yet again.Meanwhile, it is an important day for the United States and President Logan (Gregory Itzin).  He has been working hard to iron out an anti-terrorism treaty with Russia, and that treaty will be signed that day.  But the treat of terrorists in Los Angeles with stolen nerve gas just might be enough to derail the treaty.Season 5 won an Emmy for best drama, and it was well deserved.  Even after five years, this show is gripping drama with excellent writing and acting.  I am glued to my seat every week, breathing only during commercial breaks.  This season the threat and storytelling seemed more focused then previous years, adding to the drama.There were a couple flaws this season.  I sure don't remember the explanation of who knew Jack was alive at the beginning of the season.  Maybe it was mentioned and I missed it.  Furthermore, we have yet more examples of lack of security at CTU.  While it does make for gripping drama, it does seem like they could come up with a new plot trick every so often.My biggest complaint this season was the body count.  We lost several key characters from previous years.  While I understand the producer's desire to keep us on the edge of our seats, can't anyone from the show live happily ever after?  It honestly got to the point I dreaded seeing anyone who had been on the show before for fear they would be killed off.Still, these are minor issues with a truly wonderful show.  I'm counting down the hours until the next season premiers and we can start the rush all over again.", "overall": 5.0, "summary": "A Little Wear but Still Strong Fifth Season", "unixReviewTime": 1165276800, "reviewTime": "12 5, 2006"}, {"reviewerID": "A3T5NSG7LMRY0A", "asin": "B000HAB4NK", "reviewerName": "Michael Gmirkin", "helpful": [2, 3], "reviewText": "Love the show. Period. Have just finished watching the first 5 seasons (something of a marathon over the last month).Season 5 is probably my favorite season to date. It starts strong and doesn't let up until it's over.As to packaging and the discs themselves: the first 4 seasons come in fold-out packaging + outer sleeve, much like the Highlander series and a few others. The first discs contain the episodes themselves, and the last disc contains some bonus materials. Season 5, however, breaks from this tradition and instead packages the discs in 4 slim cases (the 4th holds the bonus features disc). A change of page in packaging, but still quite attractive, with approximately the same shelf footprint (if not slightly smaller).Season 5 continues to do a good job with chapter breaks, scene selection menus, and bonus features. I might note however, they've added a slightly longer intro before getting to the main menu (looks like booting up and logging into a CTU computer system). However, on my DVD player I could skip ahead without having to play the whole sequence. So, it wasn't completely ungainly.The video and audio were up to par. Of course I don't have a large-screen/wide-screen TV nor surround sound, so I can't test under all conditions. But if there were any video or audio issues I didn't notice them. Perhaps some moire/color issues in scenes with close parallel-line patterns. But I've noticed that on any number of DVD releases of other series from other studios, so I wouldn't say there was any more in 24 than other series.Overall, I highly recommend this for anyone who hasn't seen 24, and who likes the spy/thriller type show. If you liked Alias and/or La Femme Nikita, you'll probably like 24 as well. There are some \"intense\" scenes and probably some harsh language, so preview episodes before showing it to any youngsters, if at all.", "overall": 5.0, "summary": "Best show still in production on Broadcast TV?", "unixReviewTime": 1170288000, "reviewTime": "02 1, 2007"}, {"reviewerID": "AP3B615GM191G", "asin": "B000HAB4NK", "reviewerName": "Zachary Koenig \"K-Dawg\"", "helpful": [1, 1], "reviewText": "While Season One of 24 focused much of its attention on President David Palmer, Seasons 2-4 saw the Oval Office by and large take a back seat to the missions of Jack Bauer and CTU.  However, Season Five brings some of the attention back to the sitting U.S. President (this time Charles Logan) and ends up with a much more well-rounded storyline.For a basic (non-spoilery) plot summary, a group of Russian terrorists threaten to release canisters of nerve gas in the U.S., leading Bauer to be reprieved from his thought-to-be death in order to help stop the crisis.  As CTU begins investigating the terrorism, however, it quickly becomes clear that the terrorists are working with a high-ranking government official, and the conspiracy begins to be unraveled.To be honest, at first I was skeptical of all the focus on President Logan, as didn't like his character and wasn't sure that he could command the camera as well as his predecessor Palmer.  However, by the end of the season, Logan is easily the most enjoyable/interesting character on the show.  His acting, along with his wife, chief of staff, and head of security, really gives the show the Presidential presence it lacked since that first season.Of course, there is still more than enough of Jack Bauer and his fellow CTU agents (Audrey Rains, Bill Buchanon, Edgar Stiles, Chloe O'Brien, etc.) to go around, which means that intense drama ensues in every single episode.  The writers have an amazing way to take a character that looks like a creep (think Tony Almeida and George Mason in the early seasons) and, by the end of a few episodes, have him become a noble hero, and that tradition continues in this season as well.The only \"knock\" I have on this season is that the cliffhanger endings of each episodes aren't quite as shocking (e.g. Nina Myers doesn't appear out of nowhere).  However, I think that was more of a creative choice by the writers, as the story is actually more coherent that any season besides the first one.  Instead of seemingly changing the plot of the show with every episode, Season Five slowly crescendos until the big finale.So, fans of 24 can purchase this season with confidence knowing that they will still get their action, drama, suspense, and some great twists and turns along the way.", "overall": 5.0, "summary": "Back To Its Political Roots", "unixReviewTime": 1241049600, "reviewTime": "04 30, 2009"}, {"reviewerID": "AB0GGIQBNB36Q", "asin": "B000HZEHL6", "reviewerName": "Ben Milton", "helpful": [0, 0], "reviewText": "Season three opens, with Gibbs going after Kate's killer, Ari. And to try to throw alot at us, NCIS gets a new director, Jenny Shepard played by Lauren Holly. Now Shepard and Gibbs do have some history, since both were partners at NCIS at one time, also. To proclaim Ari's innocence, is Massade officer Ziva David. And I'm sorry, I didn't like her then. And I don't liker her now, She and pretty much all of Massad is built up like they are the only agents that are extremely tough, they're unstoppable. So Ziva and Jenny try to convince Gibbs that he's wrong, and Gibbs even makes the only logical argument against Ari's innocence. That if he were innocent, he would turn himself in. So, after much arguing, he gets Ziva to follow him. And Ziva kills Ari in Gibb's basement, And we get each persons view of how they saw Kate in this episode. Now, I would have inserted Paula Cassidy to the team after this. Since there was some obvious chemistry between her and tony, but no. We get Ziva, and she is built up like I said. As this unstoppable, lean mean killing machine. The best of the best, and I'm sorry, but she's abrasive and annoying. And I still have a hard time accepting her to the team, Gibbs magically trusts her more than any other member of the team. season three is a good season, and Ziva is the on;y reason I didn't give it 5 stars. Although season three does end with almost getting blown up, going into a coma. Waking up from that coma, and thinking it's 1991. And we get to meet Gibbs's mentor, Mike Franks. Which leads to gibbs trying to stop a terrorists attack. Only the generals won't allow it, and Gibbs ends up Quitting NCIS. All in all, season three is still awsome. Like I said before, my only problem is Ziva. The introduction of a new director, and then Gibbs leaving.", "overall": 4.0, "summary": "Still a solid season", "unixReviewTime": 1346976000, "reviewTime": "09 7, 2012"}, {"reviewerID": "A3UPYGJKZ0XTU4", "asin": "B000IBUP6A", "reviewerName": "mirasreviews", "helpful": [2, 3], "reviewText": "\"The Friends of Eddie Coyle\", adapted from the novel by George V. Higgins, is exemplary of the kind of film noir that was unique to the 1970s. It shares the chaotic noir world with films of the 1940s, but protagonist is fast being rendered irrelevant by a rapidly changing world where even corruption isn't what it used to be, and he knows it. It's fitting, then, that the protagonist should be played by an aging Robert Mitchum, conflicted hero of more than a few films of the classic noir cycle. Eddie Coyle (Robert Mitchum) is a hood who runs guns for the Boston mob. Caught in a recent trucking job set up by his bar-owning friend Dillon (Peter Boyle), Coyle is looking at a probable 3-5 years in prison. He can't afford to do the time, so he considers snitching on his gun supplier to a federal agent, Dave Foley (Richard Jordan), but the feds are more interested in a recent string of bank robberies.Eddie Coyle is a man from another era. He ponders how much and whom he is willing to betray to keep himself out of prison. He paternalistically lectures his young gun supplier (Steven Keats) about how rough the business is and the importance of caution and reliability. Eddie is playing by some old rulebook that is no longer applies. He doesn't realize he's being played by just about everyone. He catches on too late to how the game of cops and robbers is currently conducted. \"The Friends of Eddie Coyle\" was an ironic title for a cynical and depressed era. Made the year the Watergate scandal broke, it's hardly surprising that law enforcement is portrayed as no more ethical than outright criminality. Shot on location in Boston, director Peter Yates' style is unadorned but includes a lot of procedure -how guns are obtained and banks robbed- that enhance the film's aura of authenticity.The DVD (Criterion Collection 2009): Spine #475. Bonus features are a Stills Gallery of 22 behind-the-scenes images captioned by director Peter Yates and a feature commentary by Yates, recorded in 2009. This is one of Yates' favorite 3 films of the 25 films he directed. He talks about choosing the locations, the cast and performances, including a lot about Mitchum's work on this film, his own \"style of reality and simplicity\", and the filmmaking process. Also included is a booklet featuring an essay by film critic Kent Jones and a 1973 profile of Robert Mitchum from \"Rolling Stone\".", "overall": 4.0, "summary": "A Great Turn from Robert Mitchum in This Film Noir Subsumed by 1970s Malaise.", "unixReviewTime": 1274659200, "reviewTime": "05 24, 2010"}, {"reviewerID": "A1OE5P78QIQ13G", "asin": "B000ICRKLM", "reviewerName": "ChicagoScott1009", "helpful": [0, 0], "reviewText": "As I've said in all my reviews, I love the Stargate shows SG-1 and Atlantis, not so Universe.  I like the way they spun off the whole Atlantis discovery as the foundation for extending SG-1 which was great, but ran it's course and was in decline at the end.  It allowed some new characters, albeit with familiar personalities, along with keeping alive some old favorites with vague tie in's to their ongoing lives as well as bringing Samantha Carter back for a season to head the program (in addition to all her guest appearances).  I think the 3rd season of Atlantis was its best.  I knew from the start it would have a shorter shelf life than SG=1 because the premiss had already been pretty thoroughly explored in SG=1. A whole new universe allowed for some new bad guys, but the SG teams and the predicaments they can get into are finite before they are like plots different show.  I enjoyed their greater familiarity with the ancient technology but being Hyperspace or Warp drives, the technology is simply a backdrop to the episode storyline and seasonal/show ones.  I couldn't have stood waiting as long watching Stargate for them to develop defensive technologies and fight the enemies effectively.  I enjoyed the show and season 3 was at its peak as it was becoming a formula rotated through the seasons by season 4 and season 5 it is hard to get enthused when it begins by them canning a long time character who was well liked by fans and characters, replacing her with someone that I would have enjoyed having run Stargate for two shows and then get eaten by a Raithe no matter how much they tried to make it fun watching him have to change his ways to deal with the realities of being in the field.  The characters had become familiar such that losing main ones was difficult in this season making for some heavy shows, but also began the rotation that made it less upsetting when one was lost.  The only thing that sort of always left me in question was how on Atlantis they dealt with exploring an entire Galaxy with a few SG teams while back in the Milky Way they had a ton.  I realize there were more finite resources in the beginning, but by season 3 they had the huge city fairly up and running and enough trade partners to support a much larger military presence which all things considered I think back home on earth they would have been cranking out as many starships as possible because in the big picture they would need a fleet not a couple of ships.  i know they added on, but over years given the stakes I believe an international governing body would be funding mass production of those things so there was always one by earth, one by Atlantis and others for missions and with force.  It is part of what started to become a little to familiar, the desperate situation with impossible odds solved by a miraculous discovery at the last minute.  Great for a show, or a movie, but when it becomes cyclical it eventually translates to a show formula and the interest just begins to wane.  I did appreciate the writing around the problems they faced were of their own making many times (waking the wraithe early, messing with the replicator programming, genetic experiments on the wraithe to make them human) and the moral questions they raise in parallel with the real world application of genetics.  How much knowledge is to much before we are dabbling in areas we don't have enough seem to be evolved enough to have in our hands as they represent to much power, to much danger.  But for Star Gate fans I think Atlantis was a comfortable spin off that allowed a few more years of enjoyment of their &#34;world&#34; but unlike the Star Trek franchise that dealt with all universes the &#34;world&#34; created via the stargates became to self contained limiting the growth of the plots.  Bottom line is by this season you know what your getting and enjoying it, where in the seasons to come it started to get old and thus the show faded away.  Good, even great for periods, but limited from the start by being set in the present.  Great run while it lasted.", "overall": 5.0, "summary": "Best of the Stargate Atlantis Seasons", "unixReviewTime": 1398643200, "reviewTime": "04 28, 2014"}, {"reviewerID": "A2A6NH6DPE0VXR", "asin": "B000IJRK7O", "reviewerName": "Jim \"Pimmy\"", "helpful": [5, 6], "reviewText": "From beginning to end of season 2 Michael Scofield (Wentworth Miller) and his brother Lincoln Burrows (Dominic Purcell) are on the run from the police and government agents that want them dead. The other convicts lives are on the line as well since all of them have been ordered to be killed. They also want Dr. Sara Tancredi (Sarah Wayne Callies) dead or anyone else who has tried to help Scofield and his brother. To show that these guys aren't messing around, season 1 regular Veronica (Robin Tunney) is killed violenty at the end of the first episode of this season.William Fichtner plays Agent Alexander Mahone who we think just wants to catch them but it later turns out that he has been ordered to kill them. Plus that's not all that makes this guy a threat....he's extremely smart and always seems to know what Scofield's next move is going to be. Which is another thing that makes this season so thrilling. You never really know what this guy is going to do next or who he's going to find next. I was hoping he'd find and kill T-Bag (Robert Knepper) but that sleaze ball makes it through the whole season. I don't wanna see this guy die because Knepper is bad at playing him or anything. I wanna see him die because Knepper is fantastic at making you hate this worthless piece of garbage. He's a rat that kills innocent people and slizzers his way away through most the season.Paul Adelstein as Agent Paul Kellerman is back after Scofield and Burrows. But he makes some important decisions as the season goes on and turns out to be just what they need if they want to clear Burrows' name. So there's a lot of character development going on in this season. There's a lot of running going on this season but since this show has great writing it's always engaging and you never really know what is going to happen next. So it's not just a whole lot of brainless chase scenes through the whole season. It's always exciting and has you at the edge of your seat. Plus there is still some scenes where they are captured and have to figure out how to escape. Hell this season has everything really. It's really a must see!", "overall": 4.0, "summary": "A Non-Stop Edge of Your Seat Season!", "unixReviewTime": 1178928000, "reviewTime": "05 12, 2007"}, {"reviewerID": "AB0GGIQBNB36Q", "asin": "B000IXUOP0", "reviewerName": "Ben Milton", "helpful": [0, 0], "reviewText": "To me, season four is the last of the great NCIS seasons, until season Nine. Gibbs is in Mexico, Ziva is on the run after being framed by a former massad officer who everybody thought was dead. Tony is the team leader, and Mcgee is no longer the probie. Ziva calls Gibbs in mexico, and he agrees to come back to the states to help. The F.B.I gets involved. But in the end, Ziva proves that she's an Investigator first now, and gets the killer to talk. Which clears her, and allows Gibbs to go back to Mexico. But not for long, as Fornell asks Gibbs's help in solving a case, which he does. And decides to come back to NCIS for good, the stories in season four are outstanding. The Halloween story alone is worth watching, as a marine is attacked in his home. And his daughter is kidnapped, and all throughout the case, Ziva thinks that the Daughter's mother is the one who kidnapped her own daughter. But alas, in the end she is wrong.  Or the creepy episode, \"Smoked\". Where a body is found in a chimney, the body of a sadistic serial killer with a toe in his stomach, only come to find out his wife was the actual killer. As she buried the bodies in their yard, and the episode ends with Gibbs asking fornell how he thought the toe got in the guys stomach. There are two threads of stories throughout this season, one is Tony has a new girlfriend, and Gibbs has a Girlfriend Col. Hollis Mann. We also find out, that Mcgee is a fictional writer. We're introduced to Shariff, in two incredible episodes, where they stop the terrorist the first time, and Gibbs is almost killed the second time they meet. Also in this season, we eventually find out that Tony's girlfriend is his undercover assignment for Director Shepard. As she tries to get an international arms dealer  La Grenoulle, now Ducky had been mad at Gibbs for quitting, but eventually they become friends again. And Paula Cassidy and her team are killed in an explosion, in a really powerful episode, season four ends with Jeanne and Dinnozo getting in a limo, which is her father's, and there is La Grenoulle. Season four again, is the last of the great NCIS seasons.", "overall": 5.0, "summary": "while it's complicated, it's good.", "unixReviewTime": 1346976000, "reviewTime": "09 7, 2012"}, {"reviewerID": "A42GFMF12V7XR", "asin": "B000JEZBNI", "reviewerName": "Paul J. Mular", "helpful": [16, 21], "reviewText": "This is a re-packaging of the Original Series Season 1 box set. It includes only the first two discs with the first 16 episodes.Only for those who don't want to buy an entire first season!Disc 11. The Galaxy Being2. The Hundred Days Of The Dragon3. The Architects Of Fear4. The Man With The Power5. The Sixth Finger6. The Man Who Was Never Born7. O.B.I.T.8. The Human FactorDisc 29. The Corpus Earthling10. Nightmare11. It Crawled Out Of The Woodwork12. The Borderland13. Tourist Attraction14. The Zanti Misfits15. The Mice16. Controlled ExperimentFive Stars because the first season of the original series was great!", "overall": 5.0, "summary": "Season 1 (Part 1) , not the complete season 1!", "unixReviewTime": 1175126400, "reviewTime": "03 29, 2007"}, {"reviewerID": "A1QGMIQD8ZYDS8", "asin": "B000JO9JHW", "reviewerName": "Ralph J. Fitcher \"Namahotitae\"", "helpful": [1, 1], "reviewText": "I bought this dvd and 5 other seasons on the recommendation of my back doctor. So, far the first episode has been very dry and dull. The second episode picked up nicely. I am up to the fifth episode and still unsure about this show. At times, it's a series about a psychotic serial killer with morals. Other times, it's about a man who has no feelings but shows emotions like anger, frustration and fear. Oh, and there's the relationship between the main character and his damaged girlfriend. Who he feels is as damaged as he is. Now, I do hope these are not considered spoilers, as they are the central focus of the series it seems. There are more things going on in the series, such as his past relationship with his foster father, he relationship with his foster sister, his relationship with his coworkers etc. At this time, I can see the character developing into a very interesting but bizarre person. And of course the series will follow suit. We hope. After all, I have 6 seasons to watch. Can I recommend this series, sort of. I am not quite certain it is for everyone. It's growing on me though. So, I gave it three stars. Perhaps I should give it four, but time will tell.Ralph J. Fitcher.", "overall": 3.0, "summary": "Dexter, a very twisted, but interesting show. . .", "unixReviewTime": 1369699200, "reviewTime": "05 28, 2013"}, {"reviewerID": "A96JD9312DHWC", "asin": "B000JO9JHW", "reviewerName": "TorridlyBoredShopper \"T(to the)B(to the)S\"", "helpful": [3, 4], "reviewText": "Dexter Morgan - blood Spatter Expert and Serial Killer. He's been living a double life for a while now and has kept that paart of himself shelves and out of the way. The only person who knew was someone from his past, and that person taught him a great many things on staying alive in such a mad world. Dexter also has a squad of people aroudn him you will get to know, a sister you will get to know even more, and a case you will grow to love featuring The Ice Truck Killer. In this episode we see Dexter (and see the overlap better book 1 and this season) and the way he sees blood, not to mention the Dark Passenger. We also see the ITK and the way he kills and the way Dexter admires the person's style.Its like living in Dahlmerland - that's how the book put it - except there are no rides (thank goodness).M.C. Hall is the PERFECT Dexter. After 3 seasons of him I can say he is the reason that Dexter connects with people and is not a monster to us. Watch the show - you will see. Jennifer C - his sister Deb - is also a unique personality here and you will grow to enjoy her. She has a sailor's mouth and keeps in shape and loves to pick the wrong type of people. She plays it to a tee. And the rest of the cast are great as well and, if you think you know how it all ends because you read the book, you are wrong. The book and this are different in a lot of ways AND the end is a strong part of it. So, readers, watch this as well.Closing this up, the twists and turns are great and learning about Dexter's past is a wild ride. You learn a lot in this season, too, and you see how Dexter was \"made.\" You also see other things, bits that are spooky and the things he does away with, making you wonder exactly what the Dark Passenger is doing riding shotgun with Dexter.So many rules - so many graves. He is in the perfect place to be himself, that's for sure.", "overall": 5.0, "summary": "Readers - the book is alike and yet different. Simply going one route will only show you one piece of an otherwise large puzzle.", "unixReviewTime": 1281398400, "reviewTime": "08 10, 2010"}, {"reviewerID": "AQP1VPK16SVWM", "asin": "B000JQYE4I", "reviewerName": "Wayne Klein \"If at first the idea is not absu...", "helpful": [3, 3], "reviewText": "All roads for Vic Mackey (Emmy winner Michael Chiklis) lead to this. After Mackey killed Terry Crowley during the first season of \"The Shield\" karma was going to catch up with him sooner than later and now the Strike Team is under I.A.D. investigation by Jon Kavanaugh (Oscar winner Forrest Whitaker). Mackey seemed on the road to redemption during the fourth season when the new captain (Glenn Close)gave him the chance to reassemble his team and make a difference in the Farmington police district. The investigation that she instigated which was designed to exonerate members of her team has turned into crusade where Kavanaugh will use any and all teams to bring down Mackey and his team.By the fifth season of \"The Shield\" I was afraid the show would jump the shark--in fact it has done anything but that with writing that is still among the best on TV with morally complex characters sporting shades of gray to their personalities vs. being simple black and white caricatures of good guys and bad guys. Chiklis proves as he has over the last four seasons to be one of the best actors on TV with his complex portrayal of Mackey. Chiklis though wouldn't be where he is without the terrific supporting cast. During the fifth season Mackey's nemesis begins to resemble him as he tries to bring down Mackey and his team. Mackey may be morally corrupt person but there is still a decent person buried somewhere within his soul which allows fans of the series to be rooting for him even if he is often the bad guy (hey, he killed a cop in the first episode of the first season!).The show looks grainy and dark which benefits the cinema verite/documentary look of the show with its handheld cameras and unexpected pans. As always Dutch(Jay Karnes) and Claudette (CCH Pounder)continue to be the moral center and conscience of the show and as fascinating as Mackey and his team are, these two detectives are equally as fascinating as they bring down a serial killer with perfect alibies and other difficult to crack cases. The politically astute former Captain of the station David Aceveda (Benito Martinez)continues to have a darkness to his \"moral\" character particularly after the physical assualt at the hands of an ex-con that occurred during the third season.The DVD has some great special features including commentary tracks with a nice mix of cast members, a featurette on the productio of the fifth season, a tribute to executive producer/director Scott Brazil who died during the sixth season and a Q&A; session with Chiklis, producer/writer/creator Shawn Ryan and Forrest Whitaker discussing their characters and the development of the series. We also get deleted scenes as well as the sixth season \"prequel\" that sets up season six.The seventh season (which will air this spring)is reportedly the last season for the show so if you've caught the bug for \"The Shield\" but fallen behind in watching the show, now you can spent time either catching the reruns or watching the DVDs in plenty of time for season seven.Highly recommended.", "overall": 5.0, "summary": "Mackey almost meets his match in Kavanaugh", "unixReviewTime": 1183680000, "reviewTime": "07 6, 2007"}, {"reviewerID": "A1KZQ5DIX0YUE1", "asin": "B000MVIAUY", "reviewerName": "Eric E. Johnson \"'ntohign slhe thaersam'\"", "helpful": [0, 0], "reviewText": "This review has one slight spoiler in terms of what the brothers hunt in a single episode... you've been warnedThis season of Supernatural gives us a dose of comedy many probably wouldn't expect from a show that is \"scary\". But the scary ramps up too. Everything escalates. The plot of Season One is extended greatly as Sam tries to track down others 'like him'. We get great guest stars (Katharine Isabelle from the Ginger Snaps films; Linda Blair.... LINDA BLAIR! from the Exorcist)and we witness the come back of one who becomes a fan favourite: Jim Beaver's Bobby Singer. We also see what became fan favourite episodes such as 'Heart' (werewolf alert), 'What is and What Should Never Be' (djinns), and &lt;SPOLIERS>  ----- 'Tall Tales' (a Trickster, a la Coyote, Anansi, Loki, etc)&lt;/SPOILERS)>.Religion comes to a head, and it is easy to see that it is going to intrinsic to future episodes. Hindu and Muslin faith enters center stage, and they do it well, given as much or more reverence than the Catholic and Christian dogma. Perhaps the greatest achievement of  this season is that the writers merge the 'monster of the week' theme by making those monster hunts have some allusion to the metaplot or even fuel the the on-going episodes. So just a head's up: the show is quickly veering into theological discovery. But - they are smart enough not to shove it down anyone's throat.Now, for the fun stuff: the CGI is outright brilliant this season, and it only gets better as the season go on. The audio is set for 5.1 Dolby Digital. As for Special Features, they are the ho-hum variety but made oh some not ho-hum by the crew and cast. It is easy to see these guys love their work. We have a few commentary tracks, deleted scenes on a few of the episodes, a 'making of' in regards to the second jaw-dropping finale.This show is just getting started.", "overall": 5.0, "summary": "Horror + Comedy = TV Greatness!", "unixReviewTime": 1313625600, "reviewTime": "08 18, 2011"}, {"reviewerID": "A342CAVHO0T0PC", "asin": "B000MVN8GK", "reviewerName": "Flying Lady 76 \"N2theBlue\"", "helpful": [0, 0], "reviewText": "Couldn't think of a thing.  It is too bad the show ended after 3 seasons.  Just watched the VM Movie.  It was just enough to tie up some loose ends, but opened up new mysteries that I suspect will remain just that...mysteries.  The very last episode was really depressing.  Keith's roll especially was sad.  Always the bridesmaid; never the bride was wearing a bit thin.That being said; I loved it anyway.  Logan and Veronica - epic saga, spanning vast continents...to paraphrase LoVe.  If you haven't watched this series it is so sweet, sad, cleaver, romantic, mysterious and wonderful.  Yep, I'm hooked and got my hubby to watch all 3 seasons and the movie.  We have grand kids, so it is fun for all ages.  Ah, to be young again.  Not!  Just kidding.  Watching VM made me remember why I was glad to graduate HS and never looked back.  It is painful being a teenager and this series was a reminder (fictional though it is) how vulnerable and at risk they can be.  Food for thought.", "overall": 5.0, "summary": "What's not to lover about VM?", "unixReviewTime": 1403568000, "reviewTime": "06 24, 2014"}, {"reviewerID": "AFUHVCBFHXB89", "asin": "B000MVN8HE", "reviewerName": "Colonel D", "helpful": [0, 0], "reviewText": "I am fairly certain that when Rob Thomas was developing Veronica Mars over 10 years ago that I was not the demographic he was shooting for.  Well, call me Mr. Staypuff because I'm a genuine \"marshmallow\" fan of this show.  Growing up I was a big reader and quickly ran through all the Tom Swift and Hardy Boys books published.  My next door neighbors were three sisters who had the entire Nancy Drew library which I also read and enjoyed.  Maybe this is why I love this series-  and now this movie.  The characters reunited in another mystery was a lot of fun.  I think the success of the Kickstarter campaign to fund this film starts with Kristin Bell, she totally sells this character and owns it.  Pretty, smart, and sassy she's very entertaining and compelling to watch. A contemporary, darker Nancy Drew strikes just the right note and is credible.  The support cast of largely unknown actors work well together and the sprinkling of known actor guest stars are blended well into the stories.  Of special mention is Enrico Colantoni as Veronica's dad, P.I. and former sherriff Keith Mars.  I only know him from his work on \"Just Shoot Me\" which was a comedic role but he's perfect as Veronica's father.  My only frustration with the series was the seemingly endless poor relationship choices Veronica makes for such an intelligent young woman. That said I was never a team Piz fan and guess her serial boyfriend Logan works the best.  I think this movie gives fans some closure since at the conclusion of season 3 Rob Thomas and company did not know if they'd been renewed or not.  For some critics of the updated presentation, and one who picks on Kristin Bell for essentially not being as \"hot\" as she was 10 years ago and looking like she just had a baby (which she did) all I have to say is don't attend your high school reunion dude, you're going to be disappointed!  Do I here sequel?", "overall": 5.0, "summary": "We used to be friends, a long time ago and it's good to have you back", "unixReviewTime": 1404086400, "reviewTime": "06 30, 2014"}, {"reviewerID": "A1KIQ4P4ZW3ALF", "asin": "B000MVN8HE", "reviewerName": "G. Teslovich", "helpful": [4, 16], "reviewText": "This is a first: An unusual number of five star ratings at a rate that surpasses all of this past years Academy Award (Oscars) nominated movies put together (TOTAL). Also, interesting is that the same fanatic slasher types are hacking the heads off of any one who dares give it one star (or less). Depending on date the same reviewers gave the one star reviews a: 0 out of 25; 0 out of 14; 0 out of 13; 0 out of  12, 0 out of 11. I'm just happy they're not all from Salem.The reason: A large number of people are making sure their Kickstarter funding for this movie proves rewarding.The movie: Simplistic dialogue that could only come from a cliche saturated Hollywood high school apprentice writer. Acting so bad the actors could manage only one short emotionless line then pause for the next actor to robotically respond in kind; back and tediously back and forth. Scenes composed of  95% dumbed down dialogue. Other 5% of scenes composed of a superficial attempt to  appear current e.g. tablets, internet video, Samsung product placement phones. Lot of formula characters e.g. dumb act cool cops; surfer dude; party people; lawyer cutouts; etc.Baddd: How bad? I was ff after 10 minutes and checking it every 10 to see if anything changed. Answer - as blandly homogenized as milk.People! For the honest reviewers not financially invested in this movie; if you want to see quality acting, storyline, sets, props and actually have to think, then watch \"The Best Offer\". It may cleanse you of the effects of this film's shallow banality. As far as the \"fanatic-obsessives\" I hope that VM series wasn't a representation of lives (un)productively lived. Let me know.", "overall": 1.0, "summary": "Kiosk &lt;1", "unixReviewTime": 1399680000, "reviewTime": "05 10, 2014"}, {"reviewerID": "ABLBRUT8DALNN", "asin": "B000OC2T4Y", "reviewerName": "Todd Smith", "helpful": [1, 1], "reviewText": "The Riches is the most recent TV show I've been watching, and I have one question. How in the world could they cancel it!? More people watched the premier of The Riches than ever watched an episode of the Shield or Rescue Me. It's also got to be one of the most creative shows I've ever seen! The show centers around the Molloy family, a family of modern day gypsies. Today is a big day for them as the matriarch of their family is being released from jail, after serving a two year sentence. A big party is thrown for her and all seems well in the Molloy family, but things aren't what they seem. The Molloy family is forced to leave their camp. Wayne (Eddie Izzard) is not going empty handed though. Before leaving he cracks the camp leaders safe and takes a substantial amount of money. Once on the road, they run into another family from camp, that had been oblivious to what was going on. It doesn't take them long to realize something isn't right, but before they can confront them, the Molloy's take off and a big highway RV chase begins. During the chase a passing motorist and his wife are killed. The man and woman are Doug and Shrine Rich, and they are on their way to a new home in Eden Falls. Doug was a savvy lawyer, who made a fortune at the expense of others. On this day he and his new wife were on the run also, moving away from everyone and everything they've ever known to move to a new state and into a new house they bought on the internet. Thanks to paper work in the car, Wayne Molloy quickly realizes who these people were and where they were going. It is then that he decides it's time to stop traveling the country and settle into a nice, normal, \"buffer\", lifestyle. Living in Eden Falls as Doug and Shrine. Along with their 3 kids, the Molloy's try to adapt from being a family of travelers to a family of wealth and stability. The show is amazing! There are so many twist and turns, cons and jokes, ups and downs, It's so well written, with an outrageous cast of characters, and most important of all, a storyline I promise you have never seen before!  The show was cancelled by FX in late 2008, but both seasons are available, and according to Wikipedia, Eddie Izzard and the show's creator are currently working on a full length feature film. If you want something different crossing comedy, drama, and action, then I'd say The Riches are for you!", "overall": 4.0, "summary": "The Ultimate Movie Review! - [...] - @tss5078", "unixReviewTime": 1362009600, "reviewTime": "02 28, 2013"}, {"reviewerID": "A356RFKNIG043B", "asin": "B000OFME82", "reviewerName": "K. Swanson", "helpful": [0, 0], "reviewText": "Moments of real comedy on this show, and sometimes really brave comedy, are almost always followed by moments of truly moronic humor. \"Poop\" jokes are a favorite, for example. Sarah gets points for the occasionally brilliant surrealistic humor, then loses them for her sheer idiocy. It's hard to like this person/character, despite her occasional genius.She is also very anti-semitic at times. But, she is also Jewish. Are Jews allowed to make nasty fun of Jews and also of manufactured anti-semitic hysteria? Anyone else would be declared a war criminal for making a joke about big noses...but apparently if you're Jewish you can go much, much much farther than that. At one point she even suggests the Holocaust was faked. How dare she? To the electric chair! But wait...she's Jewish...I would love to see more Christian and Buddhist and Hindu and Muslim and Jainist etc comedians who have this sort of egotistical self-loathing cushioned by loathing of everything and everyone else as well. But somehow we don't get much of that.Silverman says that's because the media is largely owned and run by and for the Zionists who make the US fight their wars while they run their banks and Federal Reserve, but she is Jewish, so she can say that. It's darn offensive, however true it may or may not be, and I think she should apologize. It does explain her getting to do a show this offensive, though, so maybe it all makes sense. Her boyfriend is Jimmy Kimmel, perhaps the least talented person on TV (quite a feat), so it all fits together in some arcane fashion.In any case, while there's some uniquely weird and funny stuff here, the poop that surrounds it makes it somewhat of a moot point.It ain't normal, so that's a plus.But it's also often so mean-spirited that it just ain't funny.", "overall": 3.0, "summary": "The bad overwhelms the good", "unixReviewTime": 1194134400, "reviewTime": "11 4, 2007"}, {"reviewerID": "A2CVP31XTYSZFE", "asin": "B000OGTRC2", "reviewerName": "Celia Hayes \"Sgt. Mom\"", "helpful": [1, 1], "reviewText": "I have now come to that stage of life where I have seen every standard TV plot so many times that I am now able to predict the denouement almost as soon as I see the setup and have declared a personal embargo on watching any more shows about doctors, lawyers or cops. While some of the current offerings (House, Scrubs, etc) are quite passable - there are other occupations, and other situations which in the hands of the creative, will offer sufficient interest to keep viewers returning on a regular basis. Shows like \"Lost\" and \"Ugly Betty\" are splendid examples of what can be done by stepping outside of the cop-lawyer-doc box, and \"Jericho - Season One\" is another. Take an intriguing and (for television) a semi-original situation, involve a large cast of interesting people reacting to it and voila - something that will bring back the audience, over and over. Especially when it is a situation that we might imagine happening to ourselves. After 9/11, and Katrina (which provided the genesis of \"Jericho\" to its creators) it is all to easy to imagine what happens when the world we know suddenly ends, right in the middle of all our mundane plans for a perfectly ordinary day.Which is exactly what happens to the citizens of the small town of Jericho, Kansas, to the family of Johnston Green (Gerald McRaney) and their neighbors and friends. Jericho is a small, pleasant place, full of people going about their own business - farming, stocking the grocery store shelves, going through a mayoral election, planning a wedding and enduring an audit by a visiting IRS agent. The school children are off on a field trip and the Green's black-sheep son Jake suddenly appears needing a great deal of money - the only ripple in the pleasant still pool of a modern American life. In one of the most quietly effective sequences, the camera follows two children, playing hide and seek in a back yard, while one climbs on the roof of a shed, and then onto the house roof. The boy suddenly freezes there, silhouetted against the clouds and the sky - and then we see what he has seen; a mushroom cloud, coming up from a line of mountains on the distant horizon.And that is the exact point where the people of Jericho, and a handful of visitors who just happen to be there begin a long slow devolution from the twenty-first century into something that more resembles the frontier West... and then to a condition that looks more like the warring city-states of Renaissance Italy, or classical Greece. First they struggle to figure out just has happened to the rest of the country - and then begins the fight to survive, ending in a cliff-hanger which promises a large audience for the second-season premiere. It makes for a more interesting television show than I had thought, when I first heard about it. The first season set of 22 episodes is neatly packaged on 6 discs. Commentary and deleted scenes are included for selected episodes on the same disc. I would have much rather that deleted scenes be edited into the episode where they belonged, to make a sort of \"director's cut\", rather than having them tacked on as an appendage. The omitted scenes would have done a lot for the overall story; it's clear that they were omitted to shorten each episode for broadcast.Other extra features included a rather interesting \"making of Jericho\" feature, which included some actor auditions, and a look at set construction, and a short about disaster preparedness, which included some unintentionally hilarious 1950s Civil Defense footage on how one should shelter under a desk or behind some furniture in the event of a nuclear holocaust.", "overall": 5.0, "summary": "An Intriguing Premise", "unixReviewTime": 1243900800, "reviewTime": "06 2, 2009"}, {"reviewerID": "A25KKXUQQ0OLWB", "asin": "B000OGTRC2", "reviewerName": "Lynn Ellingwood \"The ESOL Teacher\"", "helpful": [0, 0], "reviewText": "When I first watched the pilot, I saw too many pretty people with nice hair and though they suffered from a nuclear attack far away, no one suffered from soap and water much less styling goods.  As time went on, people complained about lack of goods but it never really makes much of a dent.  The lack of gasoline, etc. is discussed but in the end it really doesn't affect the residents much.  Besides these concerns, I became more involved in the show and the realism of the setting didn't bother me as much.  Actors meld with their characters and they become more interesting and human.  Jericho in Kansas is a place where the bombs were not supposed to go off and be a safety zone for the terrorists who have detonated the bombs.  The residents don't know what went on and only gets bits and pieces as the series moves on.  The main characters are Jake Green, the son of the mayor who has been mysteriously absent for several years.  He seems to have been in Iraq as a soldier.  The other main character is Hawkins,  an African-American man who mysteriously appears with his family for unknown reasons just before the bombing.  As time goes on, Jake and Hawkins appear to be the heros who will save the day.  The series becomes more and more detailed and exciting.  I was impressed with the choice of great actors in the series including Gerald McRainey who plays the mayor, Pamela Reed as his wife and Lennie James as Robert Hawkins.  One of the most impressive things in the series is allowing Lennie James, a British-African actor. to rise up to be a star.  There aren't many black actors being allowed to act and participate in a show except as the buddy and Hawkins is a character who surpasses everyone else without argument.  The series only lasted a year and a half but if very impressive.  It began when the networks were attempting to challenge cable channels with higher quality series just as they did with Lost and Desperate Housewives.  Those shows lasted longer and lost their impact so maybe it was luck that this show was short and still impressive.", "overall": 5.0, "summary": "Grows On You and Then Becomes a Classic", "unixReviewTime": 1344729600, "reviewTime": "08 12, 2012"}, {"reviewerID": "A6VXZ1EEPRTLV", "asin": "B000OGTRC2", "reviewerName": "trebe", "helpful": [1, 1], "reviewText": "Great writing, and compelling characters in a dramatic situation, are some of the reasons why Jericho is very compelling serial television.  The story centers on the events in the fictitious town of Jericho, Kansas, after a nuclear attack.  The immediate concern is survival, and then maintaining basic government structure, medical facilities, and utilities.  As characters are defined, past lives and secrets are disclosed, and roles, old and new, are formed.Exactly what happened is a mystery, and while some things are revealed, it is evident to viewers that there are several hidden conspiracies.  The situation gets more complex, as new characters appear, and a hazy picture of the new America slowly takes shape.The key figures in Jericho, are from the Green, Richmond, and Hawkins families.  The ensemble cast is great overall, but Skeet Ulrich's performance as wayward son come home, Jake Green is superlative, and the glue that holds much of story together.  Gerald McRaney as Johnson Green, the mayor of Jericho, brings incredible toughness and leadership, to a situation that demands it.  The wild card that separates Jericho from being just a post holocaust survival tale, is Robert Hawkins (Lennie James), a newcomer in town engaged in something very, very, deep.The writing is often clever and suspenseful, with unexpected developments springing up.  Although things begin slowly, the season finishes in a flurry, with the town on the verge of all out war.  Quite sobering, for a network television series.  The writers mix things up, using creative flashbacks, and bringing back characters, and even a tank, in later episodes.  While there are inconsistencies and illogical events, and some things have to be toned down for television, the story builds to a riveting conclusion, leading to a second season, that almost never was.  Family values, morals, and patriotism, are some of the values that led to the founding of America, and this series effectively touches back to them.Executive producers Jon Turteltaub and Carol Barbee provide commentary for a few episodes, and Skeet Ulrich and Lennie James, also contribute commentaries.  'Building Jericho' is a 24 minute documentary feature, about how the town of Jericho was constructed, and some interesting background information.  A series that will make you think, thrill you, make you cry, and remember what it means to be an American.  Jericho is a remarkable program that should not be missed.", "overall": 5.0, "summary": "riveting, edgy, thought-provoking, serial television . .", "unixReviewTime": 1251590400, "reviewTime": "08 30, 2009"}, {"reviewerID": "A3KEZLJ59C1JVH", "asin": "B000OJFV3S", "reviewerName": "Melissa Niksic", "helpful": [73, 79], "reviewText": "I just finished watching the entire first season of \"The Tudors.\" When the show first premiered on Showtime, I watched the pilot episode and never bothered to watch it again. I thought the show was visually appealing, but way too melodramatic and historically inaccurate for my taste. However, I recently read a fascinating book about Henry VIII, and I needed something else to satisfy my Tudor fixation. I watched all the episodes of \"The Tudors\" On Demand in less than a week, and I really enjoyed them.In order to appreciate this program, you have to be willing to accept the show for what it is. Yes, the majority of the characters and plots in the show are based on real historical events, but this is a cable television series, and of course things are going to be changed to appeal to a larger commercial audience. As a result, all of the people in King Henry's court are much more attractive than they probably were in real life, and there are some major alterations to historical timelines. Still, I'm impressed that the producers actually did get so many things right with the show, and overall, it's very engaging to watch. The pacing is exciting and fast...perhaps a little too fast, in my opinion. For example, Elizabeth \"Bessie\" Blount gets knocked up with Henry's illegitimate child in the very first episode, and by the second episode, she's already giving birth. I wonder how long \"The Tudors\" can realistically continue to air with such a rushed chain of events.For the most part, I think the casting of the show is excellent. I've never been a big fan of Jonathan Rhys Meyers until now, but his portrayal of Henry VIII is intense, dramatic, and exciting. Sam Neill is brilliant as the two-faced Cardinal Wolsey, and Natalie Dormer is perfect as the bewitching Anne Boleyn. As far as the characterizations of these famous characters goes, I think Henry VIII has been a bit one-sided in Season 1. I'll be interested to see how Meyers tackles the role when Henry finds himself betrayed by the woman he nearly sacrifices his kingdom for. It would be nice to see a more emotional side of Henry. Also, I think Anne has actually been pretty likable so far...hopefully she'll become a much darker character in Season 2.Overall, I enjoyed \"The Tudors\" much more than I thought I would. It's entertaining, and people who enjoy learning about this period in history will definitely get a kick out of it. I am eagerly anticipating the arrival of Season 2.", "overall": 4.0, "summary": "Flawed, but fun", "unixReviewTime": 1198195200, "reviewTime": "12 21, 2007"}, {"reviewerID": "A16XRPF40679KG", "asin": "B000ULZLYY", "reviewerName": "Michael Dobey", "helpful": [0, 0], "reviewText": "monk was a smash hit on tv for all of it's series. The show was followed by another hit 'psych' on the same network. Which gave that cable channel two really competitive hits. Monk didn't end it's run from bad ratings , instead fans were happy to see tony shaloub play this character for another 8 seasons. But he was tired of it so the show left the air with the central mystery finally solved. the early episodes featured bitty scram,  she was a excellent aide and did a great job as monks nurse aide. She wanted more money and was fired after a few series. this is a common mistake that many actors make. Only it's worse for women. roles for men are many. there's FAR less for women and a actress on a hit show shouldn't bail unless she has another real offer. this happened to terry farrel on 'becker' and she hasn't worked much sense. tony was well known for 'wings',one of the best of the 1990's sitcoms in the u.s. and a worldwide hit. You can see the show on reelz network in hd today. here he is the lead character and he creates a really sympathetic compulsive detective. ted levine is excellent as his friend capt stotelmyer. The second actress who plays the aide to monk also is engaging and did a fine job.  The whole series is still well lvoed , just like wings is and hopefully a reunion show is in the works for sometime in the future.", "overall": 5.0, "summary": "a modern classic on dvd.", "unixReviewTime": 1344816000, "reviewTime": "08 13, 2012"}, {"reviewerID": "AER15RIMV8E6D", "asin": "B000ULZLYY", "reviewerName": "Pumpkin Man", "helpful": [2, 3], "reviewText": "Season 1- Monk is a hilarious and an incredibly entertaining series. Three years earlier, Adrian Monk's wife, Trudy was murdered by a car bomb. He has extreme O.C.D. and relies on his Nurse/Assistant Sharona to help him while he solves murders with Captain Leland Stottlemeyer, and Lt. Randy Disher. Throughout the season Monk investigates an assassination attempt on a Mayoral Candidate, goes to an asylum, takes a vacation, deals with an earthquake, helps prove the innocence of Willie Nelson, and much more.Season 2- Monk's 2nd is just as hilarious and entertaining as the previous season, perhaps even better. Adrian Monk is still miserable and continues to help Captain Stottlemeyer and Disher with solving murders, with the help of his Assistant, Sharona. Throughout this season Monk investigates a murder at Trudy's high school, goes to Mexico, help prove the innocence of Sharona's sister during a stage play, figure out why a paperboy is killed for the newspaper, gets married, goes to jail, and finally gets a new lead in the murder of Trudy.Season 3- This is probably my favorite season. During the course of this season, we say good-bye to Sharona Fleming and hello to Natalie Teeger. Monk investigates Warrick Tennyson's role in Trudy's murder, gets fired, helps an organized crime family, becomes a contestant on a game show, gets stuck in traffic, goes to Las Vegas, adopts a kid, and much more.Season 4- Throughout this season Monk returns home on HALLOWEEN, stays in bed because he's sick, gets drunk, goes to a fashion show, figure out who would want to poison Stottlemeyer at the Christmas party, gets amnesia, stop a killer astronaut, and figure out if Trudy Monk had faked her death.Season 5- Throughout this season Monk deals with a garbage strike, loses his eyesight, attends his college reunion, goes to a rock concert, finally meets his dad, goes on the air, and much more.Season 6- Throughout this season, Monk must deal with his crazed fan, help a rapper, teaches Julie Teeger about love, hang out with his psychiatrist's son, shoots Santa Claus, joins a cult, becomes a fugitive, and finally has a new lead in the murder of Trudy.Season 7- Monk is forced to find a new therapist because Dr. Kroger has died. Throughout this season Monk matches wits with a chess player, helps a boxer, gets stuck on a submarine underwater, meets his other brother, fights City Hall, and much more.The Final Season- In the end, all the pieces will fit together. Throughout this season, Monk serves as a bodyguard for his favorite actress, investigate a UFO sighting, goes undercover as a Mafia boss, celebrates his Birthday, receives a surprising visit from Sharona Fleming, and finally solves the murder of his wife, Trudy. It all comes down to this. This season felt a little rushed, but is the perfect ending to the Monk saga. I highly recommend MONK: THE COMPLETE SERIES!!!", "overall": 5.0, "summary": "One of the Best Shows Ever!!!", "unixReviewTime": 1322524800, "reviewTime": "11 29, 2011"}, {"reviewerID": "A1FEITLECMZ6EW", "asin": "B000UU4IX0", "reviewerName": "Jeffrey Thomas", "helpful": [1, 1], "reviewText": "Spoiler related wording (basically going around the spoilers, relating to them but not specifically stating what they are):This episode was amazing. The two part judging of Gaius Baltar was really good to. The revealing of 4 more Cylons out of the final five was amazing; especially when you find out who they are. It blew my mind to find out. Anyway, this episode, and the last one, have an intriguing element, the music, that is interesting and weird. I don't really understand why music, but it probably has some meaning. The build up in this series has been really great. This series is now in my top 5. I don't know where to put it. It's awesome. To anyone who hasn't seen this episode or the last one yet, don't skip these, these are very important and amazing episodes. You'll be blown away at the end of this episode, of that I assure you. Really, I do have to wonder who the fifth Cylon is. That's the question that will probably echo through the next season. Great season, awesome series so far, can't wait to watch the next season.Oh, final note, as I didn't list it before. You get to see a someone you didn't expect to see in this episode. Plus, that person has news, great news. It's interesting to see that person again. It really adds to the excitement of the ending of this season. I had to wonder if Lee was hallucinating or not at the end. However, I'm going to guess no, even though that is a really mind-boggling idea. The music at the end was a really big help as it really did add to what was going on; a perfect element to add.This series is awesome. I'm going to love seeing what happens next.", "overall": 5.0, "summary": "A-W-E-S-O-M-E !!!!", "unixReviewTime": 1349740800, "reviewTime": "10 9, 2012"}, {"reviewerID": "A3KEZLJ59C1JVH", "asin": "B000UU4IX0", "reviewerName": "Melissa Niksic", "helpful": [16, 20], "reviewText": "I continue to be amazed at how much I love \"Battlestar Galactica.\" I usually don't enjoy science fiction, but this show is unlike any other sci-fi series I've seen before. In fact, \"BSG\" just may be my favorite television show of all time, which says a lot!Season Three of \"BSG\" picks up right where Season Two left off. The majority of people have been living on New Caprica for more than a year and are trying to build new lives for themselves. Unfortunately, the cylons eventually managed to track the humans down. After invading New Caprica, the cylons convinced President Gaius Baltar to cooperate with them. Now people live in constant fear of the cylon occupation. Resistance leaders including Chief Tyrol and Colonel Tigh continue to fight the cylons and attempt to come up with an escape plan, which is a very hard thing to do since both Adamas and their respective ships jumped away from New Caprica as soon as the cylons invaded. Obviously, the Adamas and their small crew can't just abandon the rest of humanity, and an elaborate rescue attempt is planned.I don't want to reveal too many details about the season and spoil things for people who may not have seen it yet. However, there's a lot that goes on in Season Three, especially where Tyrol, Tigh, Tory, Anders, and Starbuck are concerned. If you thought the Season Two finale was shocking, just wait until you see what happens at the end of Season Three!There are a few small issues I have with this season. First of all, I think there are too many \"one-shot episodes\" that don't really seem to advance the main plot of the show at all. Having a few episodes like that is fine, but I think there were an abundance of them this time around. Also, I'm not sure how I feel about the way certain music served as a major revelation during the season finale. Hopefully Season Four will do a good job of explaining things.Overall, though, this was a great season. I'm very sad that there's only one more season left, but I can't wait for it to start up again in March.", "overall": 5.0, "summary": "Frackin' amazing television!", "unixReviewTime": 1199750400, "reviewTime": "01 8, 2008"}, {"reviewerID": "AQP1VPK16SVWM", "asin": "B000UU4IX0", "reviewerName": "Wayne Klein \"If at first the idea is not absu...", "helpful": [5, 5], "reviewText": "As with all reviews this is about both the qualty of the set and the show. If you disagree post a review as these reviews are designed to help fans who haven't purchased or seen the show make a decision NOT whether you agree or disagree (that's what the comments section is about). Moving on...Every season of every TV show has episodes that don't stand up to the best that has come before and after.The show looks very good. The extras include podcasts, deleted scenes a terrific extended episode of one of Ronald Moore's favorite episodes \"Unfinished Business\". There are also 2 episode commentary tracks in addition to the podcasts ported over from the web from the original broadcast. David Eick's video blogs are also included as well as the webisodes (which I never got around to watching so it is kind of cool having it here). I would appreciate more behind-the-scenes type of specials but I like that sort of stuff. Fans who just want the episodes will be pretty well served by its presentation here.This is another really good set. I am disappointed that we don't have a Blu-ray version (yet) and I find it unlikely that Universal will be releasing this on HD-DVD with the collapse of the HD-DVD consortium. The show looks better than the standard definition broadcasts but not quite as sharp as the high definition. I'm looking forward to the fourth and final season of this terrific show. I'm also looking forward to Moore's future series (I am a bit disappointed with \"BG\" producer David Eick's update of \"The Bionic Woman\" which, while it has its moments can't even compare to \"BG\").PLOT SUMMARY AND SOME SPOILERS FOLLOW:  The third season has to my mind some of the best episodes of the series particularly during the episodes on New Caprica leading up to the deliverance from the Cylons. When we last saw the survivors of humanity they had settled on New Caprica. They were abandoned by the Galatica and Pegasus when multiple Cylon warships showed up in orbit because Adama (Edward James Olmos)and Lee (Jamie Bamber)felt that they weren't prepared to take them on. We get a healthy glimpse into the rigors and harshness of the Cylon occupation showing that, interestingly, they aren't any better or less flawed than their human captors.Saul(Michael Hogan)has started a resistence movement carrying out guerilla warfare against the Cylons to try and cause as much damage as possible in hopes of helping Adama on the ground when the Galatica returns to save them.From there the series deals with the fall out of settling on New Caprica in the first place, how humanity will deal with collaborators (it's one of the most riveting episodes of the season in my opinion), find out that the Galatica and the Cylons are on the right course for Earth and that there is a mysterious plague striking the Cylons. As with previous episodes the show deals with a number of ethical issues that other shows wouldn't (and couldn't) touch. I know that there are those that were disappointed with the 3rd season feeling it ran too long or that many of the stand alone episodes were weak but I would disagre; I felt that the quality was consistent with the first two seasons dealing with interesting and complex themes.", "overall": 4.0, "summary": "3rd season highlights are as good as previous episodes while some of the stand alone episodes don't quite hold up as well", "unixReviewTime": 1206057600, "reviewTime": "03 21, 2008"}, {"reviewerID": "A2QDPJRVXL7P4F", "asin": "B000UVUMDO", "reviewerName": "Sahra Badou \"Bibliophile\"", "helpful": [1, 2], "reviewText": "This is a really great TV series and I really enjoyed the many twists that kept me guessing throughout the episodes--and guessing wrong most of the time. I've always wanted to be a lawyer, among many other professions, and I immediately picked up this series upon seeing it at the Duty Free shop at Heathrow International Airport.This series exposes the world of litigations, and how they operate.  The whole season is about a class action lawsuit targeting one of the wealthiest CEOs (Chief Executive Officer). When lawyers try to win at all cost, lives and fortunes are lost. Is it worth it all? Are lawyers angels or demons in disguise? How far would we go for money? Is money worth destroying the lives of others? Are secrets worth killing for? Would we kill for money? How much money is enough? What is the price of betrayal, and when is betrayal ethical? These are just a few of the questions you will be asking yourself as you go through this series.The way the series is structured is that it shifts between past events and future ones. I did find this system to be confusing at times, but it does have its merits.This is a fast paced series. The acting is superb and the episodes are very well written and believable. The ending is spectacular, and unanticipated. I can't wait for season two.", "overall": 5.0, "summary": "Self-interest, corruption, polititcs, and greed!", "unixReviewTime": 1215302400, "reviewTime": "07 6, 2008"}, {"reviewerID": "A2TXR85WQLE32N", "asin": "B000VU2SW2", "reviewerName": "D. S. Thurlow", "helpful": [0, 0], "reviewText": "\"Chuck\" was one of the outstanding new shows of the 2007-2008 TV season.  It is a nicely balanced combination of action, spy spoof, and romantic comedy, featuring an outstanding cast and some sharp writing.  \"Chuck: The Complete First Season\" contains all thirteen episodes from a strike-shortened season, and some nice extra features.The premise: Chuck Bartkowski (Zachary Levi) is a twenty-something computer geek working for the BuyMore, a big-box electronics store in L.A.  He shares an apartment with his loving older sister Ellie (Sarah Lancaster) and her hunky doctor boyfriend.  His life has been stuck in neutral since being kicked out of Stanford, framed for cheating by a roommate who also stole his girlfriend.  One day, Chuck gets an email from his old roommate, which mysteriously implants a secret intelligence database known as the Intersect inside his head.Suddenly, Chuck must lead a double-life,  By day, he labors in the BuyMore with his offbeat co-workers, including his slacker best buddy Morgan Grimes (Joshua Gomez).  By night, and sometimes by day, he is a CIA asset.  He is \"handled\" by CIA agent Sarah Walker (attractive Australian actress Yvonne Strahovski) and hardnosed NSA assassin Major John Casey (Adam Baldwin).The Intersect causes Chuck to \"flash\" on various passing clues, prompting a weeky mission to foil some villian and his or her dastardly plot.  Invariably, the untrained and inept Chuck is told to \"wait in the car\" while Sarah and Casey pursue the bad guys.  Also invariably, Chuck ventures from the car and either needs rescuing or bumbles his way into rescuing his handlers.  Even though played tongue in cheek, the action sequences can get quite tense.At the heart of the series is the slowly evolving relationship between Chuck and Sarah, who as cover for her role as bodyguard, poses as his girlfriend.  For the totally smitten Chuck, this pseudo relationship is \"complicated.\"  The highly professional Sarah is not quite able to avoid developing feelings for the good hearted, decent and loyal Chuck.  Their efforts to pass off their relationship in front of Chuck's family and co-workers are the source of endless comedy and some genuinely touching moments.\"Chuck: The Complete First Season\" is very highly recommended as outstanding entertainment, just a little reminiscent of the old \"Get Smart\" series in an updated way.  Chuck has been renewed for a full second season of 22 episodes; the action and the romantic comedy continue.", "overall": 5.0, "summary": "Time for \"Chuck\"....", "unixReviewTime": 1230595200, "reviewTime": "12 30, 2008"}, {"reviewerID": "AZAC7B4HD5ZVC", "asin": "B000VU2SW2", "reviewerName": "Steven Herring", "helpful": [1, 1], "reviewText": "This show at first looked a bit laughable to me, but I assure you this is a well conceived series. All the actors have been chosen with great care, and they interact with one another as though they had been working with eachother their entire lives. They have great chemistry in every scene, it's like they're best friends in real life. The show has alot of comedy which is only broken up by action and dramatic story telling. What I love about the show is it's many references to movies, television, and video games. Chuck is not James Bond, not even close in fact. It is hilarious watching him try to fit into the world of espionage. He does have two bodyguards Sarah and Casey to protect him. Sarah is a beautiful blonde agent that is sent to be his girlfriend (lucky guy), and Casey is the heavy artillery side of the team. It's really fun to see Chucks and Sarah's relationship grow throughout the season. They clearly have great chemistry and that leads to some romantic moments. It's sorta like on LOST with Jack and Kate you know they want to be with each other but the plot dictates otherwise just teasing you here and there. Chuck also has a best friend Morgan who is responsible for most of the laughs as we watch his pathetic life, and the way he clings to Chuck's every move. Chuck and his family really keep the show grounded and really relatable to the every day guy. This show began well and only got better in season 2.The picture quality is another thing all together. It has grain in almost every frame. The picture is just filled with noise almost the entire time. It really is distracting and is quite disappointing. Chuck surpasses the picture quality with it's amazing characters and stories. The extras are decent with some deleted scenes, a gag reel, and audition footage.  The series is a mix of Alias, Mission Impossible, and Get Smart. It is the ultimate comedy hour mixed with great action.", "overall": 5.0, "summary": "A nerds ultimate fantasy.", "unixReviewTime": 1262649600, "reviewTime": "01 5, 2010"}, {"reviewerID": "A1T6MQBK8ZVW0F", "asin": "B000VU4GW2", "reviewerName": "Brenda Krekeler", "helpful": [0, 0], "reviewText": "Who was Damian Lewis anyhow?  W O W what a dynamic character as Detective Charlie Crews in the TV series &#34;Live.&#34;  NBC really dropped the ball by letting this series go with only two seasons.  NBC blames the 2007-2008 Writers Guild strike by cutting the first season to only 11 episodes.  NBC started the second season on Monday then flipped it to Friday, back to Monday, then back to Friday and eventually to Wednesdays I think.  I loved it but I couldn't find it most of the time.  There are 21 episodes for the second and sadly last season of &#34;LIFE.&#34;  Regardless, we have an albeit short first season but it is a block buster.  LIFE is a show that should have been a multi-season series.  NBC was harassed by idiot reviewers who couldn't see through their thick glassed windows having been scratched by watching too much TV for their prior reviews.  LIFE is and will always be a classic.  Damian Lewis and Sarah Shahi has a 'pop your eyes out' magnetic on screen performances.  The best recurring actor was Garret Dillahunt as Roman Nevikov.  Roman is the greatest hope for a TV nemesis ever.  Introduced in the first season, you will find him back in full force in season two.  They did wrap up the series successfully in season two.  When the final episode &#34;One&#34; aired April 8, 2009, the music was remarkable.  Thankfully, I had the episode recorded so I could identify the songs. Soon, I learned that the DVDs and all future airings of the last episode would never have the original songs.  Today, when you watch the last episode &#34;One&#34; you will find the ending flat due to the ridiculous faux pas of NBCs license for the songs. None-the-less, LIFE is a spectacular &#34;32-episode&#34; series that will always be in the hearts of viewers who worked hard to find it.", "overall": 5.0, "summary": "OUTSTANDING TV SHOW !", "unixReviewTime": 1368921600, "reviewTime": "05 19, 2013"}, {"reviewerID": "A2TXR85WQLE32N", "asin": "B000VU4GW2", "reviewerName": "D. S. Thurlow", "helpful": [3, 3], "reviewText": "\"Life: Season One\" is something completely different in a police procedural.  Charlie Crews is an L.A. cop who spent 12 years in prison for a mass murder for which he was framed.  Sprung from prison by a crusading attorney, Crews is back on the police force with a promotion to detective and a multi-million dollar legal settlement.The show operates on several levels.  Charlie Crews must readjust to life on the outside, where there is sunshine, fresh fruit, unfamiliar technology, and a large empty mansion to live in.  His wife and his former life are gone, although not entirely.  He approaches his new job from a unique angle, shaped by the Zen philosophy he adopted to survive inside.The police force has decidedly mixed feelings about his return; his new partner, Dani Reese, is a recovering substance abuser under pressure from their chain of command to find a excuse to get rid of him. She is also the daughter of a retired policeman who may have been responsible for Charlie's frame-up.The cases in each episodes would be fairly ordinary but for Charlie's Zen angle, which allows him both insight and compassion. In one heartwrenching confrontation, Charlie is forced to shoot an armed and dangerous suspect, then comforts the dying man by convincing him he is only having a bad dream.Charlie's secret crusade to unravel the conspiracy that put him in jail gives him ruthless enemies who seem uncannily aware of his every move.  Each episode teeters on the knife-edge tension that Charlie can be sent back to jail or even killed if he gets too close to the truth.  Charlie gets help from his former cellmate, a white collar criminal; his attorney, who dangerously mixes a professional and a personal relationship with Charlie; and his ex-wife, who has considerable guilt over divorcing Charlie in prison.\"Life: Season One\" is very highly recommended as a different kind of police procedural.  British actor Damian Lewis carries off Charlie Crews with a grounded, offbeat charm.  The early episodes are a little jarring, counterpointing Charlie's new life with the one he lost.  However, the series settles into a good rythmn, building to a hard-hitting season finale.", "overall": 5.0, "summary": "Something Completely Different...", "unixReviewTime": 1228694400, "reviewTime": "12 8, 2008"}, {"reviewerID": "AFFVUZEGP1FDQ", "asin": "B000VU4GW2", "reviewerName": "Morrigan Alexandros \"The Opinionated Me\"", "helpful": [0, 0], "reviewText": "I felt that the new show &#34;Life&#34; was interesting. The pilot episode offers some background on a cop that was wrongly convicted of a crime. He is released and after negotiating a multi million dollar settlement with the Police Deaprtment goes back to work as a detective in the Police Department. He has a very zen approach to life and is trying to solve the crime for which he was convicted. His partner is a young woman that is a recovering addict. She has little patience for him and is suspect of his methods.Still, I found that the show was not compelling. I think it went over the top and released too much information on the first episode when they should have held back a little. Everyone loves a good mystery!Dani Reese's (the woman agent) emotional responses were confusing. On one hand, she has little patience for her new partner ready to disclose everything he does wrong to her superiors and at the end of the episode, protecting him. She seems overly emotional in some scenes and then stoic in others. She is a recovering addict. I would have disclosed Dani Reese's addiction history maybe a bit later. The show just needs better writing.Damian Lewis played his character well, if he was going for the quirky Zen guy. But, the way he speaks (an attempt by the writers to make him interesting) is not that compelling. He has no censor and that's ok. But, the writer's attempt is so transparent as to make every line that comes out of Crews (the main character played by Lewis) unbelievable.Claudia Black is a good actress, why they would recast her is beyond me.", "overall": 2.0, "summary": "Meh", "unixReviewTime": 1191542400, "reviewTime": "10 5, 2007"}, {"reviewerID": "A3AT7TI6FXN6WM", "asin": "B000VU4GW2", "reviewerName": "Norman Davis", "helpful": [0, 0], "reviewText": "The network that had &#34;Life&#34; must have kept it more secret and covered up than the Benghazi fiasco, which is why, without yet watching season 2, that they cancelled it prematurely.  I &#34;found&#34; &#34;Life&#34; backtracking from &#34;Fairly Legal&#34;, another secret show, staring Sarah Shahi... and what a surprise to find Damian Lewis was the actual star which interested me because of his staring work on &#34;Homeland&#34;.  So, seriously, I backtracked into Life from more current shows.  I ran into Fairly Legal on &#34;Cloo&#34; channel.  They had a &#34;marathon&#34; of Fairly Legal and I wasn't really paying attention at first and became more and more involved until I just loved that show.  I searched for it only to discover... as always, a wonderful little show had been tossed out just when it was really hitting its stride.  I've given up on &#34;networks&#34; being bright enough to keep quality shows so these days I skulk in the back roads of the internet searching for entertainment jewels.... LIFE!Life is based on Damian Lewis's character Charlie Crews who was framed for murder as a cop and spent 12 years in prison.  He's later freed by discovered DNA evidence and FREEDOM + giant financial settlement + back to work as a detective as a settlement. You'd think, &#34;all about revenge&#34; but that, so far, appears to be a background, almost silent thread.  Sarah Shahi's talents, acting skills, and drop dead gorgeous looks are largely wasted but she adds some great dramatic tension as &#34;Crews&#34; new partner, Dani Reese.So far (Amazon is nagging me to review before I've completed the 1st season) Crews and Reese go about each show solving murders.  Crews pulls off an apparently complete Zen-new-age-self-help slightly demented from horrible prison experience, nice guy and Damian manages to pull off a stormy but silent darkness under the zen appearance. Reese (Shahi) has apparently been assigned as Crews's senior partner as some kind of unknown punishment and her sub plot appears to be to find a way to bounce Crews out of the police force but instead, very gradually through the season grows to believe he's sincerely a nice guy and a good cop.  There are plenty of plot curves for nearly all the characters that keeps the viewer 'coming back'.  I'm fortunate, I waited until it was cancelled so I'm already prepared for a fantastic 2nd season that flies off a cliff believing the &#34;next&#34; season that never happened would be even better still.Don't put a lot of stock in the idea that the show may not be worth watching because it is just another terrific show mangled by some money grubbers who didn't know they were about to hit the lottery.  Great characters, great actors being great characters, enough sub plots going on to always leave you curious for the next episode and nearly always an unexpected surprise.  Maybe Cloo will pick up a season of &#34;Life&#34; to marathon on some weekend like they did with &#34;Fairly Legal&#34; and folks will have a enough taste to find an alternate source, from networks, to enjoy &#34;Life&#34;.... a good TV series with at least two up and coming entertainment stars.", "overall": 4.0, "summary": "Backtracking into Life", "unixReviewTime": 1376006400, "reviewTime": "08 9, 2013"}, {"reviewerID": "A2F7CCPK4QL359", "asin": "B000VU6K0I", "reviewerName": "Bennet Pomerantz \"Bennet Pomerantz, AUDIOWORLD\"", "helpful": [22, 29], "reviewText": "The question is \"Did We Really Need to Rebuild Her?\" After watch all eight episodes of this Bionic Woman remake, I say NO!This last TV season NBC choose to remake the Bionic Woman for the 2000's. In trying to gain success like Sci-Fi Channel had the other 1970's remake  Battlestar Galactica, The producers took a gritter style...and It failed on many levels.As lovely as Michelle Ryan is, she is NO Lindsay Wagner. Ms Ryan tries to give this piece heart. The Character , a bartender , is given her bionics after an auto accident with her Government surgeon boyfriend.  She is saddled her with a felony kid sister (Lucy Hale) who was dumped on her when their father disappeared. Ryan is one of the reason's to watch this show.However, the heart of the show is buried deep within sub plots of the previous sort of Evilish bionic woman Sarah (Katee Sackhoff from the remake Of Gallatica) and ideas of double crossing people that seemed to be ripped off from old ALIAS plots. This new Woman is told is a soap opera form, which weaken this piece.The highlight of the show after Ryan  is Miguel Ferrer as the mysterious  Jonas. He plays a tough as nails agency boss, better than Richard Anderson ever played Oscar Goldman. His stone cold demeanor works well in this character, better than he did in Crossing Jordan (which season one is coming on DVD soon)The funnest thing about this new Bionic Woman. She  has $50,000 dollars worth of bionics parts, up from the 1970's amount of six million..inflation, inflation, inflation!I am sadden that only eight episodes (which are all presented here) were made of this series before the writer's strike of TV season 2007-2008. It had promise, but we may never know if it could have developed. NBC Network  has not stated if this show has been renewed for the next season. So these eight episodes may be the only  episodes of this seriesI can only wish that someone would release the classic Six Million Dollar man or the original Bionic woman on DVD...Now that was great television!Bennet Pomerantz AUDIOWORLD", "overall": 3.0, "summary": "Did We Really Need to Rebuild Her?", "unixReviewTime": 1208304000, "reviewTime": "04 16, 2008"}, {"reviewerID": "A1ZJJWF69R31ZL", "asin": "B000VVEDWO", "reviewerName": "Kate Fredericks \"Kate\"", "helpful": [12, 13], "reviewText": "Journeyman is, without a shadow of a doubt, one of the BEST television shows ever produced. The concept of Journeyman is brilliant, the marketing was abysmal, the ratings were satisfactory for a freshman show, the over-all quality of Journeyman is superb. But don't think Journeyman is just a show about time travel. It's so much more. Journeyman is a show about a heroes. Dan Vasser is the hero who goes back in time to help right wrongs. Livia is his hero partner who helps him. Katie Vasser is his hero wife who, through no fault of her own, finds herself married to a time-traveling man who, coincidently is time traveling with his ex-girlfriend. This show could have taken so many low roads with this issue. But never once did it slip into the little nasty things other shows use to pull people in - illicit sex, bad language, drug addiction. Journeyman was one of the few shows in many years that showed humanity at its best. We need MORE shows like this, not less. Why NBC canceled Journeyman is a mystery to many, many fans who continue to proliferate all over the internet, months after this show was canceled. I say to NBC: remember Star Trek? Now, FOX owns the rights to this show. We can hope that Fox does a better job and has more respect for this diamond of a show that got coal treatment. For the fans of Journeyman, WE were the ones who lost. But NBC? They deserve to be in fourth place amongst the networks. They are the real losers here. Thank YOU FOX and UNBOX for offering us the sale of the thirteen episodes of this fine show. Now...as for the DVD...?", "overall": 5.0, "summary": "One Of The Best Quality TV Shows Ever Produced", "unixReviewTime": 1209340800, "reviewTime": "04 28, 2008"}, {"reviewerID": "A16QODENBJVUI1", "asin": "B000VZUWZW", "reviewerName": "Robert Moore", "helpful": [2, 5], "reviewText": "This is obviously a minority opinion here, but I was not especially high on Season One of THE BIG BANG THEORY.  I first have to confess that sitcoms are my dead bottom least favorite genre of show.  I barely make room for HOW I MET YOUR MOTHER, but all in all it is a format that I find pretty dreadful, on the same level of reality and talent shows and crime procedurals.  I hate the limitations of the camera work, the lack of character development, and -- the worst invention in the history of television -- the laugh track.  Moreover, Season One of TBBT did not get the formula quite right.  Much of it was that they hadn't sufficiently found ways to soften Sheldon's character, who can at times be very funny but at other times -- especially in this season -- be excruciatingly irritating.Season Two saw a number of subtle alterations of the show, mainly softening Sheldon, but also increasing the dynamics between the various characters.  But Season One felt slightly off to me.  I can't help but contrast it somewhat with HOW I MET YOUR MOTHER.  The latter almost acknowledges the limitations of the format and constantly stretches it, including a pretty large number of exterior shots on the Warner Brothers lot.  The show also uses their laugh track much more lightly than TBBT.  Both shows suffer from too small of a cast (a common problem with sitcoms).  The  best comedies are not sitcoms, don't have laugh tracks, are not restricted to sound stages, and have large ensemble casts (cf. MODERN FAMILY, 30 ROCK, ARRESTED DEVELOPMENT, PARTY DOWN, early SCRUBS, and THE OFFICE).On the other hand, it is fun seeing a show with lots of nerd references.  Plus, I've actually known a couple of people who were geniuses along the line of Sheldon (though I should say that perhaps my greatest nerd moment was that when I worked in the University of Chicago Bookstore -- before it became a Barnes & Noble -- Chandrasekhar would always do a beeline to me to get help finding books [hey, having a world class genius -- another Nobel Prize winning physicist told me that in his opinion Chandrasekhar would rank as one of the two great twentieth century physicists after Einstein -- acknowledge your competence on books, even as a lowly book clerk, and nod to you as you walk across the campus may be a faint form of achievement, but if you don't understand this you don't understand the guys on TBBT]).  And as a comic book lover it is fun seeing a show with a lot of references to comics (though they seem to be limited entirely to superhero comics, while that makes up only part of my interest in comics).  But all of this was not quite enough to overcome the sitcom limitations, the laugh track, and irritating way that Sheldon was written in Season One.  The good news is that Season Two represented a huge improvement.  It still isn't among my favorite shows (no sitcom ever could be), but it is one that I will continue to DVR after having caught up on DVD.", "overall": 3.0, "summary": "Not nearly as good as Season Two would be", "unixReviewTime": 1264896000, "reviewTime": "01 31, 2010"}, {"reviewerID": "AQP1VPK16SVWM", "asin": "B000W4WD40", "reviewerName": "Wayne Klein \"If at first the idea is not absu...", "helpful": [37, 52], "reviewText": "PLEASE NOTE: Reviews are opinions. The purpose of the reviews are to HELP those who haven't seen the show decide whether or not they want to purchase/read/watch/listen to something. That's what the voting is for NOT if you agree or disagree with the reviewer. If you disagree-write a review. The comments section IS for those who want to disagree.The second season of \"Heroes\" stumbled with its story arc involving Hiro traveling back in time to feudal Japan. FYI, that subplot IS tied into the main plot of the second season. The focus here is on the Shanti Virus a concoction that can take away someone's powers but IS often lethal. There is also someone targeting those who were involved in the founding of \"The Company\". As with \"Lost\" the introduction of new characters was problematic--fans were more interested in finding out what happened to their favorites from season one. The show recovers somewhat by midset unfortunately the show was interrrupted by the Writer's Guild strike. I have no doubt that the second half of the second season would have made up for the stumbling start of season two based on what we find out in the extras but that didn't happen.The show looks extremely good in its DVD presentation. The extras are quite good as well which does make up for the diminished quality of the show. We get 11 commentary tracks. I haven't had time to listen to more than one or two of them but they are pretty good. If I'm not mistaken these are the audio versions of the video commentaries that were available on the \"Heroes\" website.A couple of the featurettes included here were also on the webiste. The most effective and interesting ones here are the preview of season three (which has some minor spoilers so you may want to wait to watch it if you want to be totally surprised)and a featurette that allows us to see how a series of scenes wer constructed.\"Heroes\" still has tremendous potential and here's hoping that the third season \"Villians\" is an improvement over the second season. This is a good set but isn't as strong or as good as the first season of \"Heroes\".Rent it.", "overall": 3.0, "summary": "The second season stumbles a bit but fans will find it rewarding", "unixReviewTime": 1219190400, "reviewTime": "08 20, 2008"}, {"reviewerID": "A16QODENBJVUI1", "asin": "B000W4Z5ZO", "reviewerName": "Robert Moore", "helpful": [0, 4], "reviewText": "Warning!  There are some spoilers in this review.In the spring of 2007 it was reported that NBC had asked the producers of THE OFFICE to expand it permanently to a one-hour format.  Initially I thought this was a terrible idea, that the show would be irreparably weakened by expanding it to an hour.  Then I saw the Season Three DVDs with the deleted scenes and with so many really great deleted scenes, I though that perhaps it would be possible to expand it to an hour.  Now, however, I'm not so sure.  Especially after this last of the four one-hour episodes that start off Season Four.  As a half hour show, THE OFFICE almost always leaves you wanting more.  But as a one-hour show, it always seems to go on too long.  Like most of the four episodes starting off this season, this one just felt like it was over before it was over.I'm not saying that it would never be a good idea to have an hour-long episode.  The show has had some very good expanded episodes in the past.  But four in a row seems to have stretched the show further than it really wanted to go.  I'm actually looking forward to it going back to shorter episodes next week.This episode revolves largely around two major stories.  First, Michael's increasing money woes created by having Jan live with him without working any herself.  To help make a bit more money he takes a second fulltime job as a telemarketer.  The scenes showing him at his second job are the weakest in the episode and really do feel like padding to make the show go a full hour.  The other major story centers around Pam and Jim deciding to visit Dwight's bed and breakfast.  After three years of teaming together to play tricks on Dwight -- and indeed this visit starts off as a trick on Dwight -- they realize how deeply he is hurting because of his break up with Angela (caused by his killing her elderly but deeply beloved cat by putting him in her freezer) and make a couple of gestures to try and make him feel better.  For instance, they give his utterly dreadful B&B; a stellar review on the Internet.  I like the symmetry of Pam and Jim not being together for a long period of time during much of which Dwight and Angela had a hidden relationship.  And now that Jim and Pam are together, Angela and Dwight have broken up.I have no doubt that the show will get back on track, but to do so, the network needs to permanently commit to the show being only a half hour each week.", "overall": 3.0, "summary": "One of the weakest episodes yet of one of my favorite shows", "unixReviewTime": 1192838400, "reviewTime": "10 20, 2007"}, {"reviewerID": "A2Q4WJ3NPIVA8E", "asin": "B000W4Z6XK", "reviewerName": "J. Kennedy", "helpful": [14, 14], "reviewText": "Season 1 of \"30 Rock\" was a landmark of television, if you ask me. Finally a sitcom that was original, refreshing, and, most of all, hilarious. When Season 2 began, my expectations were high. To say that my expectations were surpassed would be an understatement of grand proportions.Whereas the plotlines and randomly vanishing characters (any one of Rachel Dratch's appearances???) in Season 1 were out of left-field in that funny-but-almost-too-random kind of way, Season 2 was a different kind of animal.\"30 Rock\" season 2 came from left-field, but this time, it pulled you over there with it. In the beginning, it held onto some of the pitfalls of Season 1 (i.e., Where was Jenna half the time???), but as episodes aired, the ensemble and the writing both grew into something much greater and more entertaining than Season 1 ever reached.Even as many shows suffocated and failed the hiatus the writer's strike brought, \"30 Rock\" seemed immune. In fact, I would be so bold as to suggest the break fueled the creativity. Either those last handful of episodes were pure, unadulterated brilliance, or I was just desperate for more \"30 Rock\" after their lengthy sabbatical.Some brilliant moments in Season 2: Carrie Fisher as a crazy ex-writer, EVERYTHING involving the Devon (Will Arnett) vs. Jack rivalry (including the Don Geiss coma), Jack's job at Homeland Security (can you say, \"gay bomb\"?), & Kenneth's House Party AND a special appearance by Al Gore satiring himself (\"A whale is in trouble!\") in one episode? Oh HECK yeah.All in all, \"30 Rock\"'s sophomore season was a brilliant display that proved that comedy can be even better the second time around.", "overall": 5.0, "summary": "No \"Sophomore Slump\" here.", "unixReviewTime": 1217376000, "reviewTime": "07 30, 2008"}, {"reviewerID": "AUUH6Z8MSGGF", "asin": "B000WDS04I", "reviewerName": "Haunted Flower", "helpful": [1, 2], "reviewText": "\"How I Met Your Mother\" continues the search for the mother in Season 3, but doesn't try very hard. After Lily played by Alyson Hannigan and Marshall played by Jason Segal got married at the end of season 2, they start looking for their own apartment to live in and think about the future. Marshall tries to find just the right job and is finally exposed to the mountain of Lily's debt that he has been saddled with. Ted played by Josh Radnor and Robin played by Cobie Smulders are no longer dating and things are tense between them all season. Barney played by Neil Patrick Harris continues to be AWESOME, but starts to develop feelings for Robin.This season was the season of guest stars! Starting with Enrique Iglesias (\"Would you dance....if I asked you to dance...\") as a boyfriend Robin picks up while on vacation, James Van Der Beek as Robin's ex she never got over, Heidi Klum playing herself, Sarah Chalke of \"Scrubs\" playing Stella who is Ted's new major love interest of the season, and Britney Spears plays Abby who is a receptionist in love with Ted and manipulated by Barney. Ted is occasionally a horrible person in this season and his behavior often contradicts his lofty goals and morality of past seasons.Bonus Features:The \"Series Retrospective\" is a great sum-up of the first two seasons narrated by Bob Saget as older Ted. Lily & Marshall's Honeymoon videos are pretty cute and home video authentic which makes me wonder if they were originally supposed to incorporated into some episodes, but they made a great extra. The \"Cast Favorites\" Featurette is where each cast member tells what their favorite episode is and why.Behind the Scenes of \"We're Not From Here\" Featurette is just like the last two seasons where they kind of show the process of getting from the read-through, to rehearsal, to run-through, to rolling for the episode. For the additional scenes: How It Really Happened just shows the extended and deleted scenes from episodes.The \"You Just Got Slapped\" music video is just Marshall behind a piano being very serious and does not feature NPH. The \"Sandcastles in the Sand\" music video is just as awesome as \"Let's Go To The Mall\". The Gag Reel once again does not disappoint and includes a random makeout session between Marshall, Lily, and Barney and the actual words yelled during Lily and Marshall's fight that had been dubbed over in a previous episode and features more music from The Solids. The \"Ted Mosby is a Jerk\" Audio Track is playing during \"The Bracket\" episode because Barney once posed as Ted Mosby to sleep with a girl and confronts her and she made a website called TedMosbyisaJerk.com. It's a weird slow song playing with girls being mad at Ted while subtitles of the show dialogue appear in black.There is commentary on \"The Platinum Rule\", \"Ten Sessions\", \"The Bracket\", \"The Chain of Screaming\", \"Sandcastles in the Sand\", \"Everything Must Go\", and \"Miracles\" and they split up individual actors again and also have Sarah Chalke with Josh Radnor for \"Ten Sessions.\"", "overall": 4.0, "summary": "HF reviews How I Met Your Mother Season 3", "unixReviewTime": 1296345600, "reviewTime": "01 30, 2011"}, {"reviewerID": "ARMVAHWQQ9S8A", "asin": "B000WT7R6O", "reviewerName": "Pat Shand \"Pat Shand\"", "helpful": [2, 2], "reviewText": "I've seen a lot of people throw around the phrase \"a lot like Buffy andAngel\" or \"the best show sinceBuffyand Angel\" or things of that nature.  Thing is, most of those shows aren't.  None of them are like Angel, and the only one I've seen so far to match Buffy isVeronica Mars.  Well, get ready Angel fans, because the show has finally got something that's come close to a worth successor.  Now in its third season, Eric Kripke'sSupernaturalcontinues to show that it has mastered the balance of horror, humor, mythology, and drama that Angel was known for.  But enough with the comparisons.  \"Supernatural\" is a great show on its own, and this season is proof of that.The writer's strike left a lot of shows with less than stellar material, but not this show.  Each episode, even the less impressive ones, entertain to the fullest.  While the overall arc and even the episode-by-episode quality isn't as great as the fantastic second season, it remains a quality show packed with emotional highs, lows, and \"Holy ----, I can't believe they just did that!\" moments.  This season sets out to tie the previous seasons up nicely, giving deserving ends to many of the old arcs.  The Gordon storylin gets paid off, as does the \"Sam/Dean are wanted men\" arc.  The main story of the season, however, springs from the deal that Dean made in the finale ofthe second season.Dean, to bring Sam back from the death, made a deal that his soul will be taken to Hell in one year's time.  The bulk of the season, though it maintains a somewhat episodic feel, deals with that situation, throwing the two brothers into a fight against the one force they can't conquer again: Death.  Dean's impending death adds such a poignancy to the season, particularly the episodes stretching from the Christmas special to the finale, that even his possible resurrection in Season Four (it has to happen, people) wouldn't take away from the emotional resonance of this arc.Overall, it's a slight step down from the fantastic Season Two, but still a great season of a great show.  Definitely one of the best shows on TV.8/10", "overall": 4.0, "summary": "One of the Best Shows on TV", "unixReviewTime": 1222041600, "reviewTime": "09 22, 2008"}, {"reviewerID": "AQP1VPK16SVWM", "asin": "B000WT7R6O", "reviewerName": "Wayne Klein \"If at first the idea is not absu...", "helpful": [1, 1], "reviewText": "Those Winchester boys always flirt with danger. The third season of \"Supernatural\" added some unusual twists that made for an entertaining, exceptional third season for the show.The upside--a terrific looking Blu-ray transfer with plenty of detail, rich, dark blacks and a nice smooth look to the show. Digital imperfections are minimal and hardly noticable unless you're really looking for them. Sound is also extremely good with hice use of the surround channels. Audio is in Dolby Digital Surround 5.1 NOT in TrueHD.The extras are the same as on the regular DVD set although this is packaged in a Blu-ray multi-disc pack as oppposed to the cardboard packaging for the regular DVD and in standard definition for the ones I've watched so far.There's a booklet with info about each episode and also digital download as part of this package (although it's not from disc but, instead, like the original DVD from iTunes.The extras are the same as the conventional It would have been nice to have the option with BDLive for this to post your own commentary tracks (since this season doesn't have them--instead we get \"A Closer Look\" featurettes with the writers/producers/directors discussing the making of the episode, challenges they faced and inspiration for them)or to have a commentary track with PIP but that's a minor quibble.The only downside for season three was that we got fewer episodes because of the Writer's Strike but that didn't prevent creator Eric Kripke along with producers/writers Sera Gamble, Ben Edlund (creator of one of my fav cult shows \"The Tick\"), producer/director Kim Manners (\"The X-Files\")and producer/director Robert Singer (\"Lois and Clark\", \"Midnight Caller\" and \"Monk\" among other projects) from presenting one of the strongest seasons yet of the series.Dean (Jensen Ackles) has sold his soul to save his brother Sam (Jared Padalecki)from death. Sam devotes himself to try and find a way out for his brother from this binding deal and they find a new adversary--Lillith a major, nasy demon. They find Ruby (Katie Cassidy) a demon WHO is surprisingly on their side and instructs Sam (and a very reluctant Dean) in how to fight Lillith. The Winchester boys also must face off against Bela (Laruan Cohan)who often allies herself with them so she can extract her own pound of flesh--she's a dealer in supernatural curios and makes millions doing it. The third season also finds the boys facing the seven deadly sins incarnate, being pursued by their nemesis the hunter Gordon (Sterling K. Brown), being caught by the FBI (and facing an oncoming army of dark assassins working for Lilith), changlings that infiltrate a neighborhood, dealing with those goofy \"ghostchasers\" who shoot a pilot for their own TV series and also manage to stir a very nasty ghost in the process.The variation on \"Groundhog Day\" took an unusual twist midway through which improved the quality of that episode. It moves from comic to sobering and quite moving as Sam copes with Dean's fate and learns what caused them to repeat the same day over and over again.It's a terrific set and well worth picking up on Blu-ray although I will admit that even with the reduced price, it's still pretty steep for only 16 episodes. Still, it's 16 strong episodes (although there is a clinker or two most nicely mix horror, suspense and humor).Highly recommended. Those with little ones should be warned, however, that there is occasional bad langauge and some pretty scary situations.", "overall": 4.0, "summary": "Exceptional but shorter third season still worthwhile for fans on Blu-ray with a sharper transfer", "unixReviewTime": 1229817600, "reviewTime": "12 21, 2008"}, {"reviewerID": "A1D2C0WDCSHUWZ", "asin": "B000WUAZZI", "reviewerName": "E. A Solinas \"ea_solinas\"", "helpful": [20, 22], "reviewText": "Perfection, NV: A tiny western town of dust, sand... and giant carnivorous graboids burrowing underground.And after three movies of battling the graboids, shriekers and ass-blasters, fans of the \"Tremors\" series finally got a (tragically short-lived) TV spinoff. \"Tremors: The Complete Series\" takes everything fun about the movies tacks in some conspiracies and freaky mutants -- there are a few mildly grating characters, but it's still deliciously fun and strange.A new guy named Tyler Reed (Victor Browne) rolls into Perfection, intending to take over the Desert Jack Graboid Tours... just in time for El Blanco to go on a berserk feeding frenzy.It isn't the last graboid-related problem -- Burt Gummer (Michael Gross) and the other Perfectionites must deal with a gourmet assblaster, a scientist training shriekers to be rescue animals, a graboid attacking a town of UFO-fanatics, graboid-rights activists who claim the Perfectionites are killing El Blanco, and a pair of mob thugs who run afoul of El Blanco and lost a very important key.And pretty soon there are even worse problems. Burt finds that a strange substance called MixMaster, leaked out of a secret laboratory, begins to infect the valley and turns the creatures into bizarre hybrids -- giant shrimps, omnivorous termite/maggots, a mineshaft \"ghost,\" or an acid-spitting reptilian plant.\"Tremors: The Complete Series\" was cancelled after only thirteen episodes, but those episodes are brilliant from beginning to end. And they have everything you'd expect from a Tremors series -- lots of big guns, explosions, orange goop, and highly imaginative ways to kill various monsters (including with weather balloons and tar).For the record: the MixMaster, the secret lab and the eccentric old scientist all seem rather hokey, but soon they mesh nicely into the existing \"Tremors\" mythology. Think a funnier, lighter \"X-Files\" vibe. And the writers do an excellent job, weaving clever plots with plenty of action, a bit of tragedy (Cletus and Project 4-12), and lots of hilarious dry humor, especially regarding Burt (\"Somebody get up on the wrong side of the bunker today?\").Gross is, as always, brilliant as the endearing survivalist Burt -- he has to start a survival school, wrangle with a hard-headed government rep, and deal with a town of hostile UFO-fanatics. Browne is decent as the new \"everyman lead,\" and there are some solid supporting performances by Lela Lee, Marcia Strassman, Sarah Rafferty, and especially Christopher Lloyd as a wonderfully eccentric scientist-turned-desert-hermit.Two of the cast aren't quite as endearing -- J.D. Walsh's pushy ubernerd just ends up being annoying. And Gladys Jimenez's Rosalita is a fun character (an ex-showgirl with a shady history) but sometimes it feels like she's there to run around in filmy shirts.\"Tremors: The Complete Series\" has a couple bumps in the road, but overall it's a brilliant spinoff to the classic B-movie series. A must-see... or if you're a graboid, a must-eat.", "overall": 5.0, "summary": "You get used to it", "unixReviewTime": 1265155200, "reviewTime": "02 3, 2010"}, {"reviewerID": "ATECU14VUIOJ0", "asin": "B000ZU1KMW", "reviewerName": "Miss Barbara", "helpful": [0, 0], "reviewText": "This very intelligent and entertaining series is finally coming to an end.  I, for one, am caught up in the game: Who's the last Cylon?  I don't think that the series creators are going to go for the clich&eacute; \"it's the Admiral or the President\", but for the life of me, I don't know who that leaves.The entire series has been an adventure that parallels our current political atmosphere but translates it into a sci-fi journey.  This is what this genre does best - it holds up the fun house mirror for us to view ourselves in a distorted perspective.The mood of BSG tends to be quite \"Film Noir\".  When I looked up a definition in Wikipedia I found the following:\"Film noir is often described as essentially pessimistic. The noir stories that are regarded as most characteristic tell of people trapped in unwanted situations (which, in general, they did not cause but are responsible for exacerbating), striving against random, uncaring fate, and frequently doomed. The movies are seen as depicting a world that is inherently corrupt. Classic film noir has been associated by many critics with the American social landscape of the era.\"I thought this was a pretty good account of all seasons of BSG.  Another film noir factor to take into account is the general moral ambiguity.  It seems that the Cylons are the ones who are now taking the moral high ground and seem to be more open to weighing the pros and cons of each ethical decision.  They are becoming the principled ones and the humans have adapted an ethos of \"if it's different, it's bad!\" and not to be trusted.  Lifelong friendships are dismissed in an instant if this person (entity) turns out to be a \"toaster\".This may be a foolish question but I wonder if the Earth they found is real? I'm going to miss this show.  The acting, writing, directing, music and all other aspects are a tribute to each and every person connected with this fine series...bg", "overall": 4.0, "summary": "The End is Near", "unixReviewTime": 1234915200, "reviewTime": "02 18, 2009"}, {"reviewerID": "A3NZBGWIPLXVO7", "asin": "B000ZU1KMW", "reviewerName": "Mob Hunter \"duveen\"", "helpful": [2, 3], "reviewText": "The reboot of Battlestar Galactica was ultimately a failure.  It is most unfortunate because the elements of greatness were there.  The overarching story was a good one and I was interesting in individual plot lines throughout.  The chief problem was characterization.More and more often as the series progressed, characters were written to do things both against their previous nature and against all common sense.  Both of the Adamas became simply laughable with over-acting the norm and erratic -- unbalanced? -- behavior expected.  I wouldn't trust Bill Adama to rearrange my silverware drawer, much less command a ship.  His always-to-excess drinking alone would have disqualified him from command, a trait shared by way too many of his crew.Mary McDonnell was the series best actor and I wanted to like Laura Roslin.  While a better leader than Bill Adama, she was also ultimately unworthy of my trust.  So, too, was I pulling for Kara Thrace and I really came to enjoy her portrayal by Katee Sackhoff.  Ultimately, I have no freaking idea who and what she was and could muster litter care.  And that was the problem in a nutshell with the series.I just ultimately didn't care whether or not they found earth or survived or lost to the Cylons.  The characters on balance were not very likable and were certainly unworthy of my admiration.  I said in another review of the series -- season 3? -- that the humans were so lacking in worthy quality that it might be better for humanity to be wiped away.  Ultimately, I think that the only character I really would have trusted was Athena and overall, I liked the Cylons more than the humans.  I realize that Ron Moore was trying to create a story where the lines were blurred as to which side should have been seen as the heroes and that is admirable.  It sadly just wasn't executed well.  When you simply stop caring about the characters and a need to finish what you started rather than a burning desire to know what happens in the story drives you forward episode-to-episode, you know a story has gone off the rails.I bet -- I even hope -- that the concept of Battlestar Galactic will be picked up again in a couple of decades.  There is a good story to be told.  It just wasn't this one.", "overall": 2.0, "summary": "A Good Idea Gone Bad", "unixReviewTime": 1372550400, "reviewTime": "06 30, 2013"}, {"reviewerID": "A3KEZLJ59C1JVH", "asin": "B0012H0DBG", "reviewerName": "Melissa Niksic", "helpful": [110, 128], "reviewText": "It took me a few episodes to warm up to \"Californication.\" At first I wasn't quite sure what the show was trying to be...maybe \"Sex and the City\" for men? But it's actually much more than that. The show revolves around Hank Moody (David Duchovny), an author who's been in a bit of a writer's slump ever since his last novel was published seven years ago. Hank longs to return to his hometown of New York City, but remains in California because his former lover, Karen (Natascha McElhone), lives there, along with their teenage daughter, Becca (Madeleine Martin). Hank is still very much in love with Karen, and it's pretty obvious that she still loves him, too. Unfortunately, Karen's engaged to stuffy Bill (Damian Young), and Hank unwittingly has sex with Bill's 16-year-old daughter, Mia (Madeline Zima), who eventually ends up blackmailing Hank and trying to take credit for his latest manuscript. What a mess!\"Californication\" also boasts a strong supporting cast. Evan Handler plays Hank's best friend and agent, Charlie. Poor Charlie and his wife, Marcy (Pamela Adlon), experience some problems in the bedroom that lead to both of them cheating on each other with Charlie's hot young assistant, Danni (Rachel Miner). Handler and Adlon are amazingly funny on screen, and they play off each other very well: They're the funniest television couple since Lucy and Ricky Ricardo!By far, the best thing about this show is its sense of humor. There are some incredibly funny scenes in \"Californication\" that definitely are among the most hilarious moments in TV history, and that's saying a lot. From Hank throwing up on Bill's priceless painting to the office dominatrix scenes to the three-way/orgy culmination, there are plenty of great scenes to go around. I don't remember the last time a TV show made me laugh so hard.The first four or five episodes of the show were a little bumpy, but then \"Californication\" evolved into a great program about love, relationships, and self-discovery. The entire cast is brilliant, and most of the episodes are incredibly touching. I especially loved the last scene of the final episode, which came as a complete surprise and resulted in a very happy ending, at least for now.Overall, \"Californication\" is a surprising success. I can't wait for the second season.", "overall": 5.0, "summary": "One of the funniest shows on television", "unixReviewTime": 1207699200, "reviewTime": "04 9, 2008"}, {"reviewerID": "A3LTZGHZBBBQX0", "asin": "B0012QRPU4", "reviewerName": "Anthony L.", "helpful": [2, 3], "reviewText": "There is not even a shadow of doubt in my mind that BREAKING BAD is the greatest TV show ever made.Vince Gilligan, Bryan Cranston and Co. created a show so freakishly addictive, mesmerizing, and terrifyingly good it was like a drug you had - HAD - to get more of. From the jaw dropping opening Pilot (\"I only had you in my heart.\") to the heartbreaking Felina, the quality of the five seasons never once dropped from Perfect.I could go on. I could talk aboutBryan Cranston's legendary, immortal performance as high school-teacher-turned-meth-chef Walter White. I could talk at length about the jaw-dropping work from Aaron Paul, Anna Gunn, Dean Norris, Giancarlo Esposito, and Bob Odenkirk in their moving, finely crafted roles. I could talk about the perfect use of music and lighting, the camera work and stunning cinematography. I could talk about the writing, sharp and realistic and beautiful. All these and more are the elements (this IS a show about chemistry...) that took Breaking Bad from what it could have been: an entertaining black comedy/drama, into what it is: \"a labyrinth of blood, destruction and hell\" of Shakespearean proportions (words of B.B. superfan Anthony Hopkins).But I won't talk about that. I'll just say one thing: watch Breaking Bad. Watch all 57 perfect episodes of it, and when you're done, come back here and drop a comment telling me what you thought. And if I was right...tell someone else. BReaking BAd gets five stars from me.", "overall": 4.0, "summary": "A promising beginning to a stunning show.", "unixReviewTime": 1393200000, "reviewTime": "02 24, 2014"}, {"reviewerID": "A3EUSH8DPW75LR", "asin": "B0012QRPU4", "reviewerName": "barry", "helpful": [2, 4], "reviewText": "Here we have the first season of BREAKING BAD.  It is amazing to realize that it is only 7 episodes for the character, plot and drama development is so thorough and realistic another show would need at least double the episodes to achieve it.  The basic plot is a teacher who finds out he is dying of cancer and thru unexpected situations gets the opportunity to make a great deal of money thru manufacturing meth.  He does so to make money for his family to be able to live on after he dies.  But the show is about so much more than this.  Every character is addicted to something and the introduction into the dark world of drugs is terrifyingly realistic.  This is honestly one of the best shows ever to air on television.  It tells a story that may be too dark for some to handle but the superb acting, writing and directing make it all work.  These characters are all believable, necessary and the intertwining of their lives is seamless.The show also succesfully combines deep psychological profiles of each character mixed with the heavy, often disturbing drama.  And the plot always serves a purpose, is realistic no matter how heavy, and is in no way gratuituous.  And with this show we also get one of the best duos ever in Walt and Jesse.  When Jesse, Aaron Paul, a former student of Walt, Bryan Cranston, joins him in the making of meth a perfect chemistry is formed.  BREAKING BAD also provides the occasional comic break that helps alleviate the heavy drama.  This series is a must for its great acting, superb writing and directing and totally unique premise.  If it sounds like any other series you have seen believe me when I say it is not.  The blu ray of course adds a dimension to the series over that of the dvd.  There are many dark scenes but the detail and clarity still shines thru and the scenes with color and specifically the lovely scenery shots pop off the screen.  Audio is superb.  This is  a series that is dialogue driven but when the action sequences happen nothing is held back.  This series is superb and I highly recommend it.", "overall": 5.0, "summary": "The first season of an amazing series", "unixReviewTime": 1312675200, "reviewTime": "08 7, 2011"}, {"reviewerID": "A3N6GAJTEOF4MO", "asin": "B0012QRPU4", "reviewerName": "Caleb Williams", "helpful": [276, 311], "reviewText": "I think many, when looking at the main star of this show (Bryan Cranston) will have only really been familiar with him from Malcolm In The Middle. He played Hal, a simple Dad with simple values and an unbeatable love for his family. Who would have thought that he can take a character with the same basic love of his family and create something incredibly unique from that. In Breaking Bad, Bryan Cranston plays Chemistry professor Walter White who's married with a handicap son who suffers from Cerebral Palsy and a child on the way.One day Walter is hit with the ultimate bombshell as he finds he has inoperable lung cancer and has little time left to live. Walter realises that he can't assure his families financial security for the little time he has left being a teacher. He hears about a raid on a crystal meth lab that seizes millions of dollars worth of drugs which he decides that he must be a part of that. He knows how to make the best crystal meth ever seen, but not how to get it on the streets which is why he must enlist the help of his former student and drug pusher Jesse Pinkman (Aaron Paul).I honestly didn't have high hopes for this show as, although I'm a huge fan of Bryan Cranston for his work on Malcolm In The Middle, I struggled to believe he could pull off such a train wreck of a character. The family is a typical middle class American family struggling to take care of their disabled son trying to make him have as normal a life as possible. In a way I can relate to the situation as I'm disabled myself and know how much of a strain it can be on parents. Sure, it's not the same disability, but the family struggling through it is definitely displayed well and R.J. Mitte as Walter Jr. is an excellent fit. Although I'm betting he was only cast because he too has Cerebral Palsy, he still fits the bill and plays the character brilliantly.Fantastic, fantastic show. I don't want to tell you much about the seasons events as it is quite short and risks spoiling certain events. I have to tell you that there are times in which this show doesn't hold back. It has no qualms about showing you the brutality of a broken man fighting against his own sense of morality, joining the drug world and even dealing with the fact that he killed a guy. Oh and obviously he's dying and is reminded of that from time to time but it's certainly gelled together brilliantly.Just to wrap it up I can only really say this TV show is amazing in every way and I would highly recommend it to anyone and everyone. Bryan Cranston is a very underrated actor, but he's determined to prove himself for which he does a terrific job. When this DVD set comes out in the UK I'll certainly be one of the first to buy it.", "overall": 5.0, "summary": "Spectacular", "unixReviewTime": 1224201600, "reviewTime": "10 17, 2008"}, {"reviewerID": "A39IY0JU5JI69G", "asin": "B0012QRPU4", "reviewerName": "Promise \"promise\"", "helpful": [1, 1], "reviewText": "I love this show and won't bother to echo the many good reviews.  I'm just adding my hit on the symbolism of the names.  \"Walter\" is reminiscent of \"Walter Mitty\" the repressed, nerdy guy who dreamed of bigger things. \"White\"---well he is the prototype good guy, lilly white and always doing the right thing. (This is great fodder for Jungian analysts.) \"Schwartz\" as they explain, his ex-colleague in grad school, means \"black\" and he has stolen Walt's ideas and made a fortune from them.  They had together formed \"Gray Matter\" which included both of them but apparently Schwartz got greedy and cheated out Mr. White.  Then there is the interesting Jesse Pinkman---who is neither all white in his behavior nor all bad. (I came to love Jesse.)  He spills his share of blood but shows a good heart.  Then...the sexy, hot and beautiful assistant principal, Carmen, (red, if you don't already know) who seems to have the hots for the suffering White.  I'm only in the beginning of the second series so I hope to see more of Senorita Carmen.So far, so good....looking forward to more..in spite of too much violence for my taste.My only complaint is that some of those home homes don't look like any I've seen in Albuquerque and I've lived there.  All those leafy trees and green lawns....looks more like Southern California or Michigan than anything I've seen in New Mexico.", "overall": 5.0, "summary": "Watch for the names, especially the  colors", "unixReviewTime": 1376179200, "reviewTime": "08 11, 2013"}, {"reviewerID": "AQP1VPK16SVWM", "asin": "B0012QRPU4", "reviewerName": "Wayne Klein \"If at first the idea is not absu...", "helpful": [0, 0], "reviewText": "The first season of \"Breaking Bad\" establishes the tone for Vince Gilligan's series; Gilligan was fascinated with the idea of someone who went from an ordinary guy to the epitome of evil; Walt (Emmy winner Bryan Cranston)after being pushed out of a company that he helped co-found has adjusted to life as a High School chemistry teacher married to Skylar(Anna Gunn) expecting their second child when Walt finds out he has inoperable idiotpathic non-small cell. lung cancer. Determined to leave a nest egg and to pay for his cancer treatments without breaking his family for his family after discovering how much money amateurs make creating crystal meth, Walt decides to do the same thing with the assistance of a former student and drug dealer named Jessie (Emmy winner Aaron Paul). As Walt fights cancer and produces drugs he changes profoundly. He discovers the darkness that always lurked in his soul and allows it to consume him.Walt also must contend with his DEA brother-in-law (Dean Norris who is marvelous and often overlooked by the Emmy committee)and the fear he will find out about his extracurricular activities and try and prevent what he is doing from both Skylar and his physically handicapped son Walt Jr. (R. J. Mitte)The Blu-ray for the first season looks quite nice although the show occasionally looks a bit soft. It's not a pristine prsentation but the show looks quite nice with improved detail (the video noise is occasionally a bit distracting and in the form of increased 'grain'). Before the Blu-ray I had rented the DVD set back in 2009 and it has many of the same strengths and weaknesses as this set just not quite as noticeable because of the lower resolution of DVD. Most folks probably won't notice the minor flaws in the transfer and, on the whole, the presentation is quite pleasing. Colors pop while depth and detail are noticably improved.The first season was shorter than all the other seasons with only seven episodes and they are spread over two 50 gig discs.The lossless 5.1 audio sounds marvelous and is top notch. English SDH and Spanish subtitles are available.The special features although limited compared to other sets. We get two audio commentary tracks on both the pilot featuring Cranston, Gilligan and a number of other cast members and also on \"Crazy Handful of Nothing\" on the second disc.We also get deleted scenes for three episodes as well as auditon footage for Gunn, Paul and actress Betsy Brandt (who plays Skylar sister Marie).We also get a featurette \"The Making of 'Breaking Bad'\" as well as an excerpt of the show \"Shoot Out\" about the improved quality of cable TV shows. \"Inside 'Breeaking Bad'\" is a series of short featurettes. \"Vince Gilligan's Photo Gallery\" can be viewed as a slide show.The first season of \"Breaking Bad\" establishes the tone of this brilliant show--one of the finest written shows on TV--and although the first season was unnecessarily short (due to the Writer's Strike at the time as I recall), the quality of the show is high.Highly recommended.", "overall": 5.0, "summary": "First season of \"Breaking Bad\" looks fine on Blu-ray transfer of great show", "unixReviewTime": 1345161600, "reviewTime": "08 17, 2012"}, {"reviewerID": "A3TYC8T6W81DDB", "asin": "B00150OTCE", "reviewerName": "C. Sawin", "helpful": [5, 6], "reviewText": "The Orphanage(El Orfanato) tells the story of Laura, her husband, Carlos, and their adopted son, Sim&oacute;n. Laura was adopted herself and spent time at an orphanage when she was younger. She returns to the same orphanage as an adult with her family to do the same thing for handicapped children now that it do for her so many years ago; take care of them until they can find families of their own. Sim&oacute;n isn't much different from other kids his age and has a couple imaginary friends, but it's when he meets a new one one day at the beach in a cave that things start to get strange. There's something more going on. It seems as if the children may have never left after all...The Orphanage is able to accomplish being the creepy masterpiece that every horror film in the past ten years has tried to be. That's not to say there haven't been good horror films in the past ten years, but there are only a handful and this one has to be close to the top. What sets this apart from other horror films is that it doesn't rely on cheap scares or CGI to try and scare the viewers. It's all about the atmosphere and it works so well. In general, I'm not a fan of horror films that are about ghosts. This seems to be on a whole different level though. It's also one of the more original horror films I've seen in quite awhile, which is quite a relief. I'm not sure about you, but I'm kind of sick of sitting through a movie and realizing it reminds me of this movie or this movie or it \"pays homage\" to three movies in one film. I'm not saying that influences are a bad thing, but originality is so hard to come by these days and I embrace it with open arms. It also seems like whatever movie Guillermo Del Toro is involved with can do no wrong, in my eyes. I know he only produced this film, but still. I've yet to see any movie with his name in the credits that I didn't love.I don't think this film is for everybody though. If you're looking for the next Ring or Grudge or if you're wanting blood spewing from amputated limbs, then you'll probably want to look elsewhere. But if you're looking for an intelligent thriller that is heartbreaking yet beautiful, then I think this is a movie you should look into.Rating: 8/10", "overall": 4.0, "summary": "A Creepy, Original Masterpiece", "unixReviewTime": 1206835200, "reviewTime": "03 30, 2008"}, {"reviewerID": "AEQFYOI6YJ83Z", "asin": "B00150OTCE", "reviewerName": "DanD", "helpful": [0, 0], "reviewText": "THE ORPHANAGE is scary.  Not Hollywood-hey-let's-show-all-our-cards scary.  I'm talking about cover your eyes, look away, symbolic terror.  A woman wiping her face with what we know to be human ashes.  Creepy figures half-seen and then gone.  This is a film that gets under your skin.The plot is fairly simple: Laura moves into the orphanage where she grew up.  With her is her adopted son Simon and her husband Carlos.  Before moving into the Orphanage, Simon had two imaginary friends; after a day in the new place, he has six.  And then a strange old lady shows up...and then Simon goes missing.  Months pass, and eventually Laura feels compelled--against her husband's wishes--to seek help from beyond.The film plays with typical horror stereotypes: creepy old buildings; creepy little children; creepy old people.  What makes everything work here is director J.A. Bayona's understated style; he doesn't spell things out for us, he lets the tension--and character development--build, until we reach a gut-wrenching climax.  You can see it coming, of course; the problem with horror films these days is that there's not a lot that hasn't been done.  Thus, we must focus on HOW it is done; and in this regard, THE ORPHANAGE excels.The lead performances from Belen Rueda and Fernando Cayo are rock-solid; supporting roles--especially an incredibly spine-chilling turn from Geraldine Chaplin--are just as good.  In case you're wondering: Guillermo Del Toro's presence is felt, but only in an off-hand way.  Some scenes are so horrifically beautiful, one can't help but be completely awed.  This is, ultimately, a beautiful little film; not the greatest horror movie ever made, but certainly a rare treasure, and proof that there is still gold to be mined in the genre, even if it takes a fresh face like Bayona to find it.", "overall": 5.0, "summary": "One of the creepiest films I have seen in a long time.", "unixReviewTime": 1267228800, "reviewTime": "02 27, 2010"}, {"reviewerID": "A3J1L5HC0RMCDX", "asin": "B00171LH1W", "reviewerName": "Anonymous45 \"michael cifelli\"", "helpful": [0, 0], "reviewText": "i love this season.  if your a fan, like i always say, and even if you dont watch this show, this is a great season to pick any episode you want and you will find that is represents the show.  it has humor, ramsay going nuts, some sex appeal, an ending that is a surprise, and the chefs are tested in many extreme ways.  and there are several chefs that are so nuts, you have to wonder how they make it through as far as they did.  you get a good laugh at the chefs in this season. and so many funny lines.  and of course a lot of really nice prizes along the way.  its just a unique season in my opinion.  you get more in this season than in many of the others and the others are fantastic.  please trust me, especially if your a fan.  just pick an episode.  start with episode one of this season and you will be laughing really hard. even though its a serious show and the finale is huge.  this season is so good you cant go wrong just picking any episode to see if you like it.....there is bad language, and a lot of yelling and screaming.  its in your face tv.  but i love the show.  give it a try and i believe the majority of you will love it......this episode is especially great....and you learn a lot as well....the cool thing about ramsay is he makes everything from scratch, everything is fresh, and no left overs. ever.  that is what makes his food so special.....i really hope you ejoy it.....", "overall": 5.0, "summary": "one of my very favorite seasons", "unixReviewTime": 1308614400, "reviewTime": "06 21, 2011"}, {"reviewerID": "A2I6MHMAZZDCRX", "asin": "B001ALX4I8", "reviewerName": "Mark Baker", "helpful": [13, 16], "reviewText": "Mary Shannon (Mary McCormack) is a Federal Marshal with the Witness Protection Program.  Working along side her partner Marshall Mann (Fred Weller), she helps witnesses adjust to their new life in Albuquerque, New Mexico.  Since most of these people are criminals who agreed to testify against other criminals, that isn't always easy.  For example, there's the con artist who may or may not have set her sights on a new mark, yet gets her picture in the paper.  There's the man who brings his wife and mistress into the program only to decide it was time to break up with his mistress.  And even when the witnesses are innocent, their lack of desire to leave their old life behind them can lead to problems, too.If all that weren't enough, Mary's personal life is far from calm.  She is supporting her dead beat mother (Lesley Ann Warren) and her sister Brandi (Nichole Hiltz).  Not only has Brandi fallen for Mary's sometimes boyfriend Raphael (Cristian de la Fuente), but she is also hiding methamphetamine until her boyfriend can arrange the sale.  What will happen when that little bombshell comes out?Personally, I'm still not quite sure what to make of this show.  At times, I am quite interested in seeing how things turn out.  Then I get fed up with the soap opera nature of Mary's personal life.  More often then not, Mary comes across as smug and condescending instead of human and funny, which I have a feeling is what they are aiming for.  And the way she lets herself get manipulated by her family drives me crazy.  And yet I keep watching because I need to know what will happen next.  And I will tune in when the second season starts.I certainly can't fault the acting in any of this.  The actors all do an impeccable job of bringing their characters to life, flaws and all.  I think it may be those portrayals that keep me coming back.So yes, I will keep watching the show.  If you are interested, I'd suggest catching some reruns before you plunk down the money for this set.", "overall": 3.0, "summary": "Not Up to USA's Normal Standards.  Yet I Keep Watching", "unixReviewTime": 1238544000, "reviewTime": "04 1, 2009"}, {"reviewerID": "A25ZZMC5VB6MC8", "asin": "B001ATJQB4", "reviewerName": "Jacob \"RavenLoc\"", "helpful": [0, 0], "reviewText": "The Venture Bros. are back and season three picks up where we left off from season two.  The monarch now with his wife Doctor Mrs. The Monarch must endure tests from the guild to ensure that they can be villans as well as man and wife.  Meanwhile Doctor Venture is enjoying his Monarch free life and gets back to work in the world of super sicence.  Only to have a new arch enemy Sgt. Hatred razed his front lawn and needing him to fill out a questionaire form about his villany.All this plus the O.S.I out to kill Brock Sampson.  Spiderskull Island new museum deicated to Doctor Jonas Venture.  A message from the past that will save the Earth.  What is the secert of the O.R.B and why it is linked to Rusty's past and the future of all mankind.  What happens when The Venture Compond is turned into a day camp for fans of the Rusty Venture show? We also meet Dermott who thinks he may have met his father at the Venture place.  The Triad gets to select thier arch enemy.  More thrills and chills then anyone can think of as well as a battle to end all battles and a death no one saw coming.So check out season three of the Venture Bros today!", "overall": 5.0, "summary": "Venture Bros. Season Three hits new heights!", "unixReviewTime": 1370908800, "reviewTime": "06 11, 2013"}, {"reviewerID": "A1FEITLECMZ6EW", "asin": "B001CB8NQE", "reviewerName": "Jeffrey Thomas", "helpful": [0, 0], "reviewText": "Spoilers included:This episode is unique, in my opinion. I'll state this now, in case I'm mixing up episodes. I have seen this but I'm reviewing after not having seen it in a while. So, don't be to hard.The whole idea of Teyla having an alteration to be a Wraith for the time being is really interesting. Especially how Todd manipulates events to his wants. I do enjoy Teyla's use of her authoritative position at the end where she warns Todd about her coming back in the event that he does something that she would not want him to. She can be very intimidating when she wants to be.I won't say much more, but I'll give good points on the creativity of the episode and the acting. Teyla, the actor playing her more specifically, did an excellent job. I can't imagine dealing with having to put all that make-up on.However, I'm going to stop there, as I'm not really one to delve into the actors themselves, other than to rate them as something along the lines of good or bad.Anyway, the episode was very good. It put Todd in a position of power whilst taking down the Queen. However, even though the Wraith to Human potion, as I'll call it, didn't get to go into place, I think it flows with the episodes. With it, it would cut the series short, and that would put a downer on our want for more.So, the Wraith war continues. Good episode. I hope people continue to enjoy the series.Just to note in ending, I'll apologize now if any of this information is out of place. As I pointed out in the beginning, I haven't watched this episode in a while. I wanted to write a review and give stars to this episode so that people would know it was good, instead of just seeing one star.Ok, hope you like the series.", "overall": 5.0, "summary": "Very Interesting", "unixReviewTime": 1345680000, "reviewTime": "08 23, 2012"}, {"reviewerID": "ARNAOSKQZMM2J", "asin": "B001CNRBEC", "reviewerName": "Amanda", "helpful": [17, 19], "reviewText": "Oklahoma City detective Grace Hanadarko is never much of one for the straight-and-narrow. She is frequently forced to balance her personal issues with smoking, drinking, and sex with difficulties between her family and friends, her high-stress job in law enforcement -- and not to mention her interactions with an angel named \"Earl\" who has been sent by God to convince Grace to turn away from her evil ways to God. Grace may be on the road to hell, but, with Earl's spiritual guidance, she may be able to save herself.Saving Grace: Season 2 follows the continued adventures of Grace as she deals with her turbulent relationship with fellow detective Ham, her friends' Doug and Maggie's impending wedding, the ever-present fear of death for Grace's friend Leon, the day-to-day drama of working with homicides, the constantly lurking memory of the 1993 Oklahoma City bombing and of course, Grace's journey through faith. While just as intense as the first season, Season Two builds on the spiritual questions and character-centric stories that the series is known for.The cast of Saving Grace is phenomenal, led by Holly Hunter's believable, relate-able performance as Grace. Other key performances include Leon Rippy (Earl) and Bokeem Woodbine (Leon), who have amazing intensity and chemistry on screen that make their semi-intellectual conversations about death, life and faith resonate with viewers and force them to reflect on their own lives. Kenny Johnson (\"Ham\") has perfect chemistry with Hunter and delivers a heartfelt performance as a passionate detective who must balance his odd, off-again, on-again physical relationship with Grace while still maintaining a certain level of professionalism.While the plots of Saving Grace seem a little soap opera-like and can occasionally become diluted and slow-paced, each episode is packed with some of the most amazing character development and complex character relationships on television. While the plot can occasionally became inaccessible for me, the characters kept pulling me in and forcing me to keep watching on the edge of my seat just to see what would happen next in the crazy, dramatic world of these characters. The series ends with a bang that will leave viewers moved and emotionally drained.This DVD set includes all 14 episodes from Season 2, in widescreen format. The set also includes two featurettes that document the many successes of Saving Grace -- both on television and in the person lives of the actors -- and a Hollywood-style wrap party where the cast reflects on the series' second season. While these features give an interesting look into the heart behind the drama, it just seems like there could have been more to it -- maybe some episode commentary, more behind-the-scenes footage or even a few deleted or extended scenes that just didn't make the final cut.I also personally enjoyed the fact that this series is set in Oklahoma City rather than in New York, Washington D.C., Los Angeles, or one of the typical locations for cop dramas. Having this unique setting helped to bring something new to a seemingly worn out (and overdone) genre.Saving Grace: Season 2 is a great series for fans of character-driven dramas and cop-associated shows that have a little more depth to them than just figuring out who-dunnit. Each episode delivers a thrilling emotional ride that will stick with viewers long after they turn off the television.", "overall": 4.0, "summary": "Saving Grace Season 2", "unixReviewTime": 1245196800, "reviewTime": "06 17, 2009"}, {"reviewerID": "ALH5ICRHO43PV", "asin": "B001ENOB8Y", "reviewerName": "D. Marshall \"GOD'S child\"", "helpful": [0, 1], "reviewText": "Aww, man!  It's over.  This show was a thrill ride from the very beginning, to the very end.  I loved looking forward to how Scofield was gonna outsmart The Company every monday.  But unfortunately all good things must come to an end.  Prison Break season 4 is...interesting, to say the least.  If you are someone that watched from the start, you may be a little disappointed with how the show came to an end.  To me the last season was very unbalanced.  The writing was all over the place.  Starting with the re-emergence of Sarah and Scofield's sudden illness.  Plus how T-Bag after three seasons, develops a heart.  I'm sayin', come on!  Although I have to give all the actors credit for making entertainment out of what those wacky writers scripted.  I thought The General's performance was exceptional as usual!!! As well as Gretchen.  She is definitely a force to be reckoned with.  If you are someone that enjoys quality acting and intense drama than this is for you.  Prison Break will always be remembered by me.  It was a GREAT show with a very imaginative story line!!!!!!!!", "overall": 4.0, "summary": "I'll Miss My Weekly Prison Break Fix!!!!!!!", "unixReviewTime": 1250121600, "reviewTime": "08 13, 2009"}, {"reviewerID": "A3NNLLKMLMO9LL", "asin": "B001ENS0BS", "reviewerName": "Georgia A. Morrison-Flores", "helpful": [0, 0], "reviewText": "WHAT DO YOU SAY TO NBC, WHEN THEY CUT A SHOW ABOUT AVERAGE PEOPLE, WHO ARE NOT RICH AND FAMOUS. BUT THAN AGAIN NBC CAN PAY THEIR EMPLOYEES, MILLIONS OF DOLLARS A YEAR, MORE THAN MINIMUM WAGES THAN THE REST OF US GET. BUT WHEN WE LIKE A PROGRAM LIKE \"MY NAME IS EARL\" AND MAYBE ONE OF NBC'S CEO WIFE, OR KIDS DON'T LIKE THE SHOW, IT GETS CUT OFF.WELL, I LIKED MY NAME IS EARL,IT MADE ME LAUGH. IT SHOWED HOW PEOPLE LIVE THEIR LIFE DAY TO DAY LIKE HOW MY NEIGHBORSLIVE.  WELL, I AM SAD TO SAY, I DO NOT WATCH TV ANY MORE NBC, BECAUSE WHEN YOU GOT A DIAMOND IN YOUR HANDS, YOU START LOOKING FOR A BIGGER DIAMOND. THERE IS A LITTLE DIAMOND ON MY FINGER AND IT MAKES ME HAPPY TO HAVE IT. NBC, PEOPLE NEED TO LAUGH, AND LAUGH SO HARD THAT THEY START TO CRY FROM LAUGHING.  DO YOU NOT KNOW THAT? WITH SO MUCH GOING ON IN THIS WORLD THAT GOD CREATED FOR US. THERE IS SO MUCH B.A.D. THINGS HAPPENING AND IT GETS VERY SAD. BUT, I AM THANKFUL TO AMAZON.COM FOR PRIME TIME, I CAN WATCH EARL AGAIN. GOOD BYE NBC AND GOD BLESS AMAZON.COM AND THANK YOU FOR BEING THERE FOR ME AND ALL THE OTHER AMAZON.COM CUSTOMERS.  I LOVE YOU AMAZON.SINCERELY YOURS, GEORGIA A. MORRISON-FLORES", "overall": 5.0, "summary": "WHAT CAN I SAY, I LIKE GOOD SHOWS AND I WILL NOT LIE", "unixReviewTime": 1372809600, "reviewTime": "07 3, 2013"}, {"reviewerID": "AFHKFOO046N00", "asin": "B001ENSOVO", "reviewerName": "Akela \"smiling wolf\"", "helpful": [6, 11], "reviewText": "Now, some shows go south - quality wise - but that's the fastest rolling downhill so far.Good clear thinking, scientific approach (O'K, as scientific as you can get without losing 99,5% of the audience), logic, dry and sometimes black humor, in short everything that made those series special in the seasons 1 and 2 - gone. I still hope may be not forever - perhaps the writing crew should be changed?Bones is getting quickly disengaged from her brain. Booth - an FBI Special Agent and a former Army sniper - is being turned into a giggling idiot. Bones father, who used to be one of the most insteresting characters, is downsized so much he takes less time than any of those moron interns. A horde of neurotic interns has already ruined Doctor House, so why repeat somebody's else mistake?The fascinating and brillian Stephen Fry has been replaced with that clown... what's the name of that baby shrink again?Who would have said that I would feel profoundly gratefull for the presence of Dr Saroyan? I actually like the first director that much that I was annoyed when they replaced him. But now she is the anchor to the first two seasons when it was a brilliant show as she seems to be the only person who still keeps her brains, humor and common sense.What happened to common logic? Bones's staple phrase used to be : \"There is flesh here, I don't work with flesh!\". Now they make her doing autopsies? Whats' next - working with lab rats? She started making idiotic and illogical statements which she never used to do before. Angela is turning into a cheap stupid easy access somebody - again the initial character was not like that. Booth is behaving like a clown half of the time. The combined IQ rate dropped to around 200 may be.... all of them put together.This is turning into a trashy switch-off-your-brain Grand Guignol show which has nothing to do with the initial concept. Two brillian seasons and now that?!", "overall": 3.0, "summary": "\"Whatever happened to class?\"", "unixReviewTime": 1267315200, "reviewTime": "02 28, 2010"}, {"reviewerID": "A19MMYMZO363KM", "asin": "B001ENSOVO", "reviewerName": "Lincoln County MT \"Focused on pinecones\"", "helpful": [0, 0], "reviewText": "Ok why do we have to wait so long not just for Bones but all the other DVD TV series on a yearly basis? We don't get paid for TV here and so depend on the series by DVD arrivals. Of course we then scarf them up so quick within less than a week usually...it's one heck of a long wait for next years episodes. Yes we occasionally sneak peaks via the free net viewers in 2 x 3 frames but that only wets the appetite and our impatience even more. So if anyone is listening that decides these dates.....why not put them out within a 2-3 week ending of the season? Meantime the show...BONES is by far our favorite. I didn't like it for the first original 3 episodes but the 4th began to thaw me and by the 5th I was hooked. Writing is tight and casting tighter. Love the comedy most of all. Sure they could improve this or that to make me like it even more...but hey life is a compromise.If you gave this a try when it first came out but wasn't taken in...go back and give it another look. I wasn't quite taken by last years plot of making Zack a serial killer. That definitely weird for weirds sake. Nothing like writing a character off without exactly killing him off traditionally. I never warmed to Zacks character...so I don't miss him or feel for his persona living behind those cold cold bars:) Hope it runs another 5 years......or more.....", "overall": 5.0, "summary": "WHY WHY WHY DO we have to Wait till October?", "unixReviewTime": 1248220800, "reviewTime": "07 22, 2009"}, {"reviewerID": "A3T6HX48F66512", "asin": "B001EUE6X2", "reviewerName": "Fry Boy", "helpful": [0, 0], "reviewText": "I was quite impressed with the first season of \"Heroes,\" but a lot of what happens in the series makes you shake your head . . . and the shaking increases with each season.Every time I've picked up the new season of \"Heroes,\" I've had to go back to the NBC recap site to find out what exactly happened at the end of the previous season.  This sort of thing never happens with other shows, but after nine or twelve months between season viewings of \"Heroes,\" I've got to go back for a refresher.  The way the show jumps around in time and space and with certain characters dying/coming back or gaining/losing powers, it's a little hard to keep track.  And thus began season 3.The amount of disbelief that must be withheld in order to enjoy season 3 is astounding.  One guy I won't identify pops through space and time stealing people's powers yet, for some reason, he also chooses to have an entourage of people with powers.  Why not just take everyone's powers a la Sylar?And speaking of Sylar, he continues to be one of the more interesting (albeit somewhat annoying) characters on the show as, this season, he seeks out his real parents and some sort of identity while continuing to expand his powers.Noah Bennett and Matt Parkman are, hands down, the best and most likeable characters on the show, with Hiro and Ando coming in second.  That Petrelli family--not to mention Ali Larter's character--will bug the pants off you.  There is, however, a new character named Danko introduced who is quite interesting.  He's a \"powerless\" human enlisted by Nathan Petrelli to hunt down people with abilities.There are some interesting and welcome developments with the Bennett family this season.I won't spoil it for you, but let me say that the season finale just might cause you to stop watching the show.  Massive head shake there.  Despite that, I'll go on to watch season 4, but some friends of mine have sworn off \"Heroes\" forever.Look for Clint Howard and William Katt in small roles.Worth a watch, but leave a lot of disbelief at the door.", "overall": 3.0, "summary": "I'm never quite sure whether to love \"Heroes\" or just wonder how it stays on TV", "unixReviewTime": 1268092800, "reviewTime": "03 9, 2010"}, {"reviewerID": "A2I6MHMAZZDCRX", "asin": "B001EUE6X2", "reviewerName": "Mark Baker", "helpful": [5, 7], "reviewText": "Season 3 of this once great show continues the decline.  And instead of one story arc, it contains two distinct stories.In \"Villains,\" there is a mass escape of villains from Level 5, a detention facility used by The Company to house evil people with superpowers.  Noah Bennett (Jack Coleman) gets to work trying to track them down.  He's surprised to see his new partner is Sylar (Zachary Quinto) who is trying to give up his murderous ways and get back on the straight and narrow.  Can they catch these bad men?  Will Sylar remain a hero?The second half of the season found our characters on the run.  \"Fugitives\" found now Senator Nathan Petrelli (Adrian Pasdar) heading a task force aimed at bringing all those with special powers in \"for their own protection.\"  Of course, he's failed to mention his own unique powers.  Leading the charge against him is his own brother Peter (Milo Ventimiglia).  Will Nathan see the error of his ways before everyone is captured or killed?The problem with this season lay in the story telling.  When the show was actually good (back in season 1), the episodes spent time with the characters, letting us get to know them so we cared about what they were doing or why.  That really drew me in.  Here, we are forced plot points with cardboard characters.  Heck, I had a hard time keeping track of who was doing what to whom it changed so often.  And I just don't care about the characters the way I used to because there is no depth to them.Then there's the case of Sylar.  Don't get me wrong, I think Zachary Quinto is a great actor.  But the way they keep including that character in events is forced and makes me wonder if we'll ever actually go somewhere with the story.Yes, I am still intrigued to see where they are going next to keep watching, but just barely.  They seriously need to make some tough decisions about how to best move the story forward and then stick to it, or they will continue to lose their audience.", "overall": 3.0, "summary": "\"I'll Keep Trying to Kill You.\"  \"Well, Everybody Needs a Hobby.\"", "unixReviewTime": 1251763200, "reviewTime": "09 1, 2009"}, {"reviewerID": "A16QODENBJVUI1", "asin": "B001EUKHRG", "reviewerName": "Robert Moore", "helpful": [29, 43], "reviewText": "Season Five of THE OFFICE was perhaps its least consistent since Season One.  There were times when it managed some of the brilliance it flashed so often in Seasons Two and Three, but a number of the episodes were either just ill-conceived or out and out unpleasant.  The episode where Michael falls apart during a presentation that Holly's new boyfriend attends (and in which Pam takes over) was one of the most painful half hours I've ever experienced while watching TV.  Overall the season just lacked the kind of magic that we saw in previous seasons.  There were no episodes as memorable as \"Business School\" (the episode where Michael lectures in Ryan's business school class, Jim makes Dwight believe that he might have become a vampire, and no one except Michael comes to Pam's art class presentation) or \"Beach Games\" or \"Casino Night.\"  In fact, if I had to list my ten favorite OFFICE episodes, I'm pretty confident that none from Season Five would be on the list.Not that there weren't some great moments.  Absolutely any scene featuring Steve Carrell and Amy Ryan was extraordinary.  Had she been a fulltime character on the show the fortunes of the whole season might have turned out differently.  They complemented someone so perfectly it was surreal.  Their early season rap was one of the best things in the season.  Another highlight was Andy and Angela's engagement and the way in which if fell apart, all while she was continuing her sexual relationship with Dwight.  But the problem is that there just weren't enough moments like these.It isn't that I didn't tune in each week with excitement, but the show simply didn't match its previous brilliance.  Can it rebound?  I certainly hope so.  I still love all the characters.  I love that they didn't break up Pam and Jim (and it looks like there is going to be a huge change coming for them in Season Six, if the news that they seemed to have received in the season finale turns out to be true).  I just want the great moments to return.  I want some episodes from Season Six to crack my Top Ten OFFICE Episodes list.", "overall": 4.0, "summary": "A good season -- but not up to the standard of the previous three years", "unixReviewTime": 1242259200, "reviewTime": "05 14, 2009"}, {"reviewerID": "AW3VZ5O895LRK", "asin": "B001EXRQQ8", "reviewerName": "carol irvin \"carol irvin\"", "helpful": [2, 19], "reviewText": "AT THE TIME OF WRITING THIS REVIEW, I DID NOT KNOW THE SERIES HAD BEEN CANCELLED!I've watched both seasons.  This show needs to do some radical pruning in order to to make it the excellent show which glimmers through the convoluted mess of a plot which tries to drag it under week after week. It is fine that Charlie returns to being a cop after being awarded tons of money for being wrongfully imprisoned for a murder he did not commit.  To have him continually trying to solve how this happened to him is the weakest part of the show and may well sink it.  Here is what will make it the show it deserves to be:  SOLVE THE MYSTERY OF WHO FRAMED CHARLIE, GET RID OF THOSE PEOPLE AND MOVE ON.  Charlie, played by always excellent UK actor Damian Lewis, is best when he devotes himself to the present day problems which confront him.  This doesn't mean that Charlie can't still suffer from his unjustly spent 12 years in prison.  He can still do that.  He just has to be finished with this massive conspiracy inside the police department which framed him for murder and sent him away.  There are plenty of present day aspects which can then be given more attention in the series.  Adam Arkin is excellent as his former cellmate Ted Early, who was a top notch white collar criminal.  Charlie has taken him into his home and life.  Every time Early is onscreen it is magic time. Presently he has fallen in love with Charlie's father's fiance.  This is the father Charlie wants nothing to do with because he believed Charlie had committed the murder.  Again, magic time. Dani Reese (Sara Shahi), as his partner is fine but she was wasted this season being taken away by the people who framed Charlie.  Let her resume being his partner and her amusing affair with their chief, Lieutenant Kevin Tidwell (Donal Logue).  Then the writers need to wholly concentrate on fresh present day stories for Charlie and his supporting gang of characters.", "overall": 4.0, "summary": "Needs Some Big Changes but Very Promising", "unixReviewTime": 1249603200, "reviewTime": "08 7, 2009"}, {"reviewerID": "A3T6HX48F66512", "asin": "B001EXRQQ8", "reviewerName": "Fry Boy", "helpful": [2, 3], "reviewText": "Season 2 continues the Charlie Crews' storyline, with Charlie attempting to determine who framed him for murder all those years ago.  While season 1 was relatively straightforward, season 2 is somewhat more complex if not confusing.  For instance, Alan Arkin, who plays Ted and manages Charlie's millions, suddenly has a daughter introduced.  In addition, instead of getting his bullet-ridden Maserati fixed, Charlie starts driving a Buick Grand National.  Then there's the sudden disappearances of Jack Reese and Olivia (the woman Ted likes but who is engaged to Charlie's father).  Furthermore, there's the girl Charlie harbors that the people who framed Charlie are looking for, but seem to have trouble finding . . . even though she lives with him and seems to come and go as she pleases.  There's a whole lot going on and I'm not sure it all needs to, or should.The introduction of Donal Logue as the police captain infuses more life into the already lively \"Life\" show.  And when he kindles a relationship with Crews' partner Dani Reese, played by Sarah Shahi, there are some scenes that simply made me say \"Wow\" (and they had absolutely nothing to do with him and everything to do with her).Garrett Dillahunt returns as Russian mobster Roman Nevikov and the always entertaining William Atherton is introduced as rich ex-policeman Mickey Rayborn.This show actually inspired me to read theThe Wisdom of InsecurityandThe Way of Zenby Alan W. Watts, an English writer and speaker that Damian Lewis supposedly read and listened to for his Zen research.  (Crews discovered Zen philosophy in prison and used it to survive there.  He also listens to Zen philosophy in his car and through an iPod after his reinstatement as a police detective.)Damian Lewis does a fabulous job as the framed police officer trying to find peace in his life.  His offbeat behavior makes for compelling television.  Too bad this show didn't get a third season.  The first two seasons are still worth watching, however, despite the lack of series conclusion.", "overall": 4.0, "summary": "Awesome show.  Almost as great as season 1.", "unixReviewTime": 1273622400, "reviewTime": "05 12, 2010"}, {"reviewerID": "AHNYRCBNPYS9P", "asin": "B001F6ZIXC", "reviewerName": "AeroEngineer", "helpful": [1, 3], "reviewText": "This is an ok show, a bit too much Sopranos lite biker edition without the strong lead(s). Just because a guy looks menacing doesn't mean he doesn't have to be that way.I thought the female lead was pretty good, probably the most believable part of this show.I like the way it depicts how mc's are in fact OC, just more adapted to the modern world than the cosa nostra is. So RICOH makes sense, I'm not sure if that's been tried against them in the real world. They have the obvious advantage of fixing/building motorcycles. It does a good job depicting how a lot of people leave their hometowns to get away from things, etc.I don't get the whole theme of Jacks' fathers manuscript, there are no specifics and it is never realized how it makes a difference in the plot. I'm watching season 2 and it still seems to have no relevance. The way they set it up it seemed like every episode was going to be an object lesson in Jacks' rebellion, never happened.Season 2 is just more of the same, I usually like shows more as they go along or they get better, it's the opposite with this show. I don't think I'll make it past season 2, like LOST, unless it gets better.-It's way too unrealistic depicting hardened criminals. These are not family men or honor bound people they are criminals. This whole family of outlaws is so naive and silly. Boyscouts these are not. THERE\"S NO CODE FOR CRIMINALS PERIOD-Please stop the musical montages, they are so shrill and overdone. I cringe and hit fast forward.-It's really silly the way the Police chief goes over and above just doing business with his business partners, the Sons.-Neither of the 2 male lead characters are that strong or believable. Jacks is usually the smallest guy in the room and dresses like a teenager. Usually the smallest guys in that situation are the most extreme or smartest, he's neither. Clay is smug and seems like a grandpa more than anything.", "overall": 3.0, "summary": "ok series, sopranos biker lite, ugh no more montages please", "unixReviewTime": 1338681600, "reviewTime": "06 3, 2012"}, {"reviewerID": "A2D37EP9KT2E3D", "asin": "B001F6ZIXC", "reviewerName": "Mark bennett \"Mark\"", "helpful": [9, 40], "reviewText": "This could have been a great show. But its not. What we get is a bunch of bikers presented as the defenders of small-town America. They get to be \"bad\" guys, but bad guys within real strict limits. Its another biker fantasy for rich guys in the suburbs. To undermine the premise even further they create real \"bad guys\" in the form of a white sumpremist gang hanging around the edges of things doing everything the \"good\" Bikers can't do.The show is also heavy on disfunctional family stuff taken right from the Sopranos. We have Jax Teller whose murdereded father apparently formed the gang as a utopian hippie experiment and would never have approved of the club running guns to make money. Jax spends half of every episode pouting about something. He just comes across as a total wuss.Ron Perlman has the presence to play the leader of the gang. But whatever presence he has is constantly undermined by Jax and the fact that every idea he has seems to fail or backfire. The show is at its best when Perlman is taking care of business for the club and showing how a small town like Charming works. Its at its worst whenever Jax gets whiny and they bitch at each other.Shows like this are good when everything is in shades of grey. When they show why someone like Clay makes the decisions he does and why idealism usually leads to trouble. But in Sons of Anarchy, Jax is always right and even if he takes a risk, it always pays off.One of the good things in the show are the law enforcement characters. There is far more realism in the show about them than the bikers.I really wanted to like this. And there were some things that I did really like. But the show is too tame and too much into biker fantasy.", "overall": 2.0, "summary": "wanted to like it, but can't", "unixReviewTime": 1254268800, "reviewTime": "09 30, 2009"}, {"reviewerID": "A1TPW86OHXTXFC", "asin": "B001F6ZIXC", "reviewerName": "prisrob \"pris,\"", "helpful": [1, 1], "reviewText": "\"Riding through this world all aloneGod takes your soul, you're on your ownThe crow flies straight, a perfect lineOn the Devil's Bed until you die\"Curtis Stigers et alMy son-in-law turned me onto 'Sons Of Anarchy' pretty late in the game. I have viewed Season one and am about to start season two. I am now part of the family. And, what a family this is!The 'Sons of the Anarchy Motorcycle Club, Redwood Original,' or SAMCRO. It is essential to know the acronyms, so you understand what the club is all about. It started as a club for Iraq Vets who didn't belong anywhere, and it turned into a gun running, violent family group of bikers.  They live in Charming, Ca, yes, I know! Charlie Hunnam plays Jax Teller, the youngest of the regulars, son of the club's originator, who died under curious circumstances. His mother, Gemma, played brilliantly by Katey Sagal,  is remarried to the President of the club, Clay Morrow, played by Ron Perlman. Several members of the club are people you recognize, Mark Boone Junior plays a wannabe Elvis, tough guy. Kim Coates plays the hit man, not someone to get on the wrong side. And others come and go.The storyline is to keep the town of Charming, crime free, except, of course, the gun running and the killing of competitive motorcycle clubs and other bad guys. The local Sherriff is on the club's payroll as are other members of the police. Nice, simple little town, but, of course, it isn't. The ATF comes to town with a woman determined to bring the club down, and another stalker ATF man, goes after one of te biker's girls.  Lots of stories and they are good. Realistic, most of them, but the ones that aren't, you just overlook those parts. The acting is superb, characters full of life, and I understand that many real motorcycle clubs follow SOA, Sons Of Anarchy.Recommended. prisrob 09-08-13", "overall": 4.0, "summary": "Riding Through This World", "unixReviewTime": 1378598400, "reviewTime": "09 8, 2013"}, {"reviewerID": "ARNAOSKQZMM2J", "asin": "B001G8MP9Y", "reviewerName": "Amanda", "helpful": [44, 44], "reviewText": "No one would have thought that when JAG introduced a new team of naval criminal investigators that it would spawn a new television phenomenon. When NCIS spun off from JAG in 2003, it was billed as a more modern, more action-packed version of the legal military drama. While NCIS started out fairly modestly in the ratings, it became one of the few shows out there to increase ratings every season until it became one of the most-watched shows on television. NCIS became so popular, in fact, that it's spawning a spin-off of its own, NCIS: Los Angeles, set to air this fall on CBS.NCIS follows the lives and adventures of a group of Naval Crime Investigative Service agents who conduct criminal investigations for the US Navy and Marine Corps.What makes NCIS one of the best crime dramas on television are its amazing characters and cast. Every member of the NCIS team has a unique personality that adds humor, spunk, fun, and a degree of unpredictability. From the perverted, boyish -- and, might I add, die-hard Ohio State Buckeyes fan -- Anthony \"Tony\" DiNozzo (Michael Weatherly) to the perky, tattoo-covered, caffeine-addicted goth Abby Sciuto (Pauley Perrette) to the gut-instinct, dashing Leroy Gibbs (Mark Harmon) and others, NCIS is the perfect mix of fast-paced crime drama and spot-on character chemistry.Even if you aren't a big fan of crime dramas, are turned off by the blood and dead bodies, or just want to stay away from military-related shows, NCIS still has something to offer. The interplay between the characters is hilarious, fun, and just downright enjoyable. The cast really works together to make the show shine -- really, most television casts don't even come close to the character chemistry in NCIS.Season six is another triumph for the series, continuing the show's trademark creative, character-driven dialog. The cases are just as fact-paced, fascinating, and unpredictable as ever. Even more than previous seasons, though, season six plays on emotional cases and unexpected occurrences that take the characters to the edge. Each episode is packed with plenty of amazing twists and turns and leads to an unforgettable cliff-hanger.One of the (very) few downfalls of this season is the pair of \"Legends\" episodes that take Gibbs and Agent Tim McGee (Sean Murray) to Los Angeles. The purpose of these episodes is to introduce the cast and concept of NCIS's spin-off show, NCIS: Los Angeles, much like when NCIS spun off from JAG. While I understand the reason for these episodes, and appreciate that they are still interesting and well-paced, I found that I missed the NCIS characters that I have come to love. There just wasn't enough of Ziva, Abby or Tony in these episodes.The bonus features for season six are great. They include cast and crew commentary on a handful of episodes, an acoustic version of Pauley Perrette's \"Fear\" from the NCIS soundtrack, a great collection of cast discussions about the events of season six, an enlightening feature on the company that creates the artificial bodies used on the show, an in-depth look at the first story arc of the season, and a feature on the unforgettable episode \"South by Southwest.\"This season continues the legacy of NCIS and proves once again why it's one of the best crime dramas and highest-rated shows on television. Be careful when you buy this one, because you'll want to sit back and watch every episode back-to-back before starting over again. If this is your first introduction to NCIS, you'll want to rush out and get the other seasons.Turst me -- once you try out NCIS, you'll be hooked until the end.", "overall": 5.0, "summary": "One of the best crime dramas on TV!", "unixReviewTime": 1251244800, "reviewTime": "08 26, 2009"}, {"reviewerID": "AB0GGIQBNB36Q", "asin": "B001G8MP9Y", "reviewerName": "Ben Milton", "helpful": [0, 0], "reviewText": "We open up with Vance splitting the team up, why you ask. To catch a mole,  now normally these make for good episodes. But NCIS actually manages to screw it up, it would have been better had Vance let Gibbs know in advance what was going to happen, but no. Ziva is back at Massad, Mcgee in the cybercrimes unit, And Dinozzo and agent afloat. Now I don't like the Vance character, as a matter of fact, he brings absolutely nothing to the show. We find out that Gibbs endorsed agent langer, who replaced Dinozzo, the girl that Jimmy Palmer was seeing in earlier seasons, is all of a sudden a mole. Who kills Langer, but made it look like he was the mole. I'm serious, season six just jumps and zigzags all over the place, with stories that don't make sense. And they feel like they were put together at the last minute, Tony is finally brought home, and the team is reassembled. Now, I have always said. I would like to see a more confident Mcgee, and they tried to that in an episode called \"Caged\" where he has to get a confession from a female serial killer in a women's prison, one of the few bright spots of the season. But after this episode, he goes back to being Dinozzo's whipping post. We do meet Gibbs's dad, the only true shining moment of the season. We get a decent episode about Ducky's past in \" Broken Bird\" but the episode is so drawn out, I fell asleep halfway through it. Abby gets an episode by herself that's not bad, not great, buuuuuut it's okay. We get a cross over with NCIS LA, a two parter. Now my major problem with the ending, is all of a sudden. Ziva knows a Massad operative is in the country, going after the same people NCIS is going after, and she doesn't tell Gibbs. Nor anybody else, except Dinozzo has figured it out. And tries to give her a chance to come clean, Dinozzo with the blessing of Gibbs, keeps digging. And confronts the operative, who is also Ziva's boyfriend. Which leads to a confrontation in Ziva's apt. Where Tony has no choice but to kill the guy, now this whole storyline comes out of no where. The whole season even felt like a soap opera, particulalry when at the end, they're getting ready to leave Isreal, and Ziva tells Gibbs she must stay, even  after Tony proved he was innocent, she still didn't trust him. Yeah, season six is okay, but my conclusion is this, seasons 1-4 are the golden years, season 5-8 are the so-so to bad years, season nine is great.", "overall": 3.0, "summary": "the continuing decline", "unixReviewTime": 1346976000, "reviewTime": "09 7, 2012"}, {"reviewerID": "A2F7CCPK4QL359", "asin": "B001HINEH0", "reviewerName": "Bennet Pomerantz \"Bennet Pomerantz, AUDIOWORLD\"", "helpful": [2, 2], "reviewText": "in the early 1960's, Someone animation studio  took the idea of moving stilled comicbook images with slight motion (an arm, a leg),  voice, sound and special effect using Marvel comics. This  Marvel animated comic was before 1966 Superman (The New Adventures of Superman - (DC Comics Classic Collection)and  1967 Spiderman cartoon (Spider-Man - The '67 Collection (6 Volume Animated Set)). THis version of the Graphic Novel of the Watchmen is similar to the old Marvel comic animation.For those fans of the graphic novels, this five and a half hour two disk DVD is like an audio book with pictures. This is NOT a kid's comic, I suggest a PG-13 to an R rating, if you were to put a rating on it. This is an adult graphic novel with sexually and slight nudity.The Powers that be on Warners could get rid of the pictures and release this as an audio book presentation with ease. What amazes me is the text and the graphics still hold up in this stilted animation. Nevertheless some of the animated effects on the DVD seems cheesy at times, like the rain effects and the walking effects.This acts like a graphic novel without frames.The only problem this has is the comic balloons that pop up on the screen, it takes away from the images since the vocals are the same as the balloon . It makes it less like a motion graphic novel, than a comicbook made for video. If I wanted to read, I would have picked up the graphic novel and read it.Voice artist Tom Stechshute sounds vocally a little like an younger Ed Asner. I would have hoped that this graphic novel should had a multi-cast radio style production, rather than one voice. Stechshute seems weak when he does the female voices, but he does try.  He does a good job under the Vocal direction of Kelly Ward. However the power that be should have spent the money and gotten voiice casting and director Andrea Romano (who has done everything for Warner Animation  from Batman the Animated Series,  Scooby doo to the latest DC animated DVD featureWonder Woman 2009 (Two-Disc Special Edition + Digital Copy)).If you are a fan of the graphic novel, This DVD version is a great edition to a comic collection. It is an interesting concept, love to see them explore it with other graphic novels like MausThe Complete Maus: A Survivor's Tale (No 1)and ElfquestElfquest Archives Vol. 1. However, I suggest you still read the classic graphic novelBennet Pomerantz AUDIOWORLD", "overall": 4.0, "summary": "A DVD comic book", "unixReviewTime": 1236124800, "reviewTime": "03 4, 2009"}, {"reviewerID": "ADWQPR0LJD4J", "asin": "B001LUW8G2", "reviewerName": "ERSInk . com \"Eric\"", "helpful": [3, 5], "reviewText": "Warner Bros. Archive brings &#34;Batman: The Brave and the Bold: The Complete First Season&#34; to Blu-ray for the first time in a 2-Disc edition versus the different volumes it was originally released in a few years back. All 26 episodes are here for fans waiting frantically to get them in high-definition. For those who might not know, this series has more in common with the camp approach to the Caped Crusader than Christopher Nolan's grimmer &#34;Dark Knight&#34; Trilogy.Batman prides himself on protecting the city of Gotham City as a solo crime fighter. However, there are many times when the world is threatened on a global scale. Our hero must join forces with the likes of Aquaman, Plastic Man, Green Arrow, Wild Cat, Dr. Fate, and many others when these perils reveal themselves.Although &#34;Batman: The Brave and the Bold: The Complete First Season&#34; is presented on manufacture-on-demand recordable Blu-rays, the audio and video quality is top-notch. The picture is clean and the colors are vibrant the way they should be. It's obvious the show was influenced by the eye-popping art styles of Bob Kane and Dick Sprang.The 5.1 surround sound audio delivers the dialogue and musical score in excellent clarity. This comes in extra handy when there's an entire episode centered on a villain named the Music Meister who causes everyone to sing what they're saying. Every bam, boom, zoink, and klunk can be heard and doesn't need to be spelled out onscreen like they were in 1966.The main target audience for &#34;Batman: The Brave and the Bold: The Complete First Season&#34; is children. Some parents might be alarmed by the amount of magic used in the show. There are also references to different gods other than the Christian one. If your child can separate fantasy from real-life and you don't mind some spells being spouted or deity figures in the vein of Greek gods appearing, you shouldn't have a problem.&#34;Batman: The Brave and the Bold: The Complete First Season&#34; will thrill enthusiasts of the 1960's Batman TV show starring Adam West and Burt Ward. If you love the brightly colored sci-fi and fantasy exploits of the Caped Crusader from the 1950s and 1960s comic books, this will excite you as well. If you only see the Dark Knight through the glasses of Tim Burton and Christopher Nolan, you'll quite possibly find the series hard to swallow.", "overall": 4.0, "summary": "&#8220;Batman: The Brave and the Bold: The Complete First Season&#8221; Springs on to Blu-ray", "unixReviewTime": 1392163200, "reviewTime": "02 12, 2014"}, {"reviewerID": "A2TZ85S0JX2JBO", "asin": "B001N4PPWK", "reviewerName": "C. Hughes", "helpful": [0, 0], "reviewText": "I think that whenever you love a television show, you should get the DVD as homage to a show that you loved but also because of the DVD extras. First, the weakness of this DVD set is that there doesn&#8217;t appear to be any cast member commentary which is a shame because there are occasions when watching the show that I wonder why a cast member made a particular choice or how much fun did a cast member (or couple of cast members) have in a scene. So I hate not having them there to explain their view point. With that said, I love hearing the producers, directors, and writers provide input on scenes and/or the process to get to a scene.The contributors are a chatty group so make sure that you&#8217;ve watched the episode so many times that you know what&#8217;s going on without hearing. And they appear to have made a conscious decision to not &#8220;watch&#8221; the show rather to comment. So they aren&#8217;t watching the show with you they are talking about what went on behind the scenes. They talk about some of the infamous Hardison scenes and Aldis&#8217;s improvational skills which they really love and trust. They talk about Pardison and conscious decisions that were made to be physically stand next to one another to show their growing relationship. That talk about Kane humor and the humorous actions and expressions that he brings to Eliot that I had never really thought about. They discuss sibling relationships (Eliot, Parker, Hardison) the father/son dynamic between Nate and Hardison, and the &#8220;equals&#8221; relationship between Eliot and Sophie/Nate. These are things that you saw as a fan but it&#8217;s good to hear it discussed.I&#8217;m only on season two but it is the conspiracy episode where the reporter has ruined a guy&#8217;s career so the team sets out to discredit the reporter. In the episode, Parker becomes curious about conspiracies and begins to ask Eliot about different conspiracies. Not sure who it was but someone mentioned that he sent a note to a big wig and asked, &#8220;How is Eliot responding to Parker.&#8221; The reply came back, &#8220;Like a big brother effing with his baby sister.&#8221; It&#8217;s something that we saw but it was nice to hear that response.As indicated, I&#8217;m only on season 2 but I&#8217;m so pleased with my decision to purchase this. I purchased seasons 1 - 3 together because the 5 season bundle wasn&#8217;t offered. But I&#8217;m going to have to get season&#8217;s 4 and 5 soon because I am watching a season a weekend. It&#8217;s a shame that TNT cancelled this show because it really was a fun show to watch.", "overall": 5.0, "summary": "Glad I got the DVD", "unixReviewTime": 1395014400, "reviewTime": "03 17, 2014"}, {"reviewerID": "AP3B615GM191G", "asin": "B001OHU9VS", "reviewerName": "Zachary Koenig \"K-Dawg\"", "helpful": [0, 0], "reviewText": "One of the hallmarks of the first two seasons of \"Friday Night Lights\" was the show's ability to really use its ensemble cast to the fullest.  Each week would shine the spotlight on a different character scenario or two, and if those weren't the ones that appealed to you...well, you knew that the next week it would be something different.  While this third season does a good job of moving certain storylines forward, it also turns rather repetitive at times in terms of the areas it really focuses in on.For a basic summary, Season Three is one in which we (as viewers) say goodbye to some established figures and welcome some \"new blood\" into the fold.  Because the writers strike of 2007 completely screwed over Season Two's \"ending\", the beginning episodes of this year basically just get us back up to speed.  From there, a few things given to us in this installment include:-Mrs. Taylor's new role as school principle and the new perspective it gives her on certain issues.-The continued evolution of the Tyra/Landry & Tim/Lyla relationships.-Jason Street doing everything he can to provide for his new \"family\"-The ongoing foibles of Buddy Garrity.-A new QB threat to Matt Ceracen.There are some parts of Season Three that work very well.  The chemistry within the Taylor family is still the backbone of the show, and it still never fails to produce emotion in nearly every episode.  The \"new QB in town\" angle is also probably the strongest one of the entire season.  Tami's new turn as school principle also brings up some moral dilemmas that prove quite interesting.The trouble with this season, though, is that all the other angles fall under the following two categories: Either they are done too quickly (Smash Williams, Jason Street), or they linger on for far too long (Tyra's rebellious streak, the ticking time bomb that is Tim Riggins).  More specifically, the characters of Tyra & Tim (who really stood out in the Second Season) are given more screen time but less character development in the sense that they don't seem much different from beginning to end.  It is probably a case of the writers knowing that such drama works with most viewers and being a bit scared (in the wake of cancellation) to stray too far from the formula.Overall, then, I can't rate Season Three of \"Friday Night Lights\" nearly as well as its two predecessors.  Whereas those earlier seasons were high drama with pockets of repetition, I felt that the formula was flipped in this case.  The ending of the season set up a scenario that looks like it has great potential to produce an entertaining fourth season, so I'm not giving up hope just yet.  I'm just a bit concerned that the show has \"slipped\" a bit with each subsequent season so far.", "overall": 3.0, "summary": "Too Much Repetition...But Still Gets By On Established Characters", "unixReviewTime": 1352246400, "reviewTime": "11 7, 2012"}, {"reviewerID": "A13E0ARAXI6KJW", "asin": "B001PN63PC", "reviewerName": "Ed Uyeshima", "helpful": [2, 2], "reviewText": "I notice the strong influence of Elia Kazan (On the Waterfront,Splendor in the Grass) in James Gray's intimate 2009 character-driven drama, the signposts being the human scale of the story and the realistic dilemmas faced by the main characters. The director/screenwriter manages to achieve a somber stillness to the film that allows the actors to breathe and inhabit their roles in a more subtle manner than you would expect from a story focused on working-class lives in Brooklyn's Brighton Beach neighborhood. The plot focuses on Leonard Kraditor, a moody, suicidal young man in the aftermath of a nervous breakdown triggered by the end of an engagement forced by genetic disorders running in both their families. Consequently, it would have been impossible for them to have healthy children. Grappling with bipolar disorder, Leonard has moved back with his parents working half-heartedly at the family dry-cleaning business, as they seek out a suitable replacement fianc&eacute;e. She comes in the form of Sandra, the eldest daughter of his father's more successful business colleague.Leonard, however, has unrealized dreams to become a photographer rather than default to running the family business. Life gets more complicated when a new neighbor moves in upstairs, a pretty blonde named Michelle, who turns out to be a law office assistant in an unsteady relationship with one of the partners, Ronald, an urbane married man who is hesitant to leave his wife for her. Unlike the tame girls he is used to dating, the emotionally fragile Michelle becomes Leonard's object of passion and obsession. The story follows their tentative romance from friendship to a desperate love steered by Ronald's inability to make up his mind about her. Interspersed between their clandestine episodes are scenes from the other half of Leonard's life, a more traditional existence as he becomes further involved with the calm, nurturing Sandra and her welcoming family. Things come to a head when Michelle, having suffered a miscarriage thanks to Ronald's indiscretion, decides to move away to San Francisco, and Leonard must then decide between stability at home and the prospect of an exciting life.Joaquin Phoenix excels at these types of inarticulate roles, and Leonard provides him with the ideal opportunity to express the inchoate romanticism of a badly damaged character. In certain respects, it's a more impressive performance than even his turn as Johnny Cash inWalk the Line. As Michelle, Gwyneth Paltrow once again proves to be a better actress than she often aspires to be with a performance pitched precariously between entitlement and neediness. Vinessa Shaw has the least challenging of the three roles, but she brings natural warmth to the unsuspecting Sandra. On the sidelines, Elias Koteas makes his two key scenes count as the conscience-embattled Ronald. As Leonard's protective parents, Israeli actor Moni Monoshov and a surprisingly aged Isabella Rossellini are affecting with Rossellini particularly heartbreaking in a climactic scene with Phoenix. The ending has a haunting quality that signals how Leonard's fragile state will forever be challenged by the choices he makes. The 2009 DVD is short on extras with a couple of making-of featurettes and three deleted scenes, all wisely cut since they would have provided an unnecessary imbalance to the characters' relationships.", "overall": 4.0, "summary": "Romantic Triangle  Drama Benefits from Gray's Introspective, Kazan-Like Approach", "unixReviewTime": 1270425600, "reviewTime": "04 5, 2010"}, {"reviewerID": "AJRFZ0VZ0LD26", "asin": "B001PN63PC", "reviewerName": "Reader \"Eugenia\"", "helpful": [2, 3], "reviewText": "Leonard is sensitive and charismatic young man.  He is sort of an artist, a self-thought photographer who produces black and white pictures of American urban landscape (portraits are not his forte by his own admission).  He reads a lot and is loved and indulged by his parents.  But Leonard is utterly unhappy.  His long term relationship and engagement has ended abruptly and his emotional vulnerability is making it impossible for him to function in a society without medication and constant and vigilant care from his parents.As Leonard is struggling to figure out whether to live or die, he works is his father's dry cleaning business and in a short period of time meets two beautiful but very different women.  One is dark haired, professional and independent, affectionate and caring.  The other is blond, compulsive, party girl, kept by a married man on a side for his personal entertainment.  Inevitably, Leonard is attracted to a troubled and emotionally unavailable girl convinced that he can help her and take care of her.  The social pressures of his parents and prospective business deal, propels him in the arms of the other.As story progresses, we are simply curious to see which girl will be Leonard's final choice.  Is he going to follow his heart, or follow his head?  What is it that each of the women can offer him and what is it that he can offer them?  What is the true love?  Is there a compromise in life that one has to make in order to become functional and even happy?I really liked the movie because the director touches up on all of these points delicately and thoughfully.  As it turns out the improbable sometimes turns out to be probable.  Of course, there is a price to it.  To learn what the price is, you must see this movie.  Many consider Gwyneth Paltrow to be the \"it\" girl.  I am sorry, but in this movie, it is Vinessa Shaw that steals the screen.  Her high cheekbones and raven hair give her exotic beauty image that very few actresses can offer to the audiences.", "overall": 4.0, "summary": "Settling for the second best", "unixReviewTime": 1248912000, "reviewTime": "07 30, 2009"}, {"reviewerID": "A3N6GAJTEOF4MO", "asin": "B001QDDILI", "reviewerName": "Caleb Williams", "helpful": [5, 8], "reviewText": "Up to season 5 House was known as focusing a lot on the comical witticisms of House as he insulted his colleagues and his boss. This particular season takes a more serious turn, and although there does exist the comedy that it's famous for, there is a more serious aura around the entire season and its characters as all is not well in the land of Dr. Gregory House. For a medical drama, House is pretty special as it retains a very formulaic style of storytelling and wholly stays away from soap opera dramatics; instead replacing them with casual love stories, complex medical cases and an even more complex main star.Just when we think we know House, the show takes another massive turn and shows us a completely different side to him that we never thought existed. Season 5 seeks on exposing a new emotional side to House. At the end of season 4 we saw the end to Wilsons girlfriend, Amber and what we are lead to believe to be the friendship of House and Wilson. Season 5 opens with our worst fears, Wilson quits and tells House that they can no longer be friends and in order for Wilson to be truly happy, he must have House out of his life.In comes a private investigator hired by House to spy on Wilson in his new life and also his team. The split doesn't last for long and House & Wilson end up back to their old tricks of childish friendship antics. Chase & Cameron gain a more prominent role in this season as their relationship is explored in more detail as Cameron struggles with the possibility of a permanent relationship as she still can't let go of the memories of her husband who died a few years prior to their relationship. This presents a higher purpose for them still remaining in the opening title sequence and hopefully, this increased prominence will mean they become a stronger part of the team in season 6.Thirteen is also forced to struggle with the fact that she has Huntington's disease, and to a certain point takes it very badly. Foreman also gains a bit more purpose in this season and develops a relationship with Thirteen, but I felt like this relationship was only brought into the picture to avoid having to fire him as even now his presence just seems pointless. Taub and Kutner are their usual selves with nothing really important happening to them other than House torturing Taub over his affair. There are quite a few delightful surprises that take place during the season, some are more important than others, but they're all designed to keep us watching to the next episode.As with every TV show, the finale is always the most special episode that will keep you wanting more up to when the next season starts. House is no exception to that rule and although most TV shows may create a cliff-hanger to keep you wanting more, they would also wrap a few stories up so they don't have to be revisited. House very rarely does that. Instead it gives us riveting cliff-hangers that makes us question the true brilliance of what we have seen, yet if you're not a fan of the primary cliff-hanger, there's also a few other stories that you will want to know what happened next. This is a truly brilliant season that exposes a more emotional and loveable side to House that have only briefly been explored in previous seasons. There is one massive shocker that most reading this review will have probably heard about by now, but it's just an overall great season and worthy of any House fans DVD collection.", "overall": 5.0, "summary": "As Always, Amazing", "unixReviewTime": 1243900800, "reviewTime": "06 2, 2009"}, {"reviewerID": "A10CJINP7KBR4W", "asin": "B001QDDILI", "reviewerName": "M. Herzog", "helpful": [1, 2], "reviewText": "Season 5 shows signs that House's premise may be wearing a little thin.  The premise of course is that every episode involves someone getting sick, several failed attempts to save said person, then House hears or says something that makes him realize the actual disease/problem and saves the patient.  While this was cleverly intermixed with a number side stories, usually involving personal issues, this season the premise was wearing a little thin to me.  Most the time I didn't care much about the case this season as I knew the pattern and wasn't very surprised.  This is the trouble with all premised shows, eventually you get used to the pattern, then get a little tired with it.Similarly, the side stories weren't nearly as interesting this season.  While I thought House looking for a replacement for Wilson was rather interesting, I was a little surprised by how quickly this story was over, thought I was thrilled to have Wilson back.  Also, the budding of a new romance felt a little forced, and was ultimately not nearly as interesting as Cameron and Chase.  Speaking of which, why has their role on this show been limited to a few lines an episode?  I liked the story of them leaving, but if they were going to leave they should have been gone, not just showing up to remind us how much we miss the old days.Ok, I know I'm making this season seem terrible, but it wasn't.  House is an excellent show, and I loved the personal stories.  When Cutty finally got a child, I loved that she wasn't very good at it at first.  Most shows would have given her the child and made everything perfect.  This show portrayed the problems and compromises that go along with becoming a parent, and I loved it.  Also, I loved Wilson.  Like Holmes and Watson, Wilson is the likeably foil for House, adding a much needed feeling in House that wouldn't be there without his character.  But while I loved a number of things for this show I can't help but feel the show's premise is running a little thin.  Can't we go one episode without multiple fails for a disease I've never heard of?  Maybe not, I don't recall Angela Lansberry taking one trip on Murder she wrote that didn't result in a dead body.I love House, but this season didn't add anything new, just rehashed a lot of the same.  I'll keep watching, but won't be nearly as excited.", "overall": 4.0, "summary": "Premise is wearing thin...", "unixReviewTime": 1254787200, "reviewTime": "10 6, 2009"}, {"reviewerID": "AW3VZ5O895LRK", "asin": "B001QDKK3W", "reviewerName": "carol irvin \"carol irvin\"", "helpful": [6, 10], "reviewText": "Tim Roth is yet another feature film actor to come to television.  So, of course, he is excellent compared to the usual actors we see on tv.  There has never been such a plethora of riches ever since the taboo dropped about \"film actors should never do television\". Testing this adage in reverse: when tv actors tried to make the leap to movies, most fell flat on their faces. (This happened to David Caruso, now of CSI MIAMI, who was happy to go to that series after discovering he did not have what it takes to be a leading man in film.)  So we now have another fabulous film actor playing Dr. Cal Lightman, an expert in lie detection,  who hires out his Lightman Group to detect deception using objective, scientific criteria, such as facial expressions. I would join everyone else with five stars if I were grading this series based on Tim Roth being in it as the sole factor.  However, that is not the sole factor to this tv series.The actors who surround Roth as his Lightman group are more of the usual kind of actor one finds on tv series.  His key woman, for example, the one with the philandering husband, seems one dimensional in comparison. Lightman's ex-wife and daughter verge on tv cliche territory as well.  The young man who Lightman demoted for devious behavior is also a \"type\", the tv series fresh, cute know it all who needs to be taken down a peg.  None of these characters and their actors are strong enough or good enough to cut this series from the pack.The actual stories involving the lying person under study are fairly well written.  Roth's interaction with the liar is typically where the highest level of interest occurs.  So the stronger the guest star liar, the better the show.  In this regard, if the producers wish to up the quality drastically, hire guest stars like Gena Rowlands and John Turturro, who were hired to great effect for MONK as guest stars.The weak parts of this show need to addressed.  When they are fixed, the show will truly become worthy of five stars.", "overall": 4.0, "summary": "Good New Series With Roth Being the Best Part", "unixReviewTime": 1250899200, "reviewTime": "08 22, 2009"}, {"reviewerID": "A3NH7PYU4AD5GA", "asin": "B001QDKK3W", "reviewerName": "H. Schneider", "helpful": [4, 5], "reviewText": "An interesting concept for an interesting and ambiguous crime series.Roth is an alien, a legal alien, an Englishman in Washington DC. He is a highly paid professional in the business of lie detection. He runs a company that sells services to all kinds of agencies. You name them, he serves them.His specialty is facial expression and body language. His hobby horse is 'micro expression', facial situations of less than a second, detectable only on film. Roth's business is consequently the ultimate spying approach: film people and watch the tapes to catch the ungarded moment. Of course his firm is also able to analyze voices, hence sound is also taped.He has a female American partner and two ethnic American specialist staff: an Israeli and a Hispanic woman. Roth is the ultimate expert who will manipulate even his own team to his purposes.The basic message of the series: be smarter. Don't try to beat the truth out of your suspects. It is more comfortable to catch them in contradictions and lies.So far so good, if you want to accept that these things can be done and that they should be done, as they might work better than other approaches. Of course nobody would want to live with living lie detectors like these, hence their private lives are troubled.Why do I deduct a star? First of all, Roth is so much the star here, most other actors move like wooden puppets. Casting is uneven, to say it politely. Second, the range of possible stories is limited, so unavoidably some of the episodes are contrived or lame. If you delete half of the series (but how do you know which ones?), you will have an interesting and even challenging TV entertainment. Challenging not because it is hard to grasp, but because its ethical implications are far from clear.", "overall": 4.0, "summary": "Big Brother's little brother", "unixReviewTime": 1261612800, "reviewTime": "12 24, 2009"}, {"reviewerID": "A2RDR5G65D9H84", "asin": "B001QDKK3W", "reviewerName": "Sebastian Fernandez", "helpful": [0, 0], "reviewText": "I hate to say this, but I was not aware of how good this series is until a few weeks ago my sister-in-law told me to give it a try. I had seen the series available for purchase but never felt compelled to watch it. But with the recommendation my wife and I sat down to watch at least one episode. Holy sh...! The experience was so much better than expected that it was almost funny.The premise of the series is truly interesting. Dr. Cal Lightman is one of the world's preeminent authorities in deception detection. He studies the micro-expressions in people's faces and can determine if they are lying and what is the emotion that dominates when asked different questions. He has a company with a huge team of people that help him use these methods to help different organizations and private individuals to find the truth.The cases presented in this episode are varied and always engaging. We typically get two cases per episode, which allows the creators to blend in Lightman's sidekicks in each of these. The other thing I do which I love is illustrate the emotions characters in the series are experiencing by showing them in slow motion and then also showing still images of public figures with those same facial expressions. Many times I found myself laughing at this, and no public figure is spared.Besides the main plot lines in each episode, we also get to little by little see more about the private lives of the characters, which I always enjoy. In particular, there is a portion of the story dealing with Cal's business partner, Foster, and her marriage that gives an added level of complexity to the story. We also have \"the natural\", a young woman with a hard past that has the ability to read people before any formal training. Her relationship with Cal, her mentor, is always explosive and keeps us on our toes.The whole case does a great job with their acting. There is a significant portion of the action that has to do with facial expressions, and they are all proficient in this area. However, I do have to mention Tim Roth separately because he is truly amazing. The role of Cal fits him to a T and he is really convincing in his performance. Without him the series would not be the same.The bottom line is that this series cannot me missed. We have devoured this first season and are already a few episodes into the next one.", "overall": 5.0, "summary": "Clever, original and with superb acting", "unixReviewTime": 1376092800, "reviewTime": "08 10, 2013"}, {"reviewerID": "AQP1VPK16SVWM", "asin": "B001QDKK3W", "reviewerName": "Wayne Klein \"If at first the idea is not absu...", "helpful": [1, 2], "reviewText": "An exceptional series \"Lie To Me\" appeared (at least to me) mysteriously on Fox's schedule and quickly moved from an unknown quantity to one of the best shows on TV. The Blu-ray looks exceptionally good be aware that there is a signficiant amount of grain which is an intentional look for the show. The images are crisp, sharp and colorful audio sounds terrific as well. Lightman is the Sherlock Holmes of our generation.Separating lies from the truth is Dr. Cal Lightman's (Tim Roth)business. He's studied people from a variety of cultures and discovered that we have universal expressions that we use when we're telling the truth, lying or under stress. He uses these skills with his collegues at the Lightman Group to help uncover a terrorist operating on U.S. soil, who caused an explosion at a construction site which resulted in the crew being buried alive and to find out who a imprisoned serial rapist is using on the outside to continue his crime spree on the outside. In the process Lightman often alienates his own staff including Dr. Gillian Foster (Kelli Williams), his protege Ria Torres (Monica Raymund) and his own family. Knowing the truth and the tells about who is lying and why can change your life, damage your relationship with your wife, daughter and others but also save people. Once you've turned the ability on it's impossible to turn if off again making life difficult for Lightman and those around him.We get all the uncut first season episodes plus a behind-the-scenes featurette on the creation of the show featuring the show creator/producers/writers featurin plenty of clips from the first season to illustrate their point.Interestingly, the producers and cast are asked who the biggest liar is on the show....you'll be interested in the result. We also get deleted scenes from the show. The show looks quite nice in its home digital debut.Truly the only thing missing from this set are commentary tracks. These would have been nice to hear as we could have heard about the genesis of various scripts, changes that occurred between writing/shooting and the thought process of the directors/actors in the episode. Aside from that minor flaw, \"Lie to Me\" is an exceptional TV show.", "overall": 5.0, "summary": "An exceptional series (I'm not lying honest there's no single shoulder shrug,  see) receives an extremely good transfer", "unixReviewTime": 1261785600, "reviewTime": "12 26, 2009"}, {"reviewerID": "A1D2C0WDCSHUWZ", "asin": "B001R4175U", "reviewerName": "E. A Solinas \"ea_solinas\"", "helpful": [11, 12], "reviewText": "Ah, werewolf movies. They're like the little girl with the curl -- when they're good, they're very very good, and when they're bad, they're.... fodder for MST3K.Such is the fate of \"Werewolf,\" Tony Zarindast's tale of lycanthropy and stupidity -- a sloppy, ineptly-assembled pile of FAIL from the first scene to the last, with acting worthy of a Razzie and a plot apparently dreamed up during a bad hangover. So of course, Mike and the bots tackle all the hilarious stupidity with good grace... when they aren't having identity crises.Mike's attempts to escape back down to Earth are foiled by Pearl and Brain Guy, so he ends up climbing right back to the Satellite just in time for \"Werewolf.\" When they aren't watching the movie, Mike accidentally becomes infected with Crow's essence and begins turning into a WereCrow. I don't think the world is ready for two of them.As for the movie itself: it's about a bunch of archaeologists who find a \"wur-wilf\" skeleton out in the desert, which causes one of them to transform. Designated evil scientist Yuri (Jorge Rivero) decides to experiment by infecting random people with lycanthropy, and one of the accidental victims is is a greasy writer named Paul (Federico Cavalli) who is interested in the ever-wooden Nathalie (the wooden Adrianna Miles).\"Wurwilf\"... I'm sorry, \"Werewolf\" is not the worst movie that \"Mystery Science Theater 3000\" has ever reviewed, but it's pretty bad. Everything here is worthy of mockery -- the bad special effects, the cardboard characters, silly cinematography (the girl who can't run through a mud puddle), the awful costumes (is that a bear? A bat?) and Yuri's ever-changing hair.But of course, the endless stream of mockery turned out by Mike, Joel and the robots is absolutely gutsplitting. They constantly snark bad continuity (\"Did those oil barrels just leap out in front of him?\"), stupid characters (mock the stupid Russian chick's accent -- \"You and Noel is in it for fame and fortune? But over my dead body!\") and constant running jokes (the fact that Natalie is clearly dumb as a stump).Even the framing stuff is hilarious, with Mike becoming a WereCrow (\"... and you know, I'm perfectly comfortable with that, yeah\"), and the three main characters dressing up like a 50s girl band and singing a peppy pop song about falling in love with a werewolf.The movie is awful, the snark is hilarious, and the wurwilf is about as frightening as one of the monsters from Twilight. One of my all-time favorite episodes of MST3K.", "overall": 5.0, "summary": "Where oh werewolf?", "unixReviewTime": 1328313600, "reviewTime": "02 4, 2012"}, {"reviewerID": "A1D2C0WDCSHUWZ", "asin": "B001R4Q6A6", "reviewerName": "E. A Solinas \"ea_solinas\"", "helpful": [2, 2], "reviewText": "\"Mystery Science Theater 3000\" has a few of those awesome, special episodes that not only hit all the right notes, but actually go even further. One such episode is \"Soultaker,\" a clumsy supernatural thriller that seems like an 80s teenage version of \"Carnival of the Damned,\" only with teenagers and hair metal. And guess who make cameos!The Satellite of Love\" is malfunctioning badly, complete with Gypsy getting mean and transmissions of Martin van Buren (I never understood that one). Pearl is uninterested in saving Mike and the bots, so she simply sends them the movie \"Soultaker.\" But a mysterious ship is flying alongside the Satellite, keeping them in a tractor beam. Who or what is saving Mike and the bots?As for the movie, it's about a bunch of teenagers driving home from a concert... festival... thing, and they get in a nasty car wreck after they see a man in black standing in the road. And as the man in black pursues them, two of the remaining teens discover that they are actually BRAIN-DEAD -- and their comatose bodies will be taken off life support at midnight.\"Soultaker\" is not the worst movie that MST3K has done -- it's not even the worst amateur attempt at one by someone who has a \"great story\" to tell. It's theologically muddled, inconsistent and has a lot of plot holes (how do DEAD PEOPLE operate the elevator?), but it has some decent moments. It's awkward and clumsy, and that's what makes it bad.That is something you can't say about the Mike, Tom and Crow segments, which are perfect. These guys had snarking down to an art form, whether it's joking about the clumsy script (\"But shes upper middle class and we're slightly lower middle!\") or the funny-looking actors (\"It's a catcher's mitt with eyes!\"). And of course, many jokes about Joe Estevez.And the hosting segments are also fun, with Mike struggling to command the Satellite, even as Gypsy insults him and Tom and Crow have a wet T-shirt contest. But those segments become AWESOME when a pair of familiar faces drop in for a visit... guess who!\"Mystery Science Theater 3000: Soultaker\" is one of those must-see episodes of the classic snark series -- it's funny, strange, and has CAMEOS.", "overall": 5.0, "summary": "\"Pearl! Pearl! Hello? Our wessel is malfunctioning!\"", "unixReviewTime": 1329177600, "reviewTime": "02 14, 2012"}, {"reviewerID": "A30FLSURDH2YYX", "asin": "B001R4Q6A6", "reviewerName": "Stuff My Cat Wants NOW!!!", "helpful": [0, 0], "reviewText": "As MST3k is sort of a show within a show within a movie format, I like to review each part of the episode as a good or bad part can save or ruin the entire episode.The Movie: In this late 80's movie, a group of teenagers who died in a car accident are chased by an angel who must take their souls - or else.  By \"80's\", I mean the real 80's - not the fake John Hughe's version that Hollywood loves to sell.  Bad hair - check!; bad music - yep!; acid-washed jeans - of course!  And by chase, I mean the kids are constantly running while the angel played by Mr. Estevez (Joe - not those other relatives) walks in a slow but constant pace (and of course always catches them).  The movie while bad is one of the more capably made movies on MST3k.  It does move at a good pace until the 20 minute hospital elevator chase scene near the end.Host Segments: There are two big moments, which I won't discuss as I don't want to ruin the surprise.  I will say this:  this is one of the few episodes where I wish they would have broken the traditional format and would have given more time to the segments.  Both moments seemed very rushed which is a shame (if you are an MST3k fan, be prepared to be a little misty eyed).  I truly wish MST3k would have edited out 10 minutes of the elevator chase scenes so that we could have spent more time with the crew.Riffs: One of my biggest complaints about Joel was his constant use of 50's - 70's cultural references; I only got about half of his riffs and always felt like I was missing out on these inside jokes.  Alas time has moved on and now I can see how today's younger viewers might feel the same about Mike's quips - which were more current and topical when originally shown.  So if you remember the \"Super Bowl Shuffle\", you will love these riffs.  If not, then trust me - I know the feeling of not knowing why the crew is laughing.Overall:  So this episode has a watchable movie and two unforgettable host segments.  I gave this episode 4 stars based on the following:  If you were around in the late 80's, then there is a constant stream of funny riffs making this episode a top 10 (5 stars!).  However if you were born after the show went off the air, then most of the riffs won't make sense - but at least it is a good episode (3.5 stars).", "overall": 4.0, "summary": "Joe Estevez chasing dead teenagers!!  2 Big Moments!!  Offset by dated riffs", "unixReviewTime": 1341792000, "reviewTime": "07 9, 2012"}, {"reviewerID": "A1PJZKEZQGREDY", "asin": "B001RPORJ2", "reviewerName": "California Dreaming", "helpful": [2, 3], "reviewText": "This film is about things that are reversed:  people look in the mirror and see the reverse image.  They look into X-rays and see a heart that's on the wrong side.  They look at their spouses and don't recognize them at all.  But it's also about things that are broken:  those same mirrors moments later, the windshields in their cars, and even broken people and relationships.It's hard to review this film in a way, because if you discuss any of the plot, it seems that you may be introducing a spoiler.  But in reality, even after watching, I'm not completely convinced that I know exactly what happened.  I will say that I considered an alternate universe idea -- with an evil doppelganger, perhaps everyone has one (physicists would argue that there are infinite universes, and in each of those, at least where \"you\" exist, \"you\" are different) -- and I did consider the old she-died-and-is-in-purgatory-but-doesn't-know-it-yet idea.  But the ending seems to at least dispel the latter.  I'm still not sure about the former.This film was filmed mostly in London, a city where I have been.  I liked \"The Tube\" scenes.  \"Mind the gap!\" is all that I could think about while watching those scenes, especially when the lead risks her life to fish a photograph off of the tracks.  At any rate, \"mind the gap!\" is surely advice that Americans should heed more often here in the States.  Especially lately.I also really liked the color palette that the director chose; mostly cool and cold blues to set the mood and tone.  And I definitely liked the fact that this was more of a psychological thriller than what Hollywood seems to like to pump out on a constant basis.  Aren't you as sick as I of all those slasher flicks?  At least this is a \"thinking man's\" -- or \"woman's\" -- film I suppose, even though I'm not convinced that all that thinking did me much good figuring out what was really going on.Maybe more of a 3.5, but I'll round up and give them an A- (or B+) for effort.  For execution?  I'll let you decide on a minor recommendation.", "overall": 4.0, "summary": "A Broken Plot?", "unixReviewTime": 1364428800, "reviewTime": "03 28, 2013"}, {"reviewerID": "ARNAOSKQZMM2J", "asin": "B001SE07JG", "reviewerName": "Amanda", "helpful": [0, 0], "reviewText": "After a week off, Dollhouse returned with \"Haunted,\" another wonderful, high-octane episode that brings a completely new dimension to the concept behind the series. This brings up even more ethical questions about the Dollhouse that I've never thought of before, and makes the viewer think a little bit harder about characters in the show.After Adelle's wealthy friend, Margaret, dies, she imprints the woman's memories into Echo allowing her, in a sense, to have a kind of life after death. Adelle and Echo/Margaret attend the woman's funeral, since she wonders just how many people actually loved her when she was alive. After some unexpected happenings at the funeral, Margaret decides that she wants to find out who killed her.Past this point the viewers are thrown into a surprising original twist on the age-old \"whodunnit\" murder mystery (complete with typical line-up of suspects, all this motives). I thought this was a fresh and much welcome departure from the rest of the series and allowed Dollhouse to add a little mystery into the mix. The entire plot was perfectly put together and filled with intense surprises that kept me guessing up until the very end.The story's unique approach also forces viewers to think a little harder about what kind of world they will leave behind after they die. Are their relationships and lives just as they imagine them to be, or are there some sinister secrets lurking underneath it all?Back at the Dollhouse, it's time for Topher annual \"diagnostic test.\" The purpose behind this isn't really explained, but it results in Topher imprinting Sierra with a personality that makes her the perfect nerd-friend for him, complete with knowledge of MMORPGs, laser tag, Xbox 360 and science-y stuff. While these scenes are absolutely hilarious and feature great dialogue, they are serve as a kind of window into Topher's character -and just how lonely he is.Topher's not the only lonely one. Agent Bellard is feeling lonelier by the minute as he wrestles with the truth of Mellie's identity. As Bellard pushes closer to the Dollhouse, he makes a believer in the FBI office after the two try to investigate Mellie's past.In the end the mystery of Margaret's death comes to a satisfying conclusion, despite the unbelievable idea that Margaret willingly gives up her stay in Echo's body and potential eternal life. However, I can easily overlook this detail after the rest of \"Haunted\" kept me guessing the entire time.Sadly, there are strong rumors going around that Dollhouse is going to be canceled after the first season -just like Fox cancels all of its good shows. I've also read online that Fox will not air the final episode of the season, but Joss and co. are planning to include it on the DVD.", "overall": 5.0, "summary": "Murder Mystery -Dollhouse style", "unixReviewTime": 1240790400, "reviewTime": "04 27, 2009"}, {"reviewerID": "AQZH7YTWQPOBE", "asin": "B001SE07JG", "reviewerName": "Enjolras", "helpful": [0, 0], "reviewText": "Eliza Dushku is on the cover of these DVDs and gets the most screen time in most episodes. However, Dollhouse's greatest strength and weakness is that it's not really about Eliza Dushku or her character. Let me explain.The concept behind the show is brilliant. A company programs people to serve clients in whatever capacity needed, from prostitutes to criminal investigators. The show really shines when it tackles the moral and ethical questions around this. Joss Whedon is very good about never portraying the company behind the Dollhouse as \"evil\". The characters running the Dollhouse are flawed but realistic and even at times sympathetic, yet they are engaged in this practice of servicing people. Fortunately, most episodes show us enough of this to make the show interesting.As for Eliza Dushku, she is \"Echo\", one of the programmed \"dolls\" in the Dollhouse. As such, she's generally not a character who makes any important decisions or engages in the compelling ethical drama described above. Rather, pretty much every episode she is brainwashed and made to serve a new client. This is where the show sometimes gets bogged down into a \"client of the week\" format. While Eliza Dushku can act, her acting isn't dramatic or overwhelming enough to make every new version of her character interesting in its own right. Unfortunately, this also means she doesn't really show any character development over the course of the series - after all, she's a new person each show.Eliza Dushku and her character \"Echo\" probably take up most of the screen time in Dollhouse, which is a shame. Her story - to the extent there is one - just isn't that interesting. However, there's enough of the other material to make Dollhouse worth your while.  When watching the show, I'd recommend paying attention to what seem like the \"background\" characters more so than Eliza Dushku. Some of them, such as Amy Acker's \"Dr. Saunders\", are absolutely brilliant. In a way, to get the most out of the show, you have to shift your focus from Eliza Dushku to everybody else.Recommended - 3.5 stars.", "overall": 3.0, "summary": "it's not about Eliza Dushku", "unixReviewTime": 1366675200, "reviewTime": "04 23, 2013"}, {"reviewerID": "A1KZQ5DIX0YUE1", "asin": "B001SE07JG", "reviewerName": "Eric E. Johnson \"'ntohign slhe thaersam'\"", "helpful": [0, 0], "reviewText": "The first few episodes serve as baby steps into what becomes a thrill-ride of mystery. You can't seem to walk straight ahead into anything involving this show; the characters are constantly evolving and not always for the better. I truly think this show was a little before its time.As the show wears on, we start to see the underbelly of some great and epic beast, impossible to control once it had been given more or less free reign. The final episode, the bonus 'Epitaph' is creepy on the level of the Terminator.The acting is all above par; I was leery of a show seemingly headed by Eliza Dushku. I had never seen her give much of a performance to my tastes. But she kicks the show into a high gear, playing everything from an innocent and lost soul, to a ardent believer of God, a mercenary, sociopath, an eco-terrorist, and decisive leader, each to a magnificent level that is very plausible - not realistic of course, but just outside our realm of reach. As it has been said: \"Man's reach exceeds his grasp\". They weren't whistling Dixie on that point...The bonus features are very enjoyable, from commentaries on through a rather expected list of special feature sundries. The sound design isn't going to be winning any awards either, but then again this vehicle was designed for television. Like many of Whedon's projects, it is the characters that keep us coming back for more.The show itself gives us a freakishly deep look into what it means to be a human being. I don't think I can simply explain the show. It is beyond \"fun\", as I sometimes describe film and whatnot. This is the kind of show that challenges the viewer to take that long look at one's self. And an individual may very well not like what they see. And as serious as the show is, there is the trademarked Whedon-esque rapport. Topher, to put a name on one. Topher, no matter who plays him. And to get that reference, watch the show. I refuse to provide anything resembling a spoiler. It just wouldn't be fair.", "overall": 5.0, "summary": "Science v. Conscience", "unixReviewTime": 1312156800, "reviewTime": "08 1, 2011"}, {"reviewerID": "A2LRWMHJ1ZK36M", "asin": "B001SE07JG", "reviewerName": "e. verrillo", "helpful": [2, 3], "reviewText": "Dollhouse is what happens when networks have bad ideas, and then hire good writers to carry them out.Bad idea #1: Signing Eliza Dushku for her own show.  Face it, Dushku can't act.  The only thing she can do is be Eliza Dushku, which, to be fair, she does quite well. (But, then again, I can do me quite well.)Bad idea #2: The premise. Why would you need to wipe Eliza Dushku's brain to have her do things that other perfectly well-trained professionals could do better? And why have the same person do all these things, in public, if you need to keep the whole operation secret?Bad idea #3: High heels. We know she is short, but Dushku's heels look really out of place with a gingham dress.Bad idea #4: Treading water for 5 episodes, having Dushku do pointless, implausible things (in high heels) while Whedon figures out how the ^#@! to plug up all the plot holes before the entire cast drowns in them.Good idea! Hiring Joss Whedon, who is a bit of a genius, and is the only person who could possibly clean up this mess. (After all, he had a big hand in creating it.)Good idea! Shifting the focus away from Dushku's 6-inch stilletos and non-existent bust, and featuring actors (namely Enver Gjokaj and Alan Tudyk) who actually can act.Good idea! Season two.  It was post hoc, but it was the only way to save Whedon's eternal soul (and reputation).Three stars for three good ideas.", "overall": 3.0, "summary": "Not as good as anything else Whedon has done", "unixReviewTime": 1283731200, "reviewTime": "09 6, 2010"}, {"reviewerID": "A3ICDLUQ3V2QY2", "asin": "B001SE07JG", "reviewerName": "Kevin L. Nenstiel \"omnivore\"", "helpful": [2, 3], "reviewText": "I bet this is the kind of show actors thumb-wrestle their agents to get into: a chance to play a different role in every episode.  Subtle writing, lurking secrets, and explosive action make even jaded viewers like me hang on.  I only wish the performances were on par with the background.  Then this merely good show could be great.Deep beneath Los Angeles, a shadowy organization uses advanced tech to reprogram human beings into whatever they need to be.  Working at once to evade the law and to get immensely rich, the Dollhouse promises the moon to anybody who can afford to pay.  What they can't promise is that they can control the implications.Series principal Eliza Dushku is an odd choice on which to hang an action drama.  The role was created for her, and it plays to her strengths, letting her be essentially vacant as the camera longingly admires her body and her fighting chops.  The show operates at its peak when the camera turns its gaze on the other actors.And what a supporting cast.  Harry Lennix, Olivia Williams, and Tamoh Penikett lead an ensemble through the kind of paces that must make Equity lawyers see dollar signs, from action to romance to comedy and back.  They are capable of so much, but the camera so loves Dushku that they get far too little face time.The story benefits from Joss Whedon's distinctive humor and eye for an off-kilter story.  But not every actor is up to Whedon's particular demands.  Fran Krantz in particular wants to overplay the humor, and winds up mugging for the camera, while Miracle Laurie, so good in the dramatic and romantic scenes, sucks laughter away like a comedy Hoover.Moreover, the show's political implication, that technology's force panders to human weakness, is good but overplayed.  At various points, different characters state the series thesis explicitly, apparently because the creators think we're too thick to put the pieces together.  Considering how subtle the story is, the moral should be equally restrained.This show will likely be remembered as one of TV's great \"Almost-Was\" moments.  Like Whedon's other lost classic, Firefly, people will talk about it in wishful tones, mourning all the missed potential.  I enjoy the show's smart intensity, but it should be so much better than it ultimately proves to be.", "overall": 3.0, "summary": "Promises the Moon", "unixReviewTime": 1268611200, "reviewTime": "03 15, 2010"}, {"reviewerID": "A2EM4AZL4SQU4R", "asin": "B001SE1FAG", "reviewerName": "L. JOURNELL \"bULLETT\"", "helpful": [0, 0], "reviewText": "NO SPOILERS : this season was amazing. i accidently stumbled onto this season....i hadn't watched survivor since the third season...so i knew nothing about any of the cast. so once i caught the first episode i immediately was hooked...the entire season, J.T., Steven, The Dragon Slayer, Taj....all excellent. the games are exciting, the rewards were awesome, and seriously some of the best backstabbing ever. this season, however, also had alot of heart...i truly did love the final four....good and bad...they all deserved to be there...i watched the entire series in two days...GORGEOUS scenery, excellent editing, music on point, Probst is excellent.cannot recommend this season enough....im not ruining any surprises here....im not...but three words...FAKE IMMUNITY IDOL = BRILLIANT.", "overall": 5.0, "summary": "two day bender....ive gained ten happy pounds.", "unixReviewTime": 1384214400, "reviewTime": "11 12, 2013"}, {"reviewerID": "A34D06JL7LC6MU", "asin": "B001TNVEKC", "reviewerName": "Joshua Miller \"Josh\"", "helpful": [1, 1], "reviewText": "If I could give you only a single reason to see The Great Buck Howard it would be John Malkovich. As one of the most respected actors working today, Malkovich is probably best known for roles playing a bad guy or, at least, a very angry guy...The role of Buck Howard shows a different side of Malkovich, but it's one that is completely delightful.Colin Hanks plays Troy, who one day decides to quit law school with the intent of becoming a writer. To support himself, Troy must find a job. The opportunity comes along in the form of Buck Howard, a mentalist (\"magician is a dirty word\") who in his prime appeared on the Tonight Show with Johnny Carson 61 times. Now the Great Buck Howard plays small venues with even smaller crowds. Troy becomes Buck's assistant, quietly observing the man who doesn't seem to realize that his days of being great are behind him.It's a simple, low-budget movie that doesn't have anything profound to say but, none-the-less kept me thoroughly entertained.Emily Blunt, Ricky Jay, Steve Zahn, and Tom Hanks (as Troy's father, go figure) round out the principal cast, but despite solid performances from all; this is Malkovich's show.Yes, he's playing against type but there is a certain amount of joy I got from watching him in this role. Buck is not a multi-faceted character; we only really get a look at the stage persona. Troy knows Buck about as well as we do, but Malkovich allows us to see the passion and frustration of the character, even with it barely there. The man is an absolute marvel, truly one of the finest living actors.Is the film great though? No, it's not. It's not a character study or a laugh-out-loud comedy. It's not even very original and some of it's even predictable. However, it has enough charm and wit to warrant recommending it. Buck Howard is a great character and it is a delightful little movie. Tom Arnold's cameo is almost worth the price of a rental, by itself.The Great Buck Howard is not great, but much like the fictional Buck's show; it's disarmingly funny, charming, and very amusing.GRADE: B", "overall": 4.0, "summary": "The Great John Malkovich", "unixReviewTime": 1248998400, "reviewTime": "07 31, 2009"}, {"reviewerID": "A2U3M9LUHH9K6C", "asin": "B001UO82K0", "reviewerName": "Larissa \"lj\"", "helpful": [9, 13], "reviewText": "You'll hear the phrase \"Total Package\" so many times that you'll become immune to it.  The fact that it's being used in relation to a child doesn't seem to bother either the parents or the pageant coordinators.From the get go, it's obvious to everyone but the parents that the pageants are a scam.  Everyone \"wins\" or \"places.\"  The crowning system is some bizarre set of rules where no one really goes home a loser but where the \"Queen\" of each \"division\" is also not a winner.  There's a set of \"supreme\" crowns and a grouping of \"Ultimate\" crowns which is the \"winner\" of the entire pageant.  Oh, whatever. It sounds like a set of prizes a couple of five year olds made up.You can't really compete in a full \"Glitz\" pageant unless you have a \"cupcake\" dress,  the proper hair pieces, full make up, a fake spray on tan,  glamour and retouched photos and other accouterments but your total prize will more than likely be only $1000.  Never mind that the cost of preparing for a pageant will more than likely run you more than $5000 and lots of prep time.The pageants reward and judge on beauty as it's the only area that cannot be dropped. Beauty is finite and transitory.  The parents are both turning their children into monsters and leaving their children with no usable skills once their children's beauty ages out. The most appalling thing here is hearing the parents justify the waste of time and excuse the emphasis on \"beauty.\"Furthermore, the \"modeling\" routines these children are taught are both cartoonish and ghoulish.  It's a sick, incestuous training wherein coaches teach them the same ridiculous poses they used as children that in turn make the children look almost clownish on stage and no one stops it. The judges who I can only assume are idiots reward them for it.  I mean, who puts both their fists under their chin and shakes their head like an idiot and thinks it looks cute? Or worse, draws a heart around their face? No one and yet - every child does it.And then there's the age inappropriate clothing.  The less said here the better but these mothers really need to be hit upside the head with a large batch of common sense.And yet... you keep watching because just when you think you're going to stop watching, something worse comes along...", "overall": 2.0, "summary": "It's horrible but you can't stop watching", "unixReviewTime": 1356652800, "reviewTime": "12 28, 2012"}]