[{"reviewerID": "A4KU0XJNBH674", "asin": "B000051SEN", "reviewerName": "Army O3Guy", "helpful": [0, 0], "reviewText": "I purchased my Suunto in 2005 (not from Amazon) and wore it daily from then until 2013. It has good to combat twice, multiple airborne jumps, and EVERYTHING! I had to replace the band once during this time (loctite my friends, loctite) and the battery just a few times. I am going back to Afghanistan in a few months and considered getting another Suunto, the Core, however, the reviews seemed pretty bad so I decided to get a new battery and keep the Vector. When I was stationed with the Special Forces, this watch was an issued time piece, and EVERYONE got one who was deploying to Afghanistan back then. I wasn't deploying at that time, so I purchased mine since everyone else had one. The face is large (52mm) and a majority of the painted numbers have rubbed off, however, the watch has never failed me. I seldom use the Compass or other functions, but when I did, they where dead on. Actually, one time flying on a mission I compared my ATLI reading with the planes instruments and it was dead on. Also, when I used the Compass for radio antenna set up, it was dead on as well. Actually, when doing land navigation testing, these watches aren't allowed because you have an advantage. In all, I have considered getting other Sports watches but this one has yet to let me down. When it does, I will stick with the Suunto Vector due to the lackluster reviews of the Suunto Core. The price has gone up since 2005, in which I paid $150.00 via an eBay sale, those days are apparently long gone. I've gone swiming, and even light diving and had no issues. The alarm works well, and the computer does all the fuzzy math so you don't have to worry about shorter months, leap years, blah blah blah. A solid product. If you know someone who is in the military have them purchase it for you because they are cheaper on military bases.My only advice would be to get some loctite to reinforce the screws. You can take it to a locale jewler and they can perform this service for you, likely for free.", "overall": 5.0, "summary": "Purchased in 2005...STILL GOING STRONG!!!!", "unixReviewTime": 1372723200, "reviewTime": "07 2, 2013"}, {"reviewerID": "A1GPGBHBI6T2HJ", "asin": "B000051SEN", "reviewerName": "Jeff Edwards \"RadioJeff\"", "helpful": [6, 7], "reviewText": "To my way of thinking, there are only TWO factors which keep the Vector from receiving a full 5-stars here.  #1 is the watch face.  It is not very durable.  It isn't even glass.  It's made out of VERY easily scratched plastic.  I own several watches, and even the plain glass face models scratch at the drop of a hat, but this one takes it to a whole new level.  I'd be worried to sneeze too close for fear it may implode.#2 is the fact that despite the promises of being water resistent to 100 Meters (ie 300 feet) this watch isn't...FAR from it.  You are in danger of ruining this watch if you even enter a bathroom while someone ELSE is taking a hot shower.  The humidity alone may cause problems.  Pretty sad when a watch advertised as at the very least capable in a pool cannot honestly pull off a basic shower in a bathtub.Now, with that said, if you take care to avoid moisture whenever you can, the Vector is a fine wrist computer that works quite well in a variety of areas.  It'll tell you the temperature (under the right circumstances, of course), help you predict the weather, give you a bearing on where you need to go and then (after proper adjusting) tell you your altitude.  I found the altimeter to actually be rather accurate -- oh, and those reviews I have read on-and-off by folks bragging about telling the altitude INSIDE of a pressurized passenger plane are BOGUS.Considering what this watch can do, and it's limitations, I believe that the price is a bit high (you can buy a Casio watch that'll do the same thing--and is solar-powered, AND is REALLY water-resistent, all for LESS) but the Vector has one thing that not all Suunto watches, or altimeter/barometer/compass watches come with: that little bubble on the face which allows a more accurate determination of specific readings.  If Casio add's one to their model, I'll probably become a full-time convert.  If you are looking for something similar, but smaller, try looking at the Suunto Observer.  It's a dang-good-looking watch, but the price is considerably more, so that may be a rather important factor for you (I know it is for me).All in all, Suunto makes great products, but water resistent models are unfortunately NOT one of them (unless you are going for one of their products that actually are designed for underwater use).", "overall": 4.0, "summary": "Great watch that, despite promises, is NOT waterproof to 100m.", "unixReviewTime": 1175558400, "reviewTime": "04 3, 2007"}, {"reviewerID": "A1JJIRGZGBKT6A", "asin": "B000051SEP", "reviewerName": "Carl Cloer \"Cscape\"", "helpful": [0, 0], "reviewText": "I expected a lot more from a &#34;wrist computer&#34; selling for almost 250.00, and the Military version for $300. First of all the visibility of the display is much too dark.  The images of the X-Lander on the Amazon and Suunto websites have been enhanced to the point that a case could be made for false advertising.  Secondly, the instructions to set the numeric values (meters vs feet, etc.) aren't even covered in the instructions that come with the watch, you have to download the full set of instructions to figure that out, then some of the fields used to set the values are so small and located in such bizarre locations, that even with 20/20 vision, I had to use an illuminated magnifying glass to see, then set the values.  Thirdly, the backlight feature is useless in low light or bright daylight.  It is only good for pitch black darkness...much too dim, but is probably the same as their military version, which has to be at a low level to keep the wearer from getting shot!  Fourth, (probably for the same reason) the alarm is not loud enough, especially if you are wearing the X-Lander under a couple of layers of clothing.  As others have stated, it should not be counted upon as a means to wake you from sleep.  Fifth, the barometric trend indicator is totally unreadable...too small and too dim to see under normal circumstances unless you also happen to be carrying a small foldout magnifying glass (which, as it turns out, I do carry while trekking).  Finally, the feature navigation is not intuitive, meaning if you do not use the features and sub-features regularly, good luck with remembering how some of the functions are accessed, and turned on and off, unless you carry the instructions on your person.I am going to keep this &#34;wrist computer&#34; for trekking, but it will not be the watch on my wrist for everyday casual use.  That honor will still go to my Wenger Military.  Because of that, there should be a way to shut off the X-Lander (short of removing the battery) so the battery does not run down while it's in the safe...still hoping to find out how to do that...doesn't have a stem to pull out like a watch.I can not recommend the X-Lander.  It is feature-rich, fairly compact and lightweight,  but the issues above make it less than desirable and overpriced.  The Finns need to address these issues before I buy another Suunto &#34;wrist computer&#34;.", "overall": 2.0, "summary": "Disappointed", "unixReviewTime": 1400371200, "reviewTime": "05 18, 2014"}, {"reviewerID": "A2G4MGVWR20OOI", "asin": "B000051SEP", "reviewerName": "D. Brown", "helpful": [0, 0], "reviewText": "I've had this watch for several years now and it still holds up. It is a little pricier than some of the competition from Casio and Timex. However, it offers some nice advantages over most others, with only a couple drawbacks. I wore mine for two tours in Iraq and it performed perfectly. Not that I truly ever relied on the Comp-Baro-Alti features, because we always had other more advanced devices for that. But it was reassuring to have those capabilities on my wrist at all times. And the basic time, stopwatch, alarm and timer functions were used often and performed well.Pros:User replaceable battery - very helpful in the field and easy to do, saves money.Broad array of functions - easy to manipulate the various features with a little practice and reading the manual.Very accurate - the watch loses very little time over the months and years, good quartz movement.Good water resistance - not a dive watch, but it holds up well, even under several meters of water, which I've done.Comfortable despite its large size - pretty light weight and a large, comfortable band.Easy to read - large face, big numbers.Attractive design - very distinct look.Cons:Not solar-atomic (like Casio Pathfinder) - however, battery is easily replaced and the quartz movement is very accurate.Thicker case - more so than the Casio PAW1300, but not too bad.Bottonology - the button function layout is different than most Timex and Casios, but isn't too hard to figure out.Price - higher than many, but not excessive for what you get.Overall, despite the drawbacks referenced above, I highly recommend the Suunto X-Lander and I would assume the other Suunto models are also good. Serves me well.", "overall": 5.0, "summary": "Among the Greatest Multi-Function Watches", "unixReviewTime": 1397865600, "reviewTime": "04 19, 2014"}, {"reviewerID": "A1H4R7TY2G50DH", "asin": "B00006XXGO", "reviewerName": "Max Power \"Max Power\"", "helpful": [0, 0], "reviewText": "These have been a staple in America for decades. They are sturdy canvas that wears extremely well over time. The soles are rubber and glued. After extreme wear, some parts that are glued can get loosened. Shoe goo can be used to make most if not all repairs on these. So they can last longer than nearly any shoe. They make them exactly like they did decades ago, with the same quality, with one caveat, Converse, the iconic American shoes, are now made in China. This may or may not matter to you. It does matter to me, due to labor practices, and environmental standards, which is why I typically buy New Balance shoes, still made in the USA as of 2013. I've worn made in USA converse in the past, but never the new China-made ones. On arrival I couldn't tell any difference in the shoe itself, just as sturdy as ever.On a side note: This particular style is pretty trendy among celebrities. My wife saw this color/style on some female singer and had to have them. Lots of female celebrities buy these \"male\" high-tops. Which I find interesting, it doesn't look bad at all, but it definitely screams trendiness to me. You can google \"celebrity Converse\" to find pictures of the myriad of celebs who don Converse. If you do or do not want to be trendy, is your call, but these are definitely being revived in current \"pop culture\". To my wife, that is great, emulating her favorite artist, to me, I wouldn't be caught dead in them due to that reason alone. Although I thought about buying a matching pair just to confuse her, and be \"that\" weird matching couple, since pop culture has made them unisex lol.Hope that helps!", "overall": 5.0, "summary": "Long lasting", "unixReviewTime": 1377734400, "reviewTime": "08 29, 2013"}, {"reviewerID": "A58RQ97D4N1QP", "asin": "B0000722HK", "reviewerName": "Hotswimmer", "helpful": [2, 2], "reviewText": "I am a huge fan of Under Armour's workout apparel, and in addition to owning two of these Heat Gear Compression Shirts, also own several each of Under Armour's Tech T-shirts (0382) and the Loose Gear shirts (0084) - I've written reviews on those as well.Ok, let's get this right out front - this is a serious athletic shirt. It isn't for everybody. It's tight - a compression fit, the equivalent of wearing a pair of running tights, but on your upper body. Not everyone likes or is comfortable with this fit, and not everyone looks good in it.Having said all that, it's a high-quality, great-performing shirt. It provides a lot of muscle support, and wicks sweat from your body to keep you dry. As I said, not everyone will like the fit, especially at first, but the feeling does grow on you after a few wearings. Athletes in competitive team sports - football, hockey, etc. are probably a lot more used to the feeling and will definitely appreciate this shirt.The fact that you don't have a perfect body needn't intimidate you if you want to wear a shirt that provides a lot of support, regardless of what sport or workout you are into. In fact, if you're just a little bit soft, it does a nice job of pulling everything into place and holding it there - you might even be surprised how good it looks. You can always wear another shirt over it if you're self-conscious, just don't like how it looks on you, or haven't quite burned off enough fat yet. If you have a good physique, what can I say - you're going to look hot in this shirt. In fact, it's not unusual to see younger guys wearing it as a club shirt.I would not buy this shirt without trying it on first. I usually wear a size XL in the other, looser Under Armour shirts, but had to size up to XXL to be comfortable in these. They tend to ride up on the bottom or bunch up under the arms if you buy them too tight. I love this shirt in black, but there's a full palette of colors from which you can choose.The shirt requires a little more care - you can't just toss it in with the rest of the laundry. UA recommends hand-washing and drying on low heat, and people not willing to take the extra care have reported problems with the logos peeling off. I've not had this problem with any other UA shirts in the line-up, even when machine-washing in warm water and drying them in the dryer on low heat, but it may have something to do with the fabric in this particular shirt and how much it has to stretch (a lot!). Either way, I haven't taken any chances.", "overall": 5.0, "summary": "A Great Workout Shirt", "unixReviewTime": 1171324800, "reviewTime": "02 13, 2007"}, {"reviewerID": "A3CLWKX8RBR56V", "asin": "B000074RL3", "reviewerName": "J. Red Tripp \"Triathlete\"", "helpful": [192, 194], "reviewText": "I love this bra.  I am a competitive, thin, fit 44 yo with 34F busts so over the years certain body parts have moved a bit southward and there is a lot of postential for jiggling to outright flopping.  In this Enell Sport Bra I can run and jump with no unwanted movement.  It is a compreesion bra, so you are going to have a mono-boob, but it is the only bra I can run in that does the job without chafing.  And when I am working out hard I'm a make-upless, hair-puled-back, sweaty mess, so what do I care if I have one compressed motionless boob?Most of the negative reviews of this bra are folks who couldn't get into it, so I figured I wuld tell you the easiest way:1. First put your arms through the arm holes as though you were putting on a vest.2. Leave your boobs where they are: if they are down by your lower rib cage, your belly button or tucked into your waistband, just leave there.3. Grasp your Enell Sports Bra by the bottom two front clasps and lift up (vertically) so you are NOT pulling it across your boobs, but over the top of your boobs across your chest at arm pit height.4. Hook the bottom to clasps so that the bra is closed at the bottom but contains no boobs.5. Using your right hand, go through the inside of the bra and scoop up your left boob and pull it ino the bra.  Do the same with your left hand, right boob.6. Arrange your boobs so they are comfortable and facing the same direction, then easiely hook the rest of the clasps from the bottom up.Ta-Da!I will say this is a LOT of bra. If you are a cup size C or smaller this may not be the bra for you.  If you do not do a lot of high impact movements (running, jumping, karate, burpees, pogo-sticking) you probably do not need a bra this sturdy.  For example, I do not need to wear my Enell when I am weight training or biking.  However, if you are an older lady who maybe has had a couple of kids and gravity has done its thing, this may be the bra for you; or if you are a younger gal who is well endowed and have seen your mother naked and don't want the same fate to befall you, then you may want to wear a Enell to ward off the horrors of gravity for as long as possible.", "overall": 5.0, "summary": "How to get into your Enell Sports Bra", "unixReviewTime": 1356393600, "reviewTime": "12 25, 2012"}, {"reviewerID": "ASU2T2KJ6N8V4", "asin": "B000074RL3", "reviewerName": "Michelle", "helpful": [6, 7], "reviewText": "I had a hard time choosing between the size 2 and 3. (42 bust and 37 rib cage)  The 3 seemed like the best fit for the rib cage, but I thought I'd need a 2 to really compress everything.  I'm glad I went with the 3, because if it were any tighter, and it would probably hurt my rib cage.  As it is, it seems just right.When I first put it on, I thought it wouldn't control bounce enough because it felt just a tad roomy in the top part, but it works!  There's still some movement, but it doesn't hurt at all, and I don't feel like the breath is being squeezed out of me.  In fact, I hardly feel constricted at all, other than in the band around my rib cage, and that part isn't uncomfortable at all. The top and bottom control panels do exactly what the video says--they minimize bounce. I did several jumping jacks without a problem.  It's really  hard to believe that it can do that without being squished too much.It does make you look a little like you're wearing body armor, and under a shirt it definitely doesn't look like you're wearing a normal bra.  But I think it looks fine. It just flattens you, and depending on the fabric you're wearing you can sometimes see the seam between the top part of the bra and the bottom support.  Turbo Kick and the elliptical trainer aren't places to have fashion shows, anyway, though, so I'm definitely keeping mine.Shipper, OneSweetOne, was also fast.  I ordered on a Wednesday, got it on a Tuesday--one day earlier than indicated.UPDATE Jan 31st 2012. I wore my bra to a hip-hop aerobics class and it worked great!  We did a lot of jumping around and bouncing, and I enjoyed it more than I've enjoyed aerobics or dancing in YEARS.  I think there's still a shifting movement in the bra, but I honestly don't notice it since it's not impeding my workout. I feel like I have better balance and control as I move.", "overall": 5.0, "summary": "Works just the way it's supposed to", "unixReviewTime": 1326758400, "reviewTime": "01 17, 2012"}, {"reviewerID": "A1RJUXDK64O91A", "asin": "B000074RL3", "reviewerName": "Sandy P \"saprater\"", "helpful": [1, 1], "reviewText": "I've always had a pretty full bust. I remember walking at the track with a friend and trying to jog a bit during the straight stretches...only to have her comment that I really needed to wear a sportsbra to minimize all the bounce. She was shocked when I told her that I actually had two on. Since a pretty dramatic weight gain, the bounce has gotten worse. When I found out my job was sponsoring free zumba classes, I couldn't wait to enroll but felt self-conscious...plus jumping around without good support is very uncomfortable. So when I saw the Enell bra featured on a plus sized fashion blog (with rave reviews), I went ahead and splurged. I have to say that I'm very pleased. The bra compresses but it also provides a lot of lift from below. I feel supported AND lifted instead of just getting squash-chest like the other bras out there. And for the first time since I hit puberty I was able to go for a light jog without feeling like I was pulling a pectoral muscle. Also, because of the unique satin-like material (versus the traditional all-cotton sportsbras), my shirts don't ride up or get stuck on my chest like velcro.Still, I couldn't quite give it a perfect 5-star rating. For one thing, I'm still getting a little bit of a uni-boob. The band fits perfect but the cup size seems a tad small, but I don't want to go up a size and risk not getting a good fit around...speaking of which, it is a bit of an non-traditional fit. The shoulder straps are pretty short and sort of has the bra hiked up in the back...really high. Also, the price makes this a luxury item. I don't know if I will ever own more than one at a time, especially if my weight loss is successful and I go down a size or so. I just hope this bra holds up well with frequent washing.", "overall": 4.0, "summary": "Jogged for the first time ever", "unixReviewTime": 1346025600, "reviewTime": "08 27, 2012"}, {"reviewerID": "A2DMQ5BYVYAFGV", "asin": "B000078CYM", "reviewerName": "Smart Shopper", "helpful": [0, 0], "reviewText": "This is a review of the Crimson color distressed nylon bag, extra small.I have major back problems and chronic pain, and went on a search for a lighter everyday bag. This is perfect. I work in a casual office and can carry this everywhere without worry that it won't be suitable. I have a smaller clutch that I use for occasions that call for more formal attire.While not one of those women who carries around everything but the kitchen sink, I am still amazed at how much I can fit into this bag. Everything that was in my regular purse fits in here, with room to spare. What's more, this bag is noticeably lighter than my purse, which is precisely what I needI agree with other reviewers that the inner water bottle holder is small. However, it does a great job of holding my sunglasses, which is more useful to me for daily use.The only negative is the small, narrow size of the two outer pockets. I love the magnetic closures, but the so-called cell phone pocket is too small for my iPhone with Otterbox case. Instead, I use it for my little pill container. I haven't put anything in the smaller side pocket; seems to small for most things.Other reviewers have rightly pointed out that this is NOT the classic bag, no matter what the advertisement says. It's the newer HBB-evo bag. That doesn't bother me, but it may bother someone else, so I think it's worth mentioning. If you look closely at the picture of the crimson bag, it shows only one flap pocket on the side. There are actually two.I guess I'm so impressed with the overall weight and function of this bag that the outer flap pocket design is really not a big deal. For an organized person like me who strongly believes there should be a place for everything and that everything should be in its place, this is almost perfect.", "overall": 5.0, "summary": "Great alternative to everyday purse", "unixReviewTime": 1404259200, "reviewTime": "07 2, 2014"}, {"reviewerID": "A1J96SUX3VFV5R", "asin": "B00007GD9I", "reviewerName": "Colleen Larsen", "helpful": [0, 0], "reviewText": "I have had my wallet,card/ck book holder/attached coin purse for about 7 years. It is perfect for me. When my Mom saw it she loved it so of course I bought her one as a gift and she loved it. Then about 3 yrs ago her wallet was lost/stolen and she bought herself a different wallet that she didn't really like. Anyway, we all Prayed her wallet would be returned and 8 months later somebody put in in her mailbox!!!! Of course the $ was gone but her personal things were in tack.. Today she said she was looking for a new wallet because hers was a little shabby looking (mine is fine because I do 90% of my shopping \"on-line\" with Amazon. (no wear and tear shopping on line) My Mom said she looked in a few stores and wanted a wallet w/ the change purse attached and hasn't found one yet. Well of course I went on Amazon typed in buxton wallets and in 30 seconds I found our wallet. I called my Mom and just asked what color she wanted.. She said black would be just fine again.. I have just started my Christmas shopping!! Since my Mom doesn't ask for anything it's hard to buy something I know she would like AND use. So, thank you for still having this wallet on the market. I am going to fill up the credit card slots w/ store gift cards for Her. So a $21.00 plus gift turns into a $220.00 when it's opened. I also ordered the key chain/store scan card holder for her. (Mom doesn't keep her scan cards on her key chain so I think she might like it--I ordered it in red so its easy to find) I may just order myself another wallet just to save in case its discontinued... Great organizer/wallet...", "overall": 5.0, "summary": "Perfect wallet !!!!!!!!!!!", "unixReviewTime": 1379808000, "reviewTime": "09 22, 2013"}, {"reviewerID": "A1B7XXNR5DL4TR", "asin": "B0000868O9", "reviewerName": "Cindy T.", "helpful": [0, 0], "reviewText": "I've purchased this bra for many years. It is never my only purchase. I use this bra for specific purpose in specific garments when I was to have a true shelf type bra that hold your breasts up and out. Wearing blouses or dressed, or even casual tank tops, can make the breasts look droopy and thereby making you stomach area look thicker, and your torso shorter.  With this bra, the band does most of the work holding up the breasts so that the stress is not felt exclusively at the shoulder straps. No the straps are no elastic and it isn't due to being cheap. the do the job of holding the breasts in perfect place and they have soft fabric under the strap which makes them very comfortable. The only discomfort you should feel is you choose the wrong size because they don't have a lot of &#34;give.&#34; They wear like iron and look great through many washes. I recommend never putting any bra through a dryer, nor using any fabric softener or high sudsing detergents that destroy the elastic. (sulfates causes sudsing) Try Charlie's Soap. You can purchase it through Earth Fare.  You will never regret it and it keeps the washer clean as a whistle, even the moving parts. What I also like about this bra is that there is no side breast because of the wonderful &#34;stays&#34; on either side of the bra. These push you side tissues towards the front. Just own it and throw your shoulders back and look great even if you aren't used to looking so good. You will be glad not to bounce all around if that is an issue for you i other bras. Don't let the less expensive price break distract you from getting this bra.  Inexpensive doesn't mean it is &#34;cheaply made.&#34; Remember to lean fully forward while making the connections so you distribute tissue. Enjoy this purchase. Cindy T. God Bless", "overall": 5.0, "summary": "For an architectural bra this is a Frank Lloyd Wright type construction. Ha!", "unixReviewTime": 1389052800, "reviewTime": "01 7, 2014"}, {"reviewerID": "A3AOUGVJ8R8AIS", "asin": "B0000868O9", "reviewerName": "Randi", "helpful": [2, 2], "reviewText": "Since I had a need for one, my bras have always come from a certain popular lingerie chain. Mesmerized by their bust boosting miracle bras and fabulous looking models, I really never thought of straying. Problem was, their bras didn't fit me well, and definitely didn't provide me with the shape I desired. Their molded bras made me look saggy and lumpy, albeit bigger, but certainly not flattering. Plus, I was paying $40 to look this way, so I began to look for other options.Enter the Bali Flower Bra.....  excellent support for my small bust and a more natural and feminine shape. No longer do I have one single rounded lump for a bust line, but two shapely, lifted and separated breasts! Best &#34;perk&#34; of this bra, a slimmer looking figure. Turns out proper support really smooths things out and emphasizes the waist line... can't argue with that!!Now, at that other bra place, I generally wear a 34A but since that was not an option, I opted for a 32B and I'm glad I did. The tighter band is actually very comfortable and the cup is absolutely perfect (for once, with a little manipulation, I actually fully fill the cups!).Now, if you're a fan of the rounded molded cups, stretchy straps and a seamless appearance, this might not be the bra for you. But if you're looking for a classic, slightly more conical look, and solid support, this bra is perfect. For those who, like me, enjoy wearing vintage clothing, look no further this is the 40s or (less severe) 50s silhouette you are looking for.Finally, the lace. It's pretty, this is a pretty bra, but should you try it on straight out of the package and determine that it's a good fit but far too itchy, wash it once or twice--- you might change your mind.Very happy to find this bra, I certainly will be buying more.", "overall": 5.0, "summary": "Exactly What I've Been Looking For", "unixReviewTime": 1394150400, "reviewTime": "03 7, 2014"}, {"reviewerID": "A2ZY49IDE6TY5I", "asin": "B00008KH9C", "reviewerName": "Crabigail Cassidy \"Crabby Abby\"", "helpful": [6, 6], "reviewText": "I'm a reformed chubster so I'm still packing flab galore. I bought this to wear with a semi-fitted dress and shrug. Not exactly revealing, but I felt I needed the protection. Looked fine and liked the way this felt. It was not confining or uncomfortable. Did a good job and I felt confident.Yesterday it was frigid so I decided to use this as an extra layer under my jeggings that are fitted. I wasn't thinking in regard to hiding anything. I just wanted to stay warm. Anyway, when I put the jeggings on I thought they seemed baggy or loose. They've always felt fitted. When I met my friend for lunch she asked me if I was still losing weight because my pants were loose fitting. Ditto for my husband.Spanx work, but darn if I can explain it. They go on easily. While they are fitted to conform to the body they don't feel tight. They are comfortable enough that I forget I'm wearing them.I ordered a medium and since I normally wear an 8 or 10 they are true to size. I have friends who wear plus sizes and tell me the size they wear are consistent with the garment sizes they normally wear.I either hand wash or wash on a gentle cycle using Woolite and air dry. Just went out and bought two more pairs in tan and black. Can't put a price tag on confidence.", "overall": 5.0, "summary": "I Was Clueless", "unixReviewTime": 1326499200, "reviewTime": "01 14, 2012"}, {"reviewerID": "A275EOYAIDKYAU", "asin": "B00009R881", "reviewerName": "Jimh615", "helpful": [7, 11], "reviewText": "3 Stars for a beautiful bag.  It is exactly what I wanted. However, I thought the partitians would be fully adjustable...they are not.  The only interior layout this bag has is a four-part partition quadrant held in place by velcro. If you remove the partition, it's just an empty space with no partitians.The quadrant partitian is moveable left and right from extreme side to side.  However, the partitians inside the quadrant itself are not adjustable.  You cannot adjust the sizes of the four partitians inside this moveable quadrant which is the only partitian system in this bag.I could not fit my Canon EF 100-400 L IS into any of the equally sized partitians inside the quadrant.  I could have moved the quadrant all the way to one side, but then the slot would have been too large for the lens and would have left no place for my Canon 30D.  The fixed partitian quadrant takes up over 2/3rds of the interior of the bag.Taking the quadrant partitian out, leaves you an empty cavity necessitating using the cases your lens came in....unless you're ok with them just rattling around in there.If you have small, thin lenses...this might work.....but there is no customizing of the interior partitian arrangement.If this bag had moveable, individually adjustable partitian panels, it would be wonderful.  With only one non-adjusting quadrant....it was not acceptable.A very minor point:  I didn't like the clips on the front holding the top flap down, two of them, are very small.  The clips need to be updated with either larger ones or the plastic type used by many bag manufacturers.....retro is nice, but a little updating is also good.Thank you Amazon for standing behind your sales; I returned the bag.", "overall": 3.0, "summary": "Not very Versatile", "unixReviewTime": 1213056000, "reviewTime": "06 10, 2008"}, {"reviewerID": "AFICF7DKHTQ87", "asin": "B00009R881", "reviewerName": "tabby", "helpful": [4, 4], "reviewText": "I've got this bag 2 months back. It currently fits a Nikon d300, 17-55, 70-200, Sigma 10-20, Nikon 50mm f1.8, sb400, extra battery, couple lens filters.Pros:-construction. This bag is built very well. Material used seems of high quality, and the stitching is excellent. I really like the straps mechanism, as they feel very secure. The main strap also has some kind of rubbery strips on them, which helps keep the strap from sliding off your shoulder (and have your thousands of dollars come crashing on the ground)There is also a smaller hand strap, as opposed to the main sling strap, which is very convenient for helping you precisely lift the bag and place it, which I really like)-discreetness. This bag doesn't look like a typical photography bag, but rather just a standard sling bag. Makes me more comfortable when carrying it though airports, or places that I am not familiar with.-comfort. This bag is very comfortable to carry, even fully loaded, for hours. Because of the canvas nature of the bag, it molds to your body (assuming you pick it right), which makes it feel more secure at your side.Cons.-padding. This bag does not have too much padding, (it comes with a 4 compartment padding sleeve, which i have converted to a 2+1+1 padding sleeve, to fit my 70-200 lying at an angle), and no padding at all on the top. I think the padding is adequate, but probably could be improved.-price. Compared to other equivalent photo bags, this bag seems a little pricey.-weather proofing. This bag does not come with a waterproof cover, though, from what I read from other review, it is pretty waterproof, however, in pouring rain, I'm pretty sure that it will drench through. (not quire sure what you would be doing in pouring rain with your equipment). This can be fixed by packing a large garbage bag with you all the time, tacky but works.All in all, this is a very nice photographer's bag. Highly recommended.", "overall": 5.0, "summary": "ramblines from a DSLR newbie...", "unixReviewTime": 1202515200, "reviewTime": "02 9, 2008"}, {"reviewerID": "A1X3JBFQ5H2RBH", "asin": "B00009WM7J", "reviewerName": "Jenn Reedy \"Jenn Reedy~\"", "helpful": [0, 0], "reviewText": "My 10yr old Daughter has hard to fit feet, to say the least! We have always gotten her good shoes usually fitted at Jamiel's or other high end stores. 99% of the time, we get her shoes, sneakers or boots, she wears them 1-2x's & complains about the fit! I'd  about had it & was thinking  it would cost less to move to a tropical climate & let her run barefoot!!!! So far AMAZON has been a lifesaver ( hers anyway!)  I bought NB wide $40 sneakers & she LOVES them, wearing them consistently  3-4 times a week. Snow came & we had problems...... Uggs are her fav pair yet they aren't for snow & rain :( so the hunt was on! Cheap ones, wide, xtra wide, expensive ones, ones we'd never heard of- ALL didn't fit...then, looking thru the WIDE width section of girls shoes on here- I found THESE. Now I had tried a different brand of work boots & they fit terrible & were made even worse, so I worried. I waited days, looked again, 1left in her size 5.5 wide! I grabbed em' , I was desperate!  They came today- I was shaking, she was scared yet another wouldn't fit... Well Dear Lord she put them on & ran around the house smiling & yelling &#34;I LOVE EM' &#34;!!  She has a EE width, yet these in just wide fit perfect! I am now looking to buy stock in the company , as I will be buying soooo many pairs in various sizes! THANK YOU Timberland & Amazon!  Made well, soft leather & the sole is flexible. A great boot-", "overall": 5.0, "summary": "One of the BEST shoes she has ever had!!", "unixReviewTime": 1359331200, "reviewTime": "01 28, 2013"}, {"reviewerID": "AXF514L0AH99G", "asin": "B0000ANDEI", "reviewerName": "Wyatt", "helpful": [2, 2], "reviewText": "I grew up on a farm (and am now 38), and still consider myself a farm kid. But back then, I grew up on a small farm and we didn't have enough money to buy good stuff like Carhartt jackets for us kids who grew out of them every year! I've kind of always wanted one, and finally got sick of Columbia jackets with fleece lining that fills me with static or other jackets that just don't last. So I researched and bought this one.Many of the reviews claim that it's warm enough to wear outside as your sole jacket during winter. This winter (2013) in Fargo has been nasty cold so far, with multiple days with 0 degrees F or lower as a daily high! Most of these cold days, I am wearing a sweater under this, and it does the trick for me going from vehicle to building and back, while keeping me comfortable while driving. I've also worn it for longer periods of time outside when it's cold and windy, with a sweatshirt under it, and it has performed very well. It cuts the wind better than I expected, so as long as you have a warmer layer under it, it really is warm enough.I am 6'3\" tall, and about 190 pounds. I also have trouble finding jackets with long enough sleeves. I bought the Medium, Long, and it fits me perfectly!! This is the part I'm happiest about. Even with a sweatshirt under it, it's still big enough.It has lots of pockets. Another important thing for me is enough pockets to carry my wallet, cell phone, and sunglasses. It has 2 large inner chest pockets (one with a velcro top, another with a zipper), and I keep my wallet in the velcro one. It also has 2 outer chest pockets, and I keep my smart phone in one of those, easily accessible, easy to hear if it rings.I am very happy with this jacket, and am looking forward to having it last me multiple Fargo winters!Edited 12/30/13:Just spent an hour and a half tailgating for a football game, at -5 degrees F. I wore a long sleeved dry-fit shirt, a sweatshirt, a jersey, and this jacket, and felt perfectly dressed. I was concerned about spending this much time outside at that temperature with this jacket, but again, with the right layers, it cut the wind nicely, and did the job as expected!", "overall": 5.0, "summary": "Works for me in Fargo, ND...with layers", "unixReviewTime": 1387929600, "reviewTime": "12 25, 2013"}, {"reviewerID": "A1EJ6J6N9I7W35", "asin": "B0000ANHST", "reviewerName": "Billy Hollis", "helpful": [0, 0], "reviewText": "I like Carhartt in general, and in fact it's my favorite brand of jeans. But this shirt was a disappointment.It was so scratchy when I opened it that I couldn't stand to wear it. I thought it might be from leftover sizing in the fabric, but it didn't get any better after washing. I even tried the \"soak in brine\" technique, which softened it a bit, but it's still scratchier than my other t-shirts. Four washings so far, and it's still scratchy, though it is getting a little better with each washing.I have other pocket t-shirts of comparable thickness from American Giant and Key. Both are much softer and more pleasant to wear than this one, even right out of the package.On the pro side, the fabric is thick, and the size is good. I've gotten medium t-shirts from department stores that shrank to uselessness after a few washings, but this one kept its size pretty well. I also like the color (I got Sand). If only it were more comfortable to wear.*** Update 6 August 2013 ***Nine washings now, and the problem is no better than after the fourth or fifth washing. It still feels prickly the moment I put it on, unlike any of my other t-shirts, including cheap department store ones.I looked at the fabric and it has a fair amount of pilling on the inside of the shirt. So it's pretty clear that the scratchiness is not going to get better. I'm ready to put this one in the grunge clothes bin. I'm guessing it was just a bad batch of cloth.They probably make these shirts in various locations. For reference, mine was made in the Dominican Republic.", "overall": 3.0, "summary": "Did I get a bad batch? Cotton was coarse and scratchy, even after multiple washings", "unixReviewTime": 1374278400, "reviewTime": "07 20, 2013"}, {"reviewerID": "A3QSZ2SE3HUSXM", "asin": "B0000ASFQL", "reviewerName": "bluezman714", "helpful": [0, 0], "reviewText": "I ordered a 40x32. I should've ordered a 40x30, but that was my error. Subzero temps are comfortable with these on. I wear a pair of jeans under them. I'm 5'10\" and weigh 170 lbs. I washed them twice and the length did shrink about an inch but I have to wear boots with them or they will drag onto the ground at the bottom/back of the legs. These are well worth the price. Being my first Bibs, I expect to buy a new one yearly, but in a size 40x30.Update:Now that spring is here, these bibs are great and worked perfectly! They are must have in Colorado. When washing them, follow the instructions!I recommend going to your local Carhartt store (Sears?) and trying a pair on to get your sizing perfect. Even if they don't have the lined bibs, they will have the unlined and it's so important you get the length of your bibs right or you will ruin them as they rub on the ground.Next Fall I will buy the unlined version in a different color and may get a size of 38x28. The reasoning for the 38 instead of the 40 is that the lined pair are thick and at times with jeans on underneath, it did get toasty.I've been to my local Sears and have tried on the unlined version which are $30 cheaper, but I could see that as long as I had jeans on underneath and maybe thermals under the jeans, the unlined will be just as comfortable. Obviously you want to buy them on Amazon!The length in the next pair will definitely be a 30\" length (instead of the 32 I bought)or maybe even a 28\" length, because they adjust in length at the suspenders.So UNDERSTAND this fact: When they say they are a 30\" in length, keep in mind that's the shortest length they adjust to. So my 32\" in length bibs I bought are 32\" at the shortest length possible and they will actually adjust (at the suspenders) 3-4\" longer than the length stated!!!!", "overall": 5.0, "summary": "Great", "unixReviewTime": 1387238400, "reviewTime": "12 17, 2013"}, {"reviewerID": "AMW2I30QL5L93", "asin": "B0000AT7N2", "reviewerName": "Star", "helpful": [0, 0], "reviewText": "I bought one pair of these for my husband to see if he liked them. When I saw the quality and heard him talk about the comfort, I immediately ordered another pair.....should have ordered a couple more AND I WILL! I usually order Levi's relaxed but these seem to last so much longer and have the extra room men always want in certain areas (said that as nicely as I could). Now, after washing a couple times, I will no longer purchase those other jeans which are very weak in the pockets/crotch area and seem to tear easily. These Carhartt jeans are amazing! My husband really loves the comfort. I'd recommend them for work, as well as, dress jeans. Very handsome! You get much more quality with Carhartt and pay less. You can't beat that!UPDATED: May 15, 2014 The last jeans I purchased were washed three times and have torn on all corners of the back pockets. I should not have been so quick to give such a great review since the one pair held up pretty good. In looking at them again, the pocket corners are all thin and fraying/tearing ONE MONTH LATER. I use a light laundry detergent and don't leave them in the washer so it can't be that. I guess I will have to continue my search for those sturdy work jeans. If anyone has suggestions, please let me know. Thank you!UPDATED:June 21, 2014 THESE JEANS SUCK! I am returning all three pairs I bought to Carhardt. The entire seat of these jeans finally just ripped two months and just a few washes later. I have already patched all three pairs twice. The material is very, very cheap!", "overall": 1.0, "summary": "UPDATED: Already tearing in the pocket corners one month later.", "unixReviewTime": 1396569600, "reviewTime": "04 4, 2014"}, {"reviewerID": "A1SQ4E255QMI8S", "asin": "B0000ATP8L", "reviewerName": "Bruce Wolf", "helpful": [0, 0], "reviewText": "I purchased these shoes to replace a very well used similar pair of walking shoes. I loved the old ones. Unfortunately, the quality is not as good as in the past. The sizing leaves a lot to be desired. As suggested by some other reviewers, I ordered the shoes  size larger than I had in the past. The length was OK, but the \"medium\" width is more wide. I also ordered a pair of Rockport sport shoes. They were size 11, but barely. The width was just OK. I will order shoes again, but will not be surprised if they need to be returned for poor size quality control.6month follow up:  I have been wearing these a lot. The more I wear them, the more pain I get. Went to a real shoe store and was shown that the front lateral side of the shoe tapers more narrowly starting near the base of my little toe. The more I walk, especially with orthotics, the more the side of my foot is compressed. Not good. This was not present on previous shoes. I bought a pair of SAS shoes that do not taper. Much, much better. I have worn Rockports for over 20 years. This latest pair don't make it. Lift the sole cover on the inside. Could it be cardboard? This may be the last pair of Rockports that I buy.", "overall": 1.0, "summary": "decent walking shoes, but not as good as in past", "unixReviewTime": 1386288000, "reviewTime": "12 6, 2013"}, {"reviewerID": "A1RODQFI08SIJQ", "asin": "B0000ATP8L", "reviewerName": "Sushrut Patel", "helpful": [17, 21], "reviewText": "I bought this shoe(9.5 W, chocolate nu buck) because of glowing tributes on this and other sites. The shoe felt great on trying it on initially. I agree with other reviewers that the supplied thin PU insole is laughably thin, and non supportive, creating a false aura of roominess and comfort which does not stand up to(pun intended) prolonged non-recumbency. It DOES NOT have the ADIPRENE insoles that most other Rockports do. The unusually THICK TONGUE covers most of the dorsum (Top) of the foot....and competes for room...you have to open up the laces wide to accommodate it, or your arch top will start hurting. I tried a comfort insole, but it left little room for my toes. I banished the shoe to the back of my rack. Recently(after 3 months), I revisited the shoe, and remembered my previous travails. I trashed the insole first. Then I progressively stuffed paper napkins into the toe and ball area, leaving it overnight for a few days, to stretch it. Finally I equipped it with a my favorite spenco insoleSpenco Polysorb Cross Trainer, Women's 9-10 / Men's 8-9. So, after a few days of foot & heartache, and a few hours daily D&C; (dilatation and curettage), the shoe is very usable and comfortable for my 12-18 hour duties as a physician. In the mean time, I discovered and am using a pair ofClarks Men's Wave.Tract Lace Upwhich are very comfortable and supportive without any modifications for my purpose of prolonged walking and standing.Addendum: some musings after 18 months of occasional use: 1/6/1014,I have worn this shoe about 50-60 times, and they look and feel great. It has a wide flat platform, and is great/stable for standing, but not as good as some other more modern designs for prolonged walking. The nubuck leather (color is more medium tan rather than chocolate as advertised) has maintained its finish, thanks in part to initial treatment withKiwi Suede and Nubuck Protector, 4.25 ozand occasional use ofKiwi Suede Nubuck CleanerI reach out for these shoes when I want a tan colored shoe that I will wear all day. They fit a little high around the anke, and I tend to use them more in spring and fall, when it is not rainy. With my sporadic use, and some TLC it seems they will last forever.", "overall": 3.0, "summary": "Taming of the shrew (shoe).", "unixReviewTime": 1343952000, "reviewTime": "08 3, 2012"}, {"reviewerID": "A2VZZ469ELSFUS", "asin": "B0000C321X", "reviewerName": "CrazyAboutBooks", "helpful": [1, 1], "reviewText": "I have been trying to get a few pairs of 501 Originals (which is not the shrink to fit variety) that fit me, and have found the sizing of 501 Originals to be all over the map for jeans that all were labled 32w x 36L or 38L. In varying degrees, all--ALL--had waists that were bigger than 32. And in varying degrees all but one pair out of eight were too baggy overall (one pair was so baggy with a waist so oversize, that I could pull them off me even though they were all buttoned up).Some were a little longer than specified, some were a lot longer than specified (far as I'm concerned, that's a good thing: I'd rather have a tailor shorten them after a few washings, than find that after a few washings they are too short).Most had strange front rises that caused, in varying degrees, the dreaded codpiece bulge (which can be simulated by grabbing from behind the upmost part of one or both--the bulge is not always symmetrical--inseam areas at the crotch and pulling strongly backward and upward); the worst offender in this regard was the Timberwolf color, which I ordered twice in the hope that the first pair was a manufacturing mistake, but the second pair was just as bad: the Timberwolf's codpiece bulge was even worse when viewed from the side: hideous!As for the button fly--that turned out to be the best thing. I've found the button fly to be very comfortable, more comfortable than a zipper. The buttons are no problem once you get the knack of them and once the jeans are broken in.My dimensions are 73.5\" tall and 160lbs.  And of all the 501 Originals I've ordered, the best fitting is the Dark Stonewash in 32x36.  But fearing when I wash it the length might shrink too much, I ordered another pair of the stonewash in 32w x 38L--and guess what: that longer pair had the codpiece bulge even though the shorter dark stonewash pair fit perfectly.  I give up.ADDITIONAL INFO: the different colors the 501 Originals come in, are not all made from the same denim weight.  If you go to Levi's website, you can readily learn the weight of most of the colors there.  Some times a light weight is a good thing for casual wear on a hot summer day.  It's only a bad if you didn't realize you were ordering it.ONE MORE THING: 501 Shrink to Fit is NOT the same as these jeans, which are 501 Original Fit.  The 501 Original fit will behave pretty much like all other Levis that are not Shrink to Fit jeans.  Many people reviewing these Original Fit 501s didn't realize they were ordering the wrong jeans.  Again, Levi's website explains the distinction.", "overall": 2.0, "summary": "Dark Stonewash: The Best of the Worst", "unixReviewTime": 1378598400, "reviewTime": "09 8, 2013"}, {"reviewerID": "A2UG220UJU5DO", "asin": "B0000C9ZBX", "reviewerName": "Sayeef Khan \"Richie\"", "helpful": [2, 2], "reviewText": "First of all, this is my first skagen purchase. I came across this watch at my local macy's and looking at the $135 price tag I was hesitant and thankfully I was. I came on amazon and found one for 68 dollars, it was such a steal. Now just to get it out of the way, if you are wondering wether to buy this watch or not, you should absolutely. You will not be dissapointed. The price of this watch seems to fluctuate a lot on amazon so never be imaptient and buy it if it's over 80 dollars, just wait it out and check regularly because I am pretty sure you will find one within 68-79 dollars.Now on to the watch. I'll break it down so it's easy for you guys to understand everythingDial - The dial is a dark blue but, when it's exposed to light, it's reflection looks gorgeous and will capture people's attention without a doubt.Glass - The glass of the watch is very thick and scratch resistant. It also reflects off light and is very shiny and clear. When you see smudges just take a nice piece of cloth and wipe it once or twice and for sure it will look brand new again.Strap - Most buyers of this product complain about how hard is it to make the strap the right size for them. Honestly, it took me 1 minute to figure out how to do it. The instruction manual shows it very clearly, all you have to do is take a screwdiver or any other object that fits in the hole. Just enter the object and push it backwards and the clasp will open. Once it opens just move it back or forward depending on what size you need and just press it down tightly and that's it your done.Strap (look) - The look of the strap is my favorite thing about the watch. The material is very thick and metallic. It is very shiny and reflects off light like the rest of the watch. The reflection of the light on the strap gives the watch the elegant look and people for sure will know right away that it's an expensive watch.Comfort - The watch is very light. When left on sometimes you might forget that you even have a watch on, however since it is summer now I did come across one thing that irritated me. I like wearing the watch a little tight and when your in a warm environment your arm will sweat and make the strap feel a little sticky and make it itchy, but then again 90% of all watch straps will make you feel the same way so it's not a huge deal. Overall, it is very comfortable, light and great for everyday use.Overall GradesPerformance - 10Durability - 10Looks - 10Comfort - 9", "overall": 5.0, "summary": "Watch you will love.", "unixReviewTime": 1340236800, "reviewTime": "06 21, 2012"}, {"reviewerID": "A14XRI4U6BRG8T", "asin": "B0000CBXEI", "reviewerName": "Dw", "helpful": [20, 22], "reviewText": "I am really happy with this purchase. I bought this to wear with my wedding dress that is strapless and want to feel supported and sucked in for my big day.I normally wear a size 34DD bra so that is what I ordered here.The 34DD fits me perfectly.ADVICE FOR THOSE WHO HAVE ISSUES WITH FITTING:I used to work in lingerie and know that about 80% of women wear their bras in the wrong size. If you feel like you fluctuate in sizes you really dont, you are just wearing the wrong size! I suggest that you go to your local department store and have a lady trained in lingerie just measure you so that you know and you beat the issue. Some brands run a bit different but in that case its the brand, not your measurements. I wear a solid 34DD but can wear a 36D (in some bras) or a 32DDD (in some bras) However the only bras that work for me are my correct size. Take the guess work out if you plan to order online.-The fit is tight like it is supposed to be. It flattens and smooths my stomach and gives me that perfect hour glass shape I wanted and needed.- It is sexy and stylish with removable garters I will tack on later and hook up to some thigh highs when I take my wedding dress off... it is hot enough that I can wear it like lingerie. form, function, and sexy- cant beat it!-the back is low which is nice for dresses that plunge.. fits under my dress discreetly-good support and I know Im not going to pop outThe things I didnt like were the price, which is a bit steep I believe but I wont dock it because I could have opted for  something cheaper and more crappily made! I have no regrets!The other thing is I wish that the front came down just a bit farther. I have a short torso but still found that I wanted it a tad longer so I wasnt worried about any stomach getting smashed out the bottom.I am 5'6&#34; and weigh 140lbs 34DD bra.There are also two settings for hooks and mine was attached on the looser of the two (I am hoping that by my wedding in 5 months I can cinch it to the tighter clasps- fingers crossed!) I was really worried that it wasnt going to be as tight as I wanted but it truly does the trick!Very happy!", "overall": 5.0, "summary": "Wish it were a bit longer and cheaper but its amazing!", "unixReviewTime": 1363305600, "reviewTime": "03 15, 2013"}, {"reviewerID": "A2D0CO1OA6DSWY", "asin": "B0000DYKET", "reviewerName": "Gil", "helpful": [0, 0], "reviewText": "I got a pair of Neport sandals this spring and have been using them for 2-3 months now. I couldn't make up my mind if I should buy these or the \"Newport H2\" model. The difference seems to be that the H2 is using some \"water friendlier\" material than leather for the outer layer and the H2 have 100% rubber sole while the Newport have some leather upper layer on the sole that makes it more comfortable.I chose the Newport because I thought I was going to use them occasionally for 'street use' but if I could make the choice again I would probably select the H2 because apparently I see to use them only for hiking. The leather layer does not even come in contact with your feel anyway so I'm not really sure what's the point.These sandals are great! Here's what I like about them:\\* super comfortable. You can wear them all day and never feel the need to take them off.* Hold your feet very well. I haven't tried super difficult trails but I have tried dry trails, creeks, boulders, you name it. They just won't quit.* Sole has very good grip. They do not slip and slide even when wet.* toe protection is great* nice reflective stripes on front and back* it takes a second to wear them or take them offThey are not perfect though:* they take a longer to dry when they get soaking wet then I would have expected* they are a bit on the heavy side. I was surprised when I first lifted them out of the box. But you get used to this* the price you pay for the good hold and grip is I guess some less air. When it's really hot outside, your feet will get a bit warm. These are no flip flops...Note that I had to pick up size 9. I normally wear 8 or 8.5 max.", "overall": 5.0, "summary": "The perfect sandal for Summer hiking", "unixReviewTime": 1338681600, "reviewTime": "06 3, 2012"}, {"reviewerID": "AHYL7D3HJEO9I", "asin": "B0000DYKET", "reviewerName": "Stephen P. Weaver \"clerkman\"", "helpful": [1, 1], "reviewText": "Let me preface this by saying that I've had my pair of these Keens for ten years. Ten. I bought them in the Navy in 2004 and I've been everywhere with them. Islands in Italy. Germany. Boating. Hiking. Biking. Painting. Kicking. You get the drift.They are still in my closet ready for another summer of abuse. I absolutely LOVE them. If you buy any pair of sandals, you're wasting your money. These are the real deal. I wish I could show you them, but they're shy. :-)Still comfortable. Still durable. Still awesome. Buy and you'll rack up the experiences.Peace and good journeys.", "overall": 5.0, "summary": "Looking for a durable sandal? This is it.", "unixReviewTime": 1398816000, "reviewTime": "04 30, 2014"}, {"reviewerID": "A2I5QH4F5FDKK5", "asin": "B0000TII0K", "reviewerName": "*rose*", "helpful": [5, 5], "reviewText": "I've had this watch for almost 2 years and it's been a great and dependable watch.When I first saw it online, the watch looked huge.  I purchased it anyway because I wanted a second Timex watch to wear for work.  This is my other Timex watch (which I also love)Timex Women's Fashion Two-Tone Bracelet #T25771.I was so happy when it arrived!  While it is much larger than most women's watches (it's advertised as a men's watch) it's a beautiful watch.  I love the colors of this watch; blue face with the silver band.The large face makes it so easy for me to see what time it is.  I'm a little sneaky sometimes... If I'm in a meeting or speaking with someone and I need to know what time it is, I can very easily, just *slightly* tilt my hand towards me and without moving my face or eyes too much, I can see what time it is on this watch!  I don't want to be rude to whoever I am talking with, and this watch allows me to see what time it is with out being overly obvious that I am checking the time!  I know, it doesn't sound like a big deal, but I appreciate being able to do that.I get so many compliments on my watch.  I've been asked why I am wearing a men's watch and I tell them it's super comfortable to wear and I love the color and the features of the watch.  Along with the time, the date is easy to read.  Also if I'm in a dark room, the indiglo light works great.  Because the watch face is blue, the indiglo light tends to glow a light blue color.  Once I show them how awesome the watch is, they want one too and they ask me where I got it!One last thing, both the time and the date are so easy to set!  Just takes a few moments to do.I love this watch!  I've been very happy with all my Timex watches and they last and last...", "overall": 5.0, "summary": "One of the best!", "unixReviewTime": 1244592000, "reviewTime": "06 10, 2009"}, {"reviewerID": "A342YY7GHWRUYC", "asin": "B0000TIIPA", "reviewerName": "Lilly", "helpful": [0, 0], "reviewText": "The watch itself is great. Very simple yet very pretty! It will go with anything (unless you wear gold, I guess). It's comfortable and easy to read. A somewhat bigger face without actually being BIG. Nice and light. Seems durable, too. Indiglo feature looks nice and so far I'm very pleased!My only complaint is that it comes so BIG. If you have the right tools, you can remove links yourself. Or you can buy a link removal kit.. they're cheap but why would I want one? Just more stuff to clutter up my house.. Some people said they got theirs adjusted for free at a jeweler but every place near me said it was only free if you bought it there. I ended up going to a chain jewelry store and they charged me $20. The cost of that plus the cost of this watch is still less than some other watches that I considered buying so I'm okay with it, it's just inconvenient. I would have given this 5 stars if it came a big smaller. I don't have especially small wrists so I just don't get why it came so large!Also, just wanted to add that over time, it has started to bother me that the clasp will sometimes pop open when hit just right. Sometimes, I'll just be getting out of my car and the clasp will somehow hit something just so it opens. Annoying! I think it is just something that will happen with this kind of band but I didn't anticipate it being an issue originally.", "overall": 4.0, "summary": "Awesome watch but I don't understand why it comes so large?", "unixReviewTime": 1365120000, "reviewTime": "04 5, 2013"}, {"reviewerID": "A1SDEG7BA0ZDGO", "asin": "B0000TIJ4U", "reviewerName": "CBC girl", "helpful": [0, 0], "reviewText": "I just received this watch a few moments ago, I ordered it as a Christmas gift for my husband. When I opened the box, WOW!.. Of course  I fell in love with it online that's why I ordered it but setting my eyes on it...it is much nicer looking in reality than the picture. The picture doesn't do justice to this watch, why..The outside beveled edge is so much prominent that once you set your eyes to it, that's what gets your attention! Then the watch face (with the numbers) is like sitting in the well  of the beveled ring. The face color is very nice beige, the band is great; not the smooth leather but the kind of calfskin that gives it its unique character.  I love it, I love it and I'm very sure the recipient will love it too! Where the band is connected to the watch, it is kind of raised/curved some; in other words those who like the watch to lay flat on a surface this may not be the case. It is also a little heavy if you are looking for light weight! It was delivered just in time! For those who share the same taste... You will love it!P.S. The recipient loved his gift. He took time to tinker around trying to set the date right, and finally got it. Next step is to set the alarm. He said he hasn't got around to that but will. Nice watch, great buy! Its for keeps!", "overall": 5.0, "summary": "This Watch is a BEAUTY!", "unixReviewTime": 1387843200, "reviewTime": "12 24, 2013"}, {"reviewerID": "A26LD9FQHTM8ZH", "asin": "B0000V9E3S", "reviewerName": "OlyNomad", "helpful": [3, 4], "reviewText": "This is my third pair of Keens and I'm not as happy with them as my other two pair.Sizing information: I normally wear a size 10 but in reading reviews of these I saw it suggested to bump it up a half size, so I did and ordered a 10.5 and they fit me perfectly; any smaller would have been too tight.Pros+ Very nice looking shoe and I get compliments on them. Mine are the Coffee Liqueur/Ceramic ones and the color in the picture is very accurate.+ Good for running errands, short walks, gardening, basic running around stuff.+ Easy to get on and off+ Washable.  No damage after washing (I use the delicate cycle and let air dry which inside to dry completely took about a day...outside less than a day)+ Cord pulls nice and tight and stays that way, I don't have to keep adjusting it.+ Great for riding my bikeCons- Slippery when wet. If I go in water or if my feet start to sweat (which they seem a little more prone to do in these), they get slippery.  Not to where my feet come competely out of them, but it's still annoying.  I have to pull them super tight to avoid them coming off when wet.  That is my biggest complaint since these are H2 water shoes.- They stink. If I wear them all day especially during high heat...they stink really bad, to the point I have to wash them after only one day.  My Keens before have never been like that.- Not that comfortable with long wear.- Made in China.  For the price of these shoes, you'd think they were made here and I'm disappointed that they aren't for that price.", "overall": 3.0, "summary": "Decent shoes on dry land but they stink", "unixReviewTime": 1341964800, "reviewTime": "07 11, 2012"}, {"reviewerID": "A2BWXMY1C3O3EE", "asin": "B0000VC1OC", "reviewerName": "Wolf", "helpful": [0, 0], "reviewText": "Thinner than the old Carhartts I grew up with but it is every bit as durable and it is so warm I have to wait until I am on my way out to put it on or I will start to sweat.Anyone that complains about this being too stiff is just being silly. This coat will last for decades. It is built to last, quality snaps, stitching, material, and a zipper the size of my thumb with tracks not much smaller. If you complain about stiffness you might as well say &#34;I'm so upset my jacket has a 20 years of heavy use lifespan&#34;. If it is that big of a deal to you then just put it in a laundry bag with some shoes and coldwash it. After a few washes the shoes should have broken it in nicely.Under the sleeves it has some stretchy cuffs to keep the cold air from going up your arm which is wonderful.The pockets are very deep and clearly designed not to lose your stuff and be able to reach in them with gloves on.The coat is also just big enough to accommodate myself with a hoodie, shirt, and underarmor on. Most coats fail to take into account it is winter and in cold areas you need to wear layers but not this one!The cons:The hood (www.amazon.com/dp/B002QG0EEI ) is sold separately and does not come attached. While the snaps are Carhartt last forever quality the fact remains it could possibly come off one day. The good news is a tailor will sew it on for you very creaply. I suggest going with a double stitched pattern like:______________XXXXXXXXXXXX-------------------------The flap over the zipper is Velcro. While it is great Velcro that stuff doesn't last forever and it will wear out one day. Once again very cheap to have a tailor put some strong snaps on the Velcro Pads.I like my coats to run a little long so if I lift my arms reaching for stuff it still covers my torso. As this is a work coat I feel that is a reasonable demand to expect this coat to meet.Overall: Wonderful coat and it only has a few issues, most of which are very easy to fix.", "overall": 5.0, "summary": "Wonderful Coat", "unixReviewTime": 1385337600, "reviewTime": "11 25, 2013"}, {"reviewerID": "A2O7GDWNVZIZNP", "asin": "B0000WL7HI", "reviewerName": "Karen", "helpful": [0, 0], "reviewText": "Every time I look at Carhartt reviews, there are reviews on multiple items lumped together.  Coats being reviewed with Coveralls and the like.  So, these...Carhartt Men's Extremes Arctic Quilt Lined Zip-To-Waist Biberall, Black,...  are what I am talking about.  My hubby is crom SOuthern California. We were transferred to Maryland.  Now, some people say that it is not too cold in Maryland...we tend to disagree.  Any time it gets below freezing, we get cold.  So, I bought these as a Christmas presant for my HUsband, who works outside.  The other day, it was 6 degrees outside, and windy as hell.  He was warm enough to keep working.  Says a lot to us.  Now a piece of advice...go find a local retailer, and try them on first.... The fit is very strange, and the numbers mean nothing. Just make sure thast you have room to bend over...all the way over.  If it is binding, then get a larger size.  It is too hard to do any kind of work when things start tying you up.", "overall": 5.0, "summary": "Wow, these are Awesome", "unixReviewTime": 1390003200, "reviewTime": "01 18, 2014"}, {"reviewerID": "A1TCSC0YWT82Q0", "asin": "B0000ZCE0O", "reviewerName": "GinSing", "helpful": [1, 1], "reviewText": "I've always worn the underwires; the push-ups; all the va-voom bras but the underwires started killing me and I gave up all the pretty, sexy bras three years ago and went for comfort.However, I just can't seem to have my cake and eat it too when it comes to support, pretty, feminine look and also comfort.I heard they've improved the wires and would love to try but I am not a mall-gal or even a shopper period - I'm an online shopper and always have been.So, back to Amazon to see what I might find and this one seemed good. I got it the very next day! Wow. That's Prime at its best! Anyway..I can say that the underwire..so far anyway..doesn't poke me in the armpits..doesn't poke me between the breasts and so far doesn't constrict my breathing! Gee, those things are wonderful!I can say it is a pretty bra and fits nicely (true to size since I ordered online!) and does really flatter. It is sexy and feminine and looks good under my clothes.My only negative comments would be that I find it really itchy. There's a piece that is right above the cups that itches so much and rubs that it leaves red marks. Also, if I'm wearing a blouse and a blazer, it makes my straps slide down - the multi-layers seem to move the straps.December 2012 Update:I would actually rate this a 3.5 star and changed the review to reflect that. For the price, and the itchiness, it's really a little more than \"ok\".I have since ordered this bra, below, and I find the design and fit about comparable, but more comfortable, and certainly not itchy for a third of the price:http://www.amazon.com/gp/product/B0012N4VOA/ref=oh_details_o04_s00_i00", "overall": 3.0, "summary": "It doesn't bother me as much as most underwires", "unixReviewTime": 1351900800, "reviewTime": "11 3, 2012"}, {"reviewerID": "AU0LLORGK9IDR", "asin": "B0000ZDSDG", "reviewerName": "Julie H. Rose", "helpful": [2, 2], "reviewText": "I wear a 30F or a 32DD, depending on the style and brand. I live in a rural area, so it's next to impossible to find a bra in my size. Finding a bra in my size that fits is very difficult. Finding a bra in my size that both fits and is comfortable is next to impossible!This bra comes close. Oh, how I wish just ONE THING was different: the elastic at the bottom of the band. During the course of the day, it curls a bit and digs into my skin. I've had that happen before, mostly with sports bras, and I find it nearly unbearable after a day's wear. Y'know that feeling at the end of the day when you say, \"Oh, I've just GOT to take off my bra!\" Well, that's how this is for me. If only the elastic was covered! Why isn't it? Why do most bras have exposed elastic?Well, at this bra's price point I don't mind all that much. This bra fits me perfectly! If I only could wear it for half a day I'd still give it four stars. I love Wacoal's Retro Chic BraWacoal Women's Retro Chic Full Figure Wire. This bra, which has no seaming, fits almost the same. Some people say both bras give one that \"pointy look.\" Yes, they do, but I think it's very flattering.Obviously, I'm not exactly flat chested, but in this bra (and the other) I actually look pretty small, and for some of us, that's a great thing, and something of a relief. This bra has great support in the sides and great uplift. It can be worn over a t-shirt. Now, if Bali would cover that darned elastic, I'd pay twice as much for this bra and buy one in every color! One last thing: the heather pink is more of a pinkish taupe, which is a nice change from boring ol' beige.", "overall": 4.0, "summary": "Almost perfect", "unixReviewTime": 1373241600, "reviewTime": "07 8, 2013"}, {"reviewerID": "A1RFM037NQHXQW", "asin": "B0000ZE74A", "reviewerName": "F.C. in S.A.", "helpful": [0, 0], "reviewText": "Itching \"down there\" is NOT cool.  After recently developing a latex allergy, I was miserable and desperate.  After all, there aren't many places where I feel comfortable going commando.  I found these Lollipops by Googling \"latex free underwear.\"  I couldn't wait for them to arrive.  I wore them the very next day. Instantly itch-free!They are definitely grannie panties, hence four instead of five stars.  They're not attractive.  The waistband rests well above my navel, and I could probably stretch it to my head if I tried.  But, Jimmy crack corn, 'cause I don't care!  I can work all day and never give my underwear a second thought.  Unless you've been there, you have no idea how liberating that is.  So, if you are latex-sensitive, weigh your choices.  Itch or grannie panties?  I've made my choice.  Lollipops forever!Note: If you are allergic to latex/elastic, be sure you order the LEG BAND brief.  There is also a Lollipop brief with an elastic leg.  I accidentally ordered those and had to send them back.", "overall": 4.0, "summary": "Latex-free.  Hooray for Me!", "unixReviewTime": 1352764800, "reviewTime": "11 13, 2012"}, {"reviewerID": "AMTDEF7SAP17N", "asin": "B0000ZFHJY", "reviewerName": "Caelis", "helpful": [0, 0], "reviewText": "I almost didn't buy this pair because of the reviewers that claim to have received blisters from these particular thigh-highs: If you're allergic to silicone, don't wear these! I'm so glad I didn't listen to the reviews, because these are absolutely perfect.PRE-NOTE: I am 5'0, 98lbs, with medium/average-sized thighs.1. The fit for A/B is JUST RIGHT (bottom of lace hits just above the mid line of my thigh)- if you're much taller than me or have large thighs, I would get the next size up.2. The lace and sheerness of the thigh-highs are just like in the picture, extremely flattering!3. My boyfriend hasn't closed his mouth yet... I think that says something.4. As far as durability, they seem to be too fragile for everyday wear (Just get a pair of average pantyhose for that), but they are great for bedroom wear and special date nights.5. NO sausage effect! Woohoo!6. These will eventually fall down if you're doing gymnastics (I did a cartwheel test, and they slipped slightly with each move) but they have an exceptional grip that will stand up to walking around and minor rough-housing.7. I would order these again and recommend them in a heartbeat. They're worth every bit of $15 and I got them for 9!Hopefully this helps! (:", "overall": 5.0, "summary": "No Blisters, All Smiles!", "unixReviewTime": 1402531200, "reviewTime": "06 12, 2014"}, {"reviewerID": "A29381YVBY63P5", "asin": "B0000ZFIWK", "reviewerName": "August", "helpful": [0, 0], "reviewText": "I ordered these because i am having a heck of a time finding hose that are even reasonably comfy now that I'm pregnant.  I am 5'5\", 136lbs, and 18 weeks.  I ordered a size C and that turned out to be the right size, even though it's bigger than what the size chart would suggest i ordered.  I am not sure that I will stll be a C for much longer but we will see.  I hate pantyhose in general, but due to my job I must wear hose or tights when i wear a dress or skirt.  Pregnancy has made me hate them even more.Pros:Legs breathe better than a lot of other brands of pantyhose (maternity or regular). particularly the legs and feetShorter \"panty\" part so no worry of it peaking out under the bottom of my dress (unlike Assets); this panty length is similar to regular or control top non-maternity hoseAt least with this size and my size, it's not tight around the belly.  I can feel it much like I might feel a pair of socks on my feet, but it's not pressing me in (I avoid anything labeled \"support\")Cons:Crotch does not breathe! I felt like I was wearing a wet swimsuit all day as a result. Will have to figure out a solution for this.Still no cotton crotch (why won't any brands of hose make a fully cotton, breathable crotch??)Still goes over the belly (I really would like to find a brand that has the waistband going *under* my belly, as i don't like the feel of anything on the belly)Price - more expensive than some other brandsHow long will it last?  Before pregnancy i occassionally bought Berkshire non-maternity hose, and the fabric on the legs of these appears the same or similar.  I found that my old ones tended to run more easily than, say, Leggs.  But today is the first day i've worn these so I'm not positive that I will run into the same problem.Overall these are the best over-belly hose I've found, so I will purchase more pairs and just be extra careful about avoiding runs.I also purchased some Motherhood Maternity hose (not available on Amazon) that are supposed to go just below the belly button, and I pulled those way way down fully below the belly and that sort of does the trick in terms of being underbelly hose (at least for now).  And....I'm still looking for breathable cotton maternity tights!", "overall": 3.0, "summary": "decent even though it goes over the belly", "unixReviewTime": 1380758400, "reviewTime": "10 3, 2013"}, {"reviewerID": "A37YGCHW5YZGOX", "asin": "B00012O12A", "reviewerName": "Daniel S. Mayer \"Dan Mayer\"", "helpful": [0, 0], "reviewText": "I ordered 3 pairs of levi's int he same size (30x30) so I could have a bit of variety but mostly so I could learn which cut worked best. Here is the comparison of them all. I will start with all had a good length in terms of where they fall on my shoes. There was more variety in the width / tightness.505 (straight): A looser fit, comfortable, seems to stretch out pretty quick with wear. So far this is the only of the 3 pairs which I commonly need a belt to keep up. It is my wife's least favorite in terms of the cut / look, I think mostly because she thinks they are to loose / to big, I think when I first got them or right after they shrink a bit from a wash she likes them more. Currently thought she says this is her least favorite of the three.511 (slim): These are a slim fit as the style claims, but they aren't to tight and seem to have some stretch to them when you move around. They feel a bit to  tight the very first day out of the wash, but by the second they are about perfect. They are probably my favorite of the bunch, in terms of look, feel, and comfort. They are tight enough to not look baggy/loose, but not so tight to be uncomfortable or give me a silly skinny jean look. They are my wife's favorite in terms of the look as well.527 (low rise boot gen 7): These were my least favorite or the group. They were uncomfortably tight, when sitting I am constantly pulling, and 'adjusting' to try to sit comfortably. I have pulled on them and wear them a bit extra long trying to stretch them out. They are still wearable, but I really only put them on if my other two pairs are dirty. My wife thinks they are the second best in terms of look, putting them in the not to loose, seems to look pretty good on me middle of the road. Obviously since they don't feel good and are to restricting for movement, etc I give them last place. I wouldn't buy this style again.", "overall": 4.0, "summary": "compairing the 505, 511, and 527", "unixReviewTime": 1368230400, "reviewTime": "05 11, 2013"}, {"reviewerID": "A1Q4MNIUESQTBM", "asin": "B00012O12A", "reviewerName": "John Schultz", "helpful": [1, 1], "reviewText": "I have now purchased 3 pair of these jeans and they have all had the same fit. I did not notice any difference between them. I have bought the dark stonewashed, black and silver fox. The silver fox was a thinner and softer type of material and I liked it a lot! The best thing about ordering your jeans through amazon is that you can always find your size. I have always had a hard time finding 36x36 in the 505's. It's minimally more expensive but at least I know they will have what I need. No more frustration of hunting through the stack of jeans at a store hoping that someone put your size in the wrong bin!4 stars because these jeans are still no where near the same quality of the jeans I got in the early 80's when they were made in america. I hold onto them hoping I will eventually fit back into my 34 waist. If you have any original levi's before 1985 I would hold onto them. They are in great demand. They have everything going for them. They are high quality original Made in America blue jeans and are now retro. win-win. if you have ANY levi's from the 50's and 60's they can easily command $500 or more depending on the condition. Children sizes are the most in demand because they were well worn and sell the best, so they are the hardest to find.*update* 8-7-2012My fourth pair was not sewn right. It was a pair of the Dark Stonewash and the seam on the right leg would rotate to the top of my knee when sitting. I was able to get a replacement from amazon without hassle so I'm leaving the review as 4 stars. The replacement pair of dark stonewash fit great!", "overall": 4.0, "summary": "Great fit and all sizes available!", "unixReviewTime": 1342137600, "reviewTime": "07 13, 2012"}, {"reviewerID": "A1FBQ34ONL3QTK", "asin": "B0001475WG", "reviewerName": "Rocquael", "helpful": [0, 0], "reviewText": "I honestly didn't have high hopes for this undergarment. I've purchased other tummy control type products and thought they were a waste of money. I've warn this quite a few times since it arrives. And I think this product is the cat's meow. It noticeable slims the waste.But I do agree with other reviewers who complain about the product digging into your flesh. However, I offer solutions. First, I think that perhaps some are not wearing the undergarment properly. The woman in the pic is wearing the cincher just underneath the bra. So what I did to eliminate digging is to tuck the chincher under my bra a bit (in the front and back). And this did help to eliminate this a bit. However, what really eliminated digging was to wear one of those control top type pantie girdle thingy majiggs on top of the underwear and cincher. I noticed this eliminated another issue as well. The control top panties hid the ribbing. Unfortunately, the chincher ribbing is visible through my shearer form-fitting pencil skirts. But with the control top panties the ribbing outline is not visible. I hope this helps someone. F.Y.I. I am a size 10 curvaceous woman. However, I've let my figure go to pot so my waist is large. I gots me a dunlap (unfortunately). :-(", "overall": 5.0, "summary": "Quite pleased", "unixReviewTime": 1388966400, "reviewTime": "01 6, 2014"}, {"reviewerID": "A1RJG187GC0GWB", "asin": "B000147990", "reviewerName": "PMF", "helpful": [0, 0], "reviewText": "I don't like the material that it is made out of. The first time putting it on, I was afraid it would rip. I don't know how sturdy the material really is, but I'm not going to try and test it out. It's also rough and abrasive. The garter hooks (not sure if that's the correct term or not), dug into my legs. That was only after wearing it for less than a minute when I first tried it on. I ended up cutting them out. The whole get up is snug every where from torso down to thighs. Not a minute really goes by that I can't tell I'm wearing it. Some of the seams kind of cut in a little bit, leaving indentations in my skin. There's an opening at the crotch area and I'm not really sure of that purpose. I thought maybe it was in order to use the restroom without pulling the whole thing down, but I could not figure out a way to do that without making a mess somewhere (perhaps I need a funnel?). Basically, it's one of the most painful and uncomfortable body shapers I have ever worn. With all that being said, it does hold things in and flattens my stomach. This item follows the &#34;Beauty is Painful&#34; idea. If you are looking for something to take inches off, this is not it. All in all, my torso is about 1/2&#34; smaller. Depending on your side, rolls can hang over the top area. This item can be worn under jeans that are loose fitting. And I don't think it really does anything for my bottom. I thought it might boost it a little, but it doesn't. As for recommending this product: order at your own risk. If you want a flatten stomach and you don't mind a little pain and discomfort, this is your item.", "overall": 3.0, "summary": "Literally....it's OK", "unixReviewTime": 1398902400, "reviewTime": "05 1, 2014"}, {"reviewerID": "A14XRI4U6BRG8T", "asin": "B000196UJ0", "reviewerName": "Dw", "helpful": [2, 4], "reviewText": "The best thing about this is the length. I had to buy this to go under a corset because the corset did not go down long enough to hold in my stomach. I love that I have no issues with this covering my midsection. It does really help smooth out my figure to a very nice hourglass and I now feel confident that I will look smooth and thinner on my big day.Lines are minimal and great for more form fitting dresses.There is flexibility in this which makes it practical for existing! I have been in some where you cant breath or sit. while the fabric does suck you in it also allows for movement and I dont feel like Im going to pass out. thank god!THINGS I WISH WERE DIFFERENT:1.) I wish the fabric was a bit thicker. I know it needs to be thin for movement but I feel it could be thicker for even better control2.) It only has one hook option. there is one fixture it can close out. that means that you better get the right size because you cant cinch it or let it out anymore than how it comes.I bought a small and I am glad that I did. I am 143 pounds and 5'6&#34;. it does give an uneven look where it meets at my back, but thats because I need to lose weight and not the fault of the cincher. I intend to lose about 10 pounds before my wedding and I think it will be perfect and seamless then.The shape is nice before it goes on and I am happy with the product and the results.", "overall": 4.0, "summary": "Wish the fabric were thicker but overall good control", "unixReviewTime": 1366243200, "reviewTime": "04 18, 2013"}, {"reviewerID": "A108C9Q98OBCK", "asin": "B000196UJ0", "reviewerName": "MrsBurnette", "helpful": [38, 51], "reviewText": "I know most people just want to hear the NEGATIVES straight of the bat so we'll start with that.NEGATIVES:1) The 2 wiring that goes down your rib cage on your left, and right will poke while: Sitting, Bending, Walking, and when you wear it with jeans. After a few hours the wiring could irritate your skin. I wouldn't suggest it if your skin is sensitive.2) If you are curvy, as in you have the COLA body, with a little bit too much tummy, and waist, that you would like to completely hold in, I would go a size down. There was a chart recommendation below this rating by a reviewer for sizing. I used that chart it was a perfect fit, but not really what I was going for. I bought the clincher to suck in some unwanted fat and to try and retrain my tummy muscles to retract. The waist line part adds on more curves. If you want a sleek clean look go a size smaller.3) If you like to wear fitted clothes that shows the smallest wrinkles if you wore something inside than I won't suggest this. It shows the clippings inside. The boning (wiring) inside shows. I bought a white one to wear with a white dress and it shows.Positives:1) Material is PERFECT!2) Clippings inside are durable3) Shows up before the expected date4) Washes great in a laundry bag5) Although mine was not as tight as I wanted it to, this actually pushes my water weight down and now I am going for a size smaller :) I want to have a dramatic change to my physical appearance. If you want that than try to workout with this on. Even if it's power walking. Wear it outside of your pants. Your weight comes off within days and you have the curves with it :)FEEL FREE TO LET ME KNOW IF YOU HAVE ANY QUESTIONS.", "overall": 4.0, "summary": "Too CURVY for you :)", "unixReviewTime": 1361491200, "reviewTime": "02 22, 2013"}, {"reviewerID": "A3YJX1TWOHVDA", "asin": "B0001MQ60A", "reviewerName": "Lund Wolfe", "helpful": [1, 1], "reviewText": "I bought a pair for a Kauai and Maui trip last March.  I ended up wearing them everywhere for everything.  I tried them on in a shoe store so I got a perfect fit, which I highly recommend.  I wear a size 10 normally and I have wide feet.  These are 9 1/2 and fit me perfectly.  It is a little bit of effort to put them on and I normally don't cinch them down.  If I'm hiking or need them totally solid for hiking and the like, then I tighten them down.  They are very comfortable either way.  I stopped noticing them at all after a day or two.  Obviously they won't give ankle support, but for day hiking with a day pack they're perfect.  They were just right for Hawaii, which is so humid and muddy.  I was constantly hosing off my shoes.  Throw them in the washing machine and they look new again.  They like any kind of fresh or salt water activity and they are very durable and of course very protective of your toes.  I think they look very good, too.  I put them on over thin nylon socks and then directly into my fins for snorkeling, since my fins have a large foot bed.  Just put on your fins and take off your fins.  It is so convenient.The only complaint I have is that I did notice some foot odor, even though they are synthetic, after two weeks of daily use.  I think my feet are probably less stinky than most people, but given the constant humidity and wet environment in a closed toe shoe, I don't blame the shoes and it's not that bad of a problem.  You can just throw them in the washing machine when they start to smell, too.  I still wear my old super durable and comfortable Teva's for everyday stuff, but for anything else, short of backpacking, I put on my Keen H2's and forget about my feet.", "overall": 5.0, "summary": "ideal sport shoe, water shoe", "unixReviewTime": 1193616000, "reviewTime": "10 29, 2007"}, {"reviewerID": "A3QQXTLS5MXL6G", "asin": "B0001VJ2V6", "reviewerName": "Bobbi", "helpful": [0, 0], "reviewText": "My purchase of Jockey Women's No Panty Line Promise Tactel Hi Cut panties arrived today, they are a very pretty powder blue in color. Anyway, I cannot begin to tell you how much I fell in love with them! When I first took them out of the package, they looked very small, but they felt so amazingly soft and silky it was unreal. They are 90% TACTEL Nylon and 10% Lycra Spandex material and feel like butter! I have never felt anything like it! Trying them on they stretched on very easily and like clung to me like magic! They fit like a glove! The soft silky feeling of them against my skin was heavenly! They do have a sort of wide, very soft 100% cotton gusset, which is a very nice feature too, so not riding up your crotch. Being they are high cut is nice also. So I decided to put them to the test, I Put on my tightest leggings, which are yellow, they show everything. I then was modeling them in my full-length mirror. I was very pleased to notice there was absolutely no visible panty line showing through my leggings. So, yes Jockey kept their promise, No Panty Line. I plan on buying more of them in different colors. I would recommend these to anyone, who like comfortable panties, as these surely feel most wonderful. Now that I know how they fit and feel, I would have paid any price for them! I am very happy! Well see how they hold up, I plan on hand cold washing a drip-drying them too. As they seem very delicate. You have to try them, but you might want to shop around, to find the best price on them, and/or you can ask me where I bought mine.", "overall": 5.0, "summary": "Promise kept", "unixReviewTime": 1394409600, "reviewTime": "03 10, 2014"}, {"reviewerID": "A1PAGHECG401K1", "asin": "B00020J1GW", "reviewerName": "Chel Micheline \"Chel Micheline\"", "helpful": [92, 93], "reviewText": "I almost did not buy this watch because a reviewer stated it was a \"bright glowing purple\". But I needed a new watch and decided to go ahead with it.I was very surprised to open the box and find a watch very similar in color to the one shown in the photo. I'm thinking the gentleman who received the purple watch was most likely shipped the wrong item. I'd call the color of a watch a perinwinkle/cornflower blue, at the most. It certainly reads blue from across the room. It's not a \"glowing purple\" at all. And after a few days in the sun/in chlorine, the color is going to fade a bit. It's impossible to prevent in any watch.In addition to loving the color, I really like the function and design of the watch. Very easy to set (which is a relief compared to the newer watches on the market that require a complex series of button presses that must be executed within a specific time frame), and very comfortable to wear. I love the updated design features of the watchband- I especially love the rounded pewter buckle and the way the wristband \"locks\" into place under the slider. Most of my Timex watchbands usually wore out before the watch itself did, and I can tell the design improvements are intended to extend the life of the band. Everything is designed to prevent the cracking and friction that causes the band to break, especially for those of us who are going to expose this watch to a lot of chlorine.I swim two miles a day, so I need a watch that's going to hold up well underwater, exposed in chlorine, and used under the sun. The watch is very easy to read, even during quick glances during turns. Easy chrono- starts and stops with the press of a large button on the face.Indiglo is a bonus, too!I sort of strayed away from Timex a few years ago, but I'm really glad I ordered this. I love the design, the really nice color, and the funtionality.", "overall": 5.0, "summary": "Not baby blue, but NOT purple either- great watch!", "unixReviewTime": 1148601600, "reviewTime": "05 26, 2006"}, {"reviewerID": "A3SUSK8IBH54S6", "asin": "B0002291TW", "reviewerName": "Maverick", "helpful": [2, 2], "reviewText": "I was extremely happy to get this watch.+ve1. Very elegant looking watch.2. You can set three timezones in this watch.3. The digital display can be turned off.4. The steel band looks awesome, and makes it a dress watch.5. The back light is good.6. This watch has a heavy rugged feel to it.7. The steel strap has a brushed look and feel.8. The seconds hand has RED color, which you would love.9. This looks exactly like the watch in stranger than fiction.This watch will never dissappoint you ever!-ve1. This watch is a little heavy on the wrist, you would always feel that you have this watchworn. Actually I kinda like heavy watches.", "overall": 5.0, "summary": "Best watch I ever owned!", "unixReviewTime": 1258588800, "reviewTime": "11 19, 2009"}, {"reviewerID": "A3NKKFR8RIKXLH", "asin": "B0002LI7AW", "reviewerName": "Lishy", "helpful": [2, 2], "reviewText": "I purchased this bra because I needed a plunge push-up for a wedding I was in and the original bra I had purchased online would not arrive on time.  This bra was the only bra I could find that fit my criteria of a 44D, black, plunge, push-up, that would arrive in time for the wedding.The fit was not great.  My everyday bras are 44D and they fit perfectly.  This bra was too small around.  I could get it closed but the fat under my arms was pushed out very predominantly and this was not going to work.  Since I was in a time crunch I just went to a local store and purchased a bra extender to solve that problem (this store doesn't carry my size and is why I didn't purchase a bra here).  After that, no more bulge.  The cup size was fine, but this bra was definitely not the most comfortable.  The straps were constantly slipping off my shoulders.  I had to cinch them so tight just to get them to stay up, that you could see the indent on my shoulders through my dress.  This bra just lacked the overall comfort I'm used to.The push-up aspect wasn't bad.  This was my first push-up bra.  I didn't need a ton of cleavage I just needed some extra lift because my dress was very low cut.  So it worked fine for what I needed.Also, at first the straps kept coming out of the clasps holding them on.  They don't close and just slip on and off.  Eventually I was able to get this to stop, thankfully.If I hadn't already worn this bra I would return it.  In a pinch I would purchase this again, but if given more time, I would look for a more comfortable bra.", "overall": 3.0, "summary": "Meh.", "unixReviewTime": 1394928000, "reviewTime": "03 16, 2014"}, {"reviewerID": "A2UP9MFSG6XU9B", "asin": "B0002LTFXU", "reviewerName": "dls74447 \"Diane\"", "helpful": [0, 0], "reviewText": "Can't say enough about the Lerato. One of my favorites in my closet since going on a &#34;shoes that won't kill my feet search&#34; this month. Finances kept me away from Naturalizer for many years. My feet have suffered. But back even if finances aren't much better. Life is too short to die in pain with your feet everywhere you go.I love the style & fit of this shoe. Ever feel like a favorite shirt or PJ is your buddy? This is how I feel about this shoe.I've gotten several colors. Would buy all if available. VERY comfortable shoe. Wear anywhere. Have the Camelot, Russet & my fav the Coffee Bean. The little brass buttons on them are a perfect design touch. No wonder there are so few left of this style.Note: I wear an 8.5W. This shoe runs long in heel so I exchanged for 8W. PERFECT!", "overall": 5.0, "summary": "One of my best in a long search for comfort & style!", "unixReviewTime": 1395532800, "reviewTime": "03 23, 2014"}, {"reviewerID": "A3OXRFCJI67IMN", "asin": "B0002M7PWW", "reviewerName": "Bold Consumer", "helpful": [1, 1], "reviewText": "These are fantastic! You can stop reading and just buy a pair or two or more, and give them as gifts as I do. They are literally life-savers on the slick ice. I've bought these for family members, friends, and others have bought them after hearing me rave about them. I don't go outside without them in slick weather.My neighbor across the street was shocked when I rang his doorbell in a huge ice storm, to bring his mail to him. He said, \"How did you do that? There is no way anyone could make it up that steep driveway.\" I showed him the Yaktrax and he said, \"If that's what did it, I'm buying some\" and he did. Now he brings my mail when we have ice and snow.I keep a pair of them in my car just in case I need them.Usually we have more ice than snow, and these work really well with the kinds of ice storms we have. Then we had a snow storm, and they worked equally well. Finally, we had a different kind of snow, which packed into the Yaktrax. They still worked, but the snow was so fine, I guess, and there was so much of it, that it was still treacherous walking out there.All-in-all, I think everyone should have these if you have snow and ice in winter.EDITED years after getting my first pair. I've given away half a dozen now. I don't know how I made it without them. Our weather has been crazy with icy winters. Before getting these I remember some really dangerous situations. These are literally life-savers in my opinion.Comment", "overall": 5.0, "summary": "These Are Literally Life Savers In The Ice And Snow!", "unixReviewTime": 1309046400, "reviewTime": "06 26, 2011"}, {"reviewerID": "A33ZYFE8XMKKR1", "asin": "B0002M7PWW", "reviewerName": "P. Scott Pope \"Scott Pope\"", "helpful": [0, 0], "reviewText": "Five years ago, a slip on the ice caused me a catastrophic knee injury - a total quadriceps tendon rupture.  Since then, I have investigated and employed a number of ice traction devices for both walking and winter cycling.  In this review, I had the opportunity during a January 2013 Chicago ice storm to perform a head-to-head test of the Yaktrax Walker and Duenorth ice cleats worn with my lightweight Northface boots.  Essentially I walked a mile on the worst conditions I could find (sloping sidewalks, unsalted curbs, metal surfaces, solid ice, slush).  In short, both traction cleats massively improved my stability over the use of my Northface boots alone.  The Yaktrax came out ahead in virtually every scenario but unfortunately the rubber matrix broke during the test. This was probably due to my aggressive test on an icy sloping sidewalk.  Even so, I prefer the Yaktrax coiled steel design over the Duenorth tungsten studs. My suggestion is that if you weigh over 200lbs, you would, might consider a heavy-duty version of the Yaktrax (pro, etc.) or a different brand that employs the coiled steel.Initially, I was drawn to the Duenorth design as I already had much success with my tungsten-studded bicycle tires from Finnish company Nokian.  On dry concrete, the tungsten studs will literately score the surface when aggressively breaking. Riding on solid glare ice is doable with the tires, a feat that is impossible with conventional bicycle tires.  The material properties of the tungsten such as exception wear resistance and extreme hardness allow the tiny studs to puncture solid ice and even very slightly depress metal surfaces.  As such, the Duenorth outperforms the Yaktrax on very hard and solid thick ice or on ice over metal surface. In every other scenario, the coiled steel design is superior.  This possibly could be explained by the use of only six studs on the Duenorth design.  Tungsten is expensive.Overall, the Yaktrax won the test.  Yet, users should identify the appropriate version for their weight and usage patterns.  Spending an extra 20 dollars to save thousands in knee surgery is a worthwhile investment.*Yaktrax Walker evaluation on its own meritsProsPortableExtra heights helps with prevent water penetration into shoesCoiled steel design provide larger traction surface over tungsten cleatsTurns shoes into boots in certain situations -- unexpected snow shovelingConsRubber matrix not durable.TEST - JANUARY 2013 CHICAGO ICE STORMYaktrax Walker versus Duenorth1)Icy flat sidewalkWinner: Yaktrax2)Icy sloping sidewalkWinner: Yaktrax3)SlushWinner: Yaktrax4)Icy curbWinner: Yaktrax5)Icy asphalt roadWinner: Yaktrax6)Ice over metal surface (e.g. railing)Winner: Duenorth7)Large flat hard ice surfaceWinner: Duenorth8)Dry concrete:Tie - No clear winner", "overall": 4.0, "summary": "Head to head comparison - Yaktrax vs. Duenorth - Yaktrax comes out ahead but rubber matrix failed", "unixReviewTime": 1359244800, "reviewTime": "01 27, 2013"}, {"reviewerID": "ATL4XPJFR1R4V", "asin": "B0002TOR3U", "reviewerName": "laurel yarrow", "helpful": [1, 1], "reviewText": "I just opened this package of socks.  Goldtone Bermuda Combed Cotton socks. Three pair, sz 9-11, color demin.  I like the color, the fit and the feel of them.  I did not expect them to be any thicker than they are because I read the reviews that said not to expect that. I do find them to be a little thicker than the usual cotton socks of this type that I find in the stores.  Overall, first impressions are really good. Except:I am not happy that the socks are only 50% cotton, when I was specifically looking for socks with 80 to 99% cotton content.  The content is 50% cotton, 31% acrylic, 18% nylon, 1% spandex.  To me that reads half biodegradable and half not.  While that may feel good on my feet, it's not good for our planet and all the creatures on it.  I work hard to avoid buying plastic products. So it upsets me a bit that these socks were falsely advertised.  FYI - made in Mexico not the USA. You can buy socks made in the USA.(February 28, 2014). Update:  I contacted Amazon and They refunded my money.  I can also contact customer service to facilitate the purchase to make sure that they are cotton.  They also said that they would check into the problem. I hope they do!  So, so far, a five-star response from Amazon. I will check back to see if Any changes were made.", "overall": 2.0, "summary": "50% cotton - not 81% as advertised!", "unixReviewTime": 1393459200, "reviewTime": "02 27, 2014"}, {"reviewerID": "A2R6RA8FRBS608", "asin": "B0002TOZ1E", "reviewerName": "Matthew G. Sherwin", "helpful": [81, 96], "reviewText": "Amazon notes that these socks are \"only made from the finest yarns.\" They mean it, too! These socks keep your feet warm; and they are very well made and last forever. I especially like the way that they are reinforced at the heel and toe for lots and lots of wear. These athletic crew socks can be worn for athletic activities but of course they could be worn for everyday routine use as well. In addition, they are mostly made of cotton but Gold Toe adds stretch nylon and a little bit of spandex. Oh sure, these socks may cost a bit more--but you get so much use out of them that these socks inevitably pay for themselves.These crew length socks also fit any shoe size between 7 and 12; therefore it is--almost--one size fits all. These socks also come in a \"king size\" which fits shoe sizes 12 to 16 for the big and tall customer.  Excellent! The sock itself comes in white or black; but the toe area is literally made from gold colored fibers.I would not dry these socks at high temperatures. This could result in the sock becoming too loose on your foot. Eventually they will \"bunch up\" when you wear them and that's very uncomfortable. Dry these fine socks at a lower temperature. Then they will remain just as comfortable as ever. I know mine do!Overall, you can't go wrong buying these socks. They keep your feet extra warm during colder weather. Moreover, there is a king size for the big and tall customer as well; that size is harder to find these days. They are manufactured so well that you definitely get your money's worth. A good deal!SMILE", "overall": 5.0, "summary": "Hot Socks !!!", "unixReviewTime": 1167177600, "reviewTime": "12 27, 2006"}, {"reviewerID": "AY12DBB0U420B", "asin": "B0002TOZ1Y", "reviewerName": "Gary Peterson", "helpful": [0, 0], "reviewText": "When I first started running, a couple friends took me to a running-shoe store and helped select a pair of Nike running shoes to suit my needs. At first, I just wore a standard pair of mid-calf athletic socks with them, but it wasn't long before I noted that most other runners were wearing anklets. So, I went back and got a couple pairs of anklets and I could easily see why; the anklets were lighter and more comfortable. Plus, they looked better. Somewhere along the line I started wearing runners' anklets with my conventional shoes and I liked the anklets much better than the standard mid-calf sock. It looked a little funny wearing white socks, but when I looked around at enough stores I found that anklets came in other colors, notably, grey, blue and black. I opted for the grey and black and I used them for running also but most of the time I ran with whites.In any case, I've been wearing anklets now for a couple decades instead of regular socks. Oh sure, some people probably think it looks a little weird but the anklets are so much more comfortable that I just could never go back to conventional socks except for very limited ultra-dressy occasions. My wife has reluctantly gone along with my little eccentricity, but has purged the white anklets from my collection so I can't go out in public with them on. OK, I can live with it.The problem then becomes, where do I get enough grey and black anklets in-as-much as they are not nearly as common as the white variety. It takes a bit of looking and when I find them, I buy (usually in three- or six-packs). There are at least a half-dozen brands but the latest I've found is Gold Toe. They're excellent and fit very well. I especially like them in that they don't have a logo on the side such as Nike or Adidas. I like wearing anklets. They're comfortable, long lasting and nice looking. Who cares what anyone else might think about it?Gary Peterson", "overall": 5.0, "summary": "Anklets For Every Day.", "unixReviewTime": 1267488000, "reviewTime": "03 2, 2010"}, {"reviewerID": "A3T4OHEAHOJ700", "asin": "B0002TOZ2S", "reviewerName": "B. Colonna", "helpful": [63, 65], "reviewText": "I tend to buy Gold Toe socks whenever possible. I have always found them to be the most comfortable, well made socks available.  I recently bought a three pack of pairs of Gold Toe \"No Show\" men's socks at a local retailer and loved them.  So when I saw these six packs available through Amazon at an even better price I jumped all over them.These ARE NOT necessarily the same Gold Toe socks you will find at several brick and mortar retailers.  You need to check the actual product number, as apparently Gold Toe has several similar products but with distinctly different quality.  They are Gold Toe, and they look about the same, but the edge around the opening is slightly narrower than the ones I bought in the store.  No big deal I thought - so they are sewn slightly different.I have an average man's foot,  about a 10 shoe size, normal width, etc. Typically I put on socks and they fit.  I have seen other reviews where people like these socks and mention wearing a 12 or 13 size shoe, while people wearing a 9 1/2 or 10 1/2 complain about the socks....so maybe they run very large.Simply put, these are absolutely the worst fit of any sock I have ever owned.  They slid down off my heel repeatedly.  I tried several of the pairs I bought (about 4 pairs out of 12) and they were all the same.  They tend to slide around, not as if they are too big but just as if they aren't made right.  They also are somewhat thinner than the Gold Toe 'No Show' socks I bought in the store.The good socks I have are a Gold Toe 2247P.  These are a model 656F.  The 2247P may be very slightly higher on the ankle, but the difference in quality is like night and day.What a disappointment.  I returned them.  Fortunately, Amazon is awesome and offers free return on many apparel items, as well as free returns when something is defective.I'd avoid these socks, or take a chance knowing you can return them.", "overall": 1.0, "summary": "Gold Toe did not put their best foot forward", "unixReviewTime": 1310688000, "reviewTime": "07 15, 2011"}, {"reviewerID": "A2SA6LR78V49UV", "asin": "B0003216GM", "reviewerName": "OrangeCrush \"Still shooting with Film!\"", "helpful": [15, 16], "reviewText": "I am a huge fan of Ex Officio and have been using their Exo-Dri Tee's for quite some time now. To say I absolutely love them would be a massive understatement. So when it came time to buy more tee's I just automatically went with the Exo-Dri. Well, I came across a sale last week that had some of these shirts for a really low price so I decided to \"give them a go\" (That's my pun for the day). Anyways, it was ultimately a disappointing decision as these shirts just dont impress me at all.As I stated in my Exo-Dri reviews I prefer my wicking/athletic shirts to have some cotton in them, usually in a ratio of 1:4 or 1:5, as it makes the shirts far more comfortable and doesn't noticeable hinder a shirts wicking properties. Unfortunately this shirt doesn't have any cotton. Its basically a nylon shirt with a bit of Lycra to give it some stretch (94% Nylon / 6% Lycra). Its certainly not an uncomfortable shirt, its just nowhere near as comfortable as their Exo-Dri tee's. The fit isn't as nice either as the Give'n'Go has a much slimmer fit. If your looking for a looser fit and your dead set on ordering this shirt, you might want to order a size up. The Give'n'Go also has a tagless label and the Aegis Microbe Shield to control odor-causing bacteria.Don't get me wrong, this is a decent shirt and I am sure some people out there will actually like them. It just doesn't match up very well to their Exo-Dri Tee's, which imo are superior to these shirts in almost every way. In my opinion the Exo-Dri Tee's are softer, have a better fit, and are even better looking. I think Ex Officio's catalog speaks for itself. They only have 2 versions of the Give'n'Go (short sleeved crew neck & short sleeved v-neck) while the Exo-Dri now has 4 versions for men (short sleeve crew neck, long sleeve crew neck, quarter zip, and zip cricket short sleeved shirt). Women have it even better as there are 14 different Exo-Dri versions for women (I am not listing them!!). Basically, there are a lot more Exo-Dri shirts than Give'n'Go shirts and ultimately I think this speaks for itself.Bottom line - The Give'n'Go is a decent shirt but Ex Officio offers something that is far superior, the Exo-Dri Tee. The Give'n'Go line has great underwear but unfortunately the T-shirts need some work. If your looking for a great athletic/wicking style T-shirt then you have found the right company, you just need to buy the Exo-Dri instead of the Give'n'Go.3 Stars", "overall": 3.0, "summary": "Not Impressed, Ex Officio Has Far Better Options!", "unixReviewTime": 1287792000, "reviewTime": "10 23, 2010"}, {"reviewerID": "A2Y4BBTVX6N6D3", "asin": "B00062NNLK", "reviewerName": "Yasunori-San \"Isbjrnen\"", "helpful": [1, 1], "reviewText": "This is a good vest and I enjoy the heck out of mine.  I actually own two in different colours, since I was given another one several years ago for my birthday.  There are already a lot of reviews and opinions here so I will not be too redundant.The vest is Polartec fleece (200 mid-weight) so it keeps the core warm and comfortable down to about 40 degrees F. Any colder and I must go to a higher tech solution. It works wet or dry, and drys pretty quickly if soaked.It's a cozy piece of gear and I think a perfect gift item for a loved one since they will think of you in the comfort and warmth of it.  I actually LIKE that short fuzzy fibres starts to clump and pill like a snuggly, familiar stuffed teddy bear after only a few washings.  I often use it as a throw blanket or a pillow (esp on airline flights).  It is also very easy to maintain and as I have two, I often have one in the wash as I'm wearing the other one.I like the roomy sizing as I use this for layering, and this is an intermediate layer. When zipped all the way up, it practically serves as it's own Polartec scarf around the neck.  Being a taller/larger human, I appreciate that this vest is available in extended sizes too.The design of the vest is simple with a stand up/fold down collar, 2 zippered side slash pockets at the waist, and the Columbia logo on the chest.Herein lies, my first minor criticism... value.  For a simple, unlined vest without any \"extras\" (like chest pocket, map pocket, interior pockets, drawstring at the bottom or the waist, throat abrasion guard, dbl access zipper, uppers shell, back hook loop, even zipper pulls with whistles, compasses and LED lights) I would expect a basic level price.  If you shop around even online you should quickly get a feel for what the no frills model vs. the all the bells and whistles model are comparatively worth.The two pockets that it does have utilizes this elastized sateen material as the interior.  Not only is this pocket lining not very warm, but I find that it snags uncomfortably on little dry skin flakes, hangnails, and tiny dry skin spurs on my hands.  It might be just me, but it makes it unpleasant to put my hands in the pockets (for warmth).  On both of my Columbia vests, I have replaced the pocket liners with nice non-snagging flat mesh (like that found in luggage pockets).Well the world is what you make of it, so of course I have made some heavy mods to my vests, which have made them my favourites and practically daily wear for me.Columbia makes consistently high quality products (overseas) geared toward the outdoor person, so paying a little bit extra for the brand name logo is not that painful I guess.", "overall": 4.0, "summary": "My Everyday Wear Vest", "unixReviewTime": 1356307200, "reviewTime": "12 24, 2012"}, {"reviewerID": "A1WX42M589VAMQ", "asin": "B000655TUA", "reviewerName": "Mir", "helpful": [22, 22], "reviewText": "I need a lot from a daily bra and even more from a sports bra. My puppies are DDD and I have loose skin from losing 115 lbs, that double whammy makes it a pain to buy sports bras--or did until I found my 3 faves. This is the most affordable of my sport bra triumvirate (which also includes the Anita Momentum wirefree and the Wacoal sports underwire bra). If I want to be kept in place and have my bosom look separated and sexy, I go for the Wacoal. If I want a bra that sits flush and neatly against my skin and moves freely for Pilates, I like the Anita.For just about any exercise use, I like this Goddess. It lifts and it holds in, though it doesn't separate (there is an attractive monobosom thing going on). I like my profile in spandex-enhanced workout wear with this, cause it brings the bosom up high and the loose skin nicely tucked in with its wide side band. It doesn't let me be as flexible as the Anita, but I've used it for Pilates in a pinch. For walking, aerobics, dancing, really nice.For half the price of its pricier triumvirate cousins, this bra is a workout wonder for DDD girls (who can have a hard time finding a good bra for sweating sessions). Recommended.On, and for me, these run small, so I had to size up. I use a 38 band size in the Wacoal and Anita, but in this one, I had to use a 40DDD, which offers good support and band constriction. To be honest, a 40 band is quite snug. I might even be able to go up one more, but that might be LOOSE. A 38 would have been way too tight--I would not be able to hook it. Please pay attention to the comments about how this runs small in other reviews. I'm not alone in noting this.Be well...", "overall": 4.0, "summary": "Great for DDD older bosoms :) and good to keep side loose skin in, too, but size up. RUNS SMALL!!!", "unixReviewTime": 1360540800, "reviewTime": "02 11, 2013"}, {"reviewerID": "AT6CZDCP4TRGA", "asin": "B00068TJ76", "reviewerName": "Eduarrdo Nietzsche", "helpful": [2, 3], "reviewText": "OK, I admit it: I don't scuba dive, and I have no desire to ever scuba dive.  I don't even snorkel, and I swim perhaps twice a year if that.  In other words, I am DEFINITELY a land animal!So why'd I buy this watch?  Well, I'll just come right out and admit it: because I absolutely LOVE the way it looks!  Something the design, the perfect combination of black watch face, light green hour markers, stainless steel trim, black rubber strap, off-center crown, red \"Diver's 200m\" lettering on the dial, how the second hand floats gently around the dial instead of snapping off tiny intervals...I just can't stop looking at this darn thing, it's freaking beautiful!  And that's with me having rather small wrists; I'd imagine it'd look even better on a guy with beefier wrists.  There is just something refreshingly masculine, clean, elegant, modern yet classic about its appearance.  It's like having a gorgeous half-naked woman on my wrist...I just can't tear my eyes from her, heh.My only wish is that this thing came with an almost-scratchproof sapphire glass instead of plain Hardlex crystal, that's something I would gladly pay extra for.  Oh well, will just have to be careful with it.  Or I may have to pay a watch shop to install one for me, though that would probably cost close to the price of this watch by the time labor is added to the materials cost.  But would be worth it; I don't see myself ever getting sick of this thing.And I don't understand the negative reviews about accuracy, by mine hasn't lost any time at all, it seems just as consistent and accurate as a quartz watch.  It also is less obtrusive than I expected, when worn under a long-sleeved dress shirt.8/17/2011 UPDATE: six months later, the crystal still hasn't scratched yet...much impressed!  Am enjoying using it for my swimming workouts, especially the rotating bezel.Something I am not crazy about is the need to readjust the time every 2 weeks or so because it loses about 3 minutes even though I wear it 18 hours a day!  Am keeping my fingers crossed that the locking crown does not deteriorate and fall off with such constant use after a year or two, as happened to another Seiko watch of mine (albeit that one was a cheaper model, not a dive watch).  In retrospect, if I could find a quartz version that looked identical to this watch, I would probably buy it instead.  Because of this, I am downgrading my rating from 5 to 4 stars.", "overall": 4.0, "summary": "What a beautiful watch!", "unixReviewTime": 1298678400, "reviewTime": "02 26, 2011"}, {"reviewerID": "A38EJVT7C2T6CH", "asin": "B0006AAS4M", "reviewerName": "Marc McC", "helpful": [1, 1], "reviewText": "I'm a fan of Invicta watches, having owned three.  All have been of fine quality, the only &#34;knock&#34; on this brand being that most of their models are far too big for my wrist. (Anything over 44 mm is too big--I'm not a large guy.)I owned the coin-edged bezel model of this watch previously, and decided to buy this model as the price as always was great, and the appearance is way above average.  I swim and snorkel (but don't scuba dive), and prefer a 200m watch for these activities.The 8926 is a great combination of a timepiece suitable for outdoor activities as well as business or dress wear.  The Rolex-clone appearance lends itself for wearing at work or with a suit.  The band is solid, but not too heavy.My two criticisms of the 8926 are these:1.  The bezel is virtually impossible to turn.  I don't really care about this, since I don't dive, but I need one of those can grippers or latex gloves to move the thing.  WAY too tight.2.  The fold-over safety clasp, while a great security feature, is extremely difficult to open.  You need pretty long fingernails to flip the thing up.  Maybe a little WD40 spray will alleviate this.Timekeeping is average for an automatic movement watch.  Since I own quite a few watches, and this requires winding daily, it can be a bit of a hassle to reset it, but that's what you get with an automatic.All in all, great watch for the price.  I look forward to years of service from this one as with my previous Invictas.", "overall": 4.0, "summary": "Nice watch, with a few flaws.", "unixReviewTime": 1393372800, "reviewTime": "02 26, 2014"}, {"reviewerID": "AYXEEMHPF98Z5", "asin": "B0006AAS5G", "reviewerName": "S. G Spires", "helpful": [4, 8], "reviewText": "I have to say up front that the picture used in the Speedway collection is not the current 2007 Invicta models. By looking at the photograph, the watch apears to have a bezel with a recessed portion at the outside of the 2-4 clock portion of the watch. The two models I've purchase have a smooth bezel all the way around and look just like the ones do in the 2007 Invicta sales catalogue. This must be an older model and the photo has not been updated. Not a big deal, but I like seeing exactly what I purchase. It could make some buyers feel they have been misled.Invicta's watches rarely disapoint. The Speedway collection is nothing short of a stunning looking watch. It actually glitters on your arm.That said, there are a couple of drawbacks to the chronograph. It's accurate to one-second. There are fifth-of-a-second hash marks along the watch, but the chronograph hand only stops on the seconds. I've got two of these watches, the 9211 and the 9554, both are great looking but aren't super accurate chronographs. It's a Japanese movement 21-jewel automatic, and that's a great, quality movement, but maybe the Swiss movements are more precise. I don't know, but you can't expect to get a $5,000 watch for just $120, plus shipping.There are issues with the crown on the Invicta. The crown serves multiple purposes. It winds the watch up if it is stopped, and is used to change the time and date. But it is delicate and easy to strip out. It's hard to tell if the crown has been moved into the first or second position and if you use too much force, like I did on my 9554, you'll find that you will be having the watch repaired.All in all, this is another great looking watch and decent timepiece that has a functional chronometer.Well worth the price. I imagine it would make a nice gift to somebody also.", "overall": 5.0, "summary": "Five star watch at good price", "unixReviewTime": 1189728000, "reviewTime": "09 14, 2007"}, {"reviewerID": "A2OJSZRVWLFTPK", "asin": "B0006AAS7E", "reviewerName": "Emissary52", "helpful": [2, 3], "reviewText": "This Invicta 8932 is a nice watch for those who want something a little more deluxe than the average Casio or Timex watch. I had recently bought a Casio for $21 from Amazon and decided to get a couple more watches that were basically the \"next step up\" on the watch food chain.My first Invicta purchase was theInvicta Men's 9310 Pro Diver Collection Swiss Quartz Watchwhich is a larger Swiss movement quartz-based version, with the blue bezel and silver and gold trim on the watchband. It seemed very well constructed and at the same time I purchased it, I bought a cheap set of watch tools16 PCS Watch Tool Kitfrom Amazon for a little over $7 because I knew I was going to need to remove links from the band. Both the 9310 and the 8932 come with watchbands large enough to fit a retired NFL defensive tackle's wrist. Most guys will need to take out a link or more to get this watch to fit. The watchband resizing tool that comes with many of those cheap watch tool sets will do the job in about 10 minutes, once you get the hang of it. Simply line up the watchband in the slot and adjust it, so that the little hole that contains the pin for the link lines up with the pointy end of the tool and twist the screwdriver-like handle in the direction the arrow on the watchband link is pointing and out it pops! Repeat as necessary and re-insert a pin to join the watchband together and you've saved a trip to the jeweler's shop and a few bucks, in addition to learning a new skill. It's not rocket science!Some people have complained that upon receiving the 8932, it is smaller than they thought it might be. In comparing it to my 9310, the 8932 looks like a 7/8ths scale version. If you want that Rolex Submariner look and heft, you might consider theInvicta Men's 9307 Pro Diver Collection Stainless Steel Watch, which does have that look, at about $35 more than the 8932.Whether you buy the 8932 or the 9307, please remember that they are quartz watches and while they look very waterproof, they probably (from the number of complaints from other reviewers) aren't. If you expect to hold on to this watch as a minimum, until the battery dies (avg. 2-3 yrs, but ymmv!), the only water these watches should ever see would be the picture coming out of your TV set from the Discovery Channel during Shark Week. If you want to do Jacques Cousteau impressions with an Invicta Diver-style watch, you'd be better off with theInvicta Men's 8926 Pro Diver Collection Automatic Watchand its more expensive siblings, which are automatic, but have a screw-down crown, which aids in keeping water out. The downside to automatic watches is that they aren't quite as accurate as quartz watches are. These quartz models do not have screw-down crowns.I'm going to enjoy these \"pretend Rolex look-alikes\" for what they are and hope that when the battery dies in them, that I can easily replace it with the extra fancy watch-back openerWatch Case Opener Wrench Tool For Waterproof Watches CasebackI bought, in addition to the cheap watch tool set. These watches have screw-on backs. Wish me luck! BTW, since purchasing these new watches and tools, I've manage to repair every watch I've ever owned.", "overall": 5.0, "summary": "I'm hoping for the best!", "unixReviewTime": 1342742400, "reviewTime": "07 20, 2012"}, {"reviewerID": "A1CKZZUIADE0QY", "asin": "B0006AAS7E", "reviewerName": "O. Weston", "helpful": [0, 0], "reviewText": "I had to remove three watch band links to reduce the band size enough: In the, \"16 PCS Watch Tool Kit\", http://www.amazon.com/dp/B000T9VK56/ref=pe_175190_21431760_M3T1_ST1_dp_1, the blue plastic fixture is used to push the watchband pins out(and in) so you can take band links out. The pins in the band are like cotter pins.  They look like tiny screws when looking at the band, but they are not.  You push the pins out of the band by screwing the blue fixture pin into the side of the band pin that DOES NOT look like a screw slot - so that the slotted end of the band pin pops out of the band.  Then you can just pull the band pin out with your fingers.  It does NOT take a lot of force when pushing the these pins(or you're doing it wrong).You fine tune the band size by positioning which pair of the four pairs of holes you put what could be called the \"end of band\" pin.  That band part that has \"INVICTA\" on it has the four pairs of holes.  This pin is spring loaded on both ends.  I was able to push one end at a time in and move that end off a hole; then do the other end and relocate which pair of holes is used by nudging the pin/chain a bit.  It is about 1/8\" between hole pairs.  It will be clearer when you start fiddling with it.Be careful not to lose either type of pin.  All I did was work over a table and be careful.  You don't want to lose a pin in a carpet!  The end-of-band pin is very easy to lose as it can go boyng to never never land on either internal spring.  Don't force anything. It might take a little bit of fingertip type force in working with the end-of-band pin.", "overall": 4.0, "summary": "Watch band how to", "unixReviewTime": 1360195200, "reviewTime": "02 7, 2013"}, {"reviewerID": "A31SGZFWQGTKCM", "asin": "B0006AAS7E", "reviewerName": "R Pattay", "helpful": [0, 0], "reviewText": "Finally received a reply from Invicta customer service after two weeks. As followsInclude a Copy of your purchase invoice with the date on it if you have it.Include a money order issued to Invicta Service Center for the amount of $28.00 (for S&H;). For international shipping charges may vary and money needs to be converted into U.S. dollars.Include a note describing the malfunction, as well as an email address for swifter response times.Include a return address, daytime telephone number and e-mail address.Be sure to insure the watch with the shipper.If your watch is not cover under INVICTA warranty, you will be charged for the repair cost.We warrant each repair for one year. The warranty applies to that repair only.Prices do not include sales tax.Please DO NOT include your Gift Box when sending in your watch for service. It will not be returned.Failure to make prior payment arrangements (money order, check or credit card) will result in a return of an unrepaired watch.Be advised it may take up to 90 days to receive a watch back from repairSend your watch to:Invicta Service Center1 Invicta Way (3069 Taft St.)Hollywood Florida, 33021U.S.A.Good Luck!!!", "overall": 1.0, "summary": "Invicta", "unixReviewTime": 1403049600, "reviewTime": "06 18, 2014"}, {"reviewerID": "A323IQ2PNLGD9J", "asin": "B0006GZ32I", "reviewerName": "Noodle", "helpful": [0, 0], "reviewText": "I ordered this scarf as a gift..and I wanted to keep it so bad!Shipping was great even though I ordered it during the holidays. It came on time and the packaging was intact. The scarf came sealed in plastic and I fell in love with it! There is a little Harry Potter tag in Chinese but since the scarf was made in China it made sense.So, onto the scarf itself. It is wide and thick, which is perfect because it will definitely keep you warm. The material is very soft and there's even wool in it. The colors are accurate. The fringes aren't messed up and are just as soft. Now...the Slytherin emblem....that blew me away. It is actually embroidered and the colors are rich. It's sure to stand out and make a statement.Overall, this scarf is very accurate and just so soft! I will get myself a Gryffindor one (because I'm sooo not a Slytherin and yet I don't want people to know that I actually fit into Hufflepuff. Ha!)", "overall": 5.0, "summary": "Accurate and very comfortable!", "unixReviewTime": 1389744000, "reviewTime": "01 15, 2014"}, {"reviewerID": "A3DIVEVEQDF6NN", "asin": "B0006IHHMU", "reviewerName": "M. Corrigan", "helpful": [1, 1], "reviewText": "I have the orange version (Orange Monster) of this watch, as orange dials as well as yellow dials work better in low light or murky water conditions.  I have other divers as well (Citizen \"Eco-Zilla\" 300 metre, as well as some Omega 300 metre Seamasters).  For around $200 (or less) this is a typical good quality Seiko diving watch.  The bezel is 120 click, works smoothly, and is very readable.  The lume is very good, even rivaling my Omega Seamaster watches.It has a slightly domed crystal, which aids in reducing reflections under water.  The accuracy is OK, but not great.  I suspect that if it was worn more, it would settle down a bit, but it spends a fair amount of time on one of my winders rather than my wrist.The band is really well made and very substantial.  It does have a divers extension, but I replaced my band with an orange \"Zulu\" nylon divers band, as it is easier to use over a wetsuit, and isn't as heavy as the SS band supplied by Seiko.  This watch takes a 20 mm band.The dial is very legible, well made, and uncluttered.  I wish that they would make one with a yellow face, but the orange looks great too.  The finish on the case and bezel is good, and the watch really looks more expensive than it really is.This is a great beater, and is a good addition to your dive computer as a timing back-up device.  This is my second Seiko diver.  My first was a 150 metre diver that I bought over 30 years ago, and that one still runs to this day.  If that is any indication, this one should give years of service with only a few trips to the watch maker for adjustment, cleaning, and lubrication.Again, in typical Seiko fashion, you certainly get your money's worth out of this watch.  I would not hesitate to recommend this, or any other Seiko diver, for actual diving use or for those \"desk\" divers out there.", "overall": 4.0, "summary": "Great diver for little money", "unixReviewTime": 1212364800, "reviewTime": "06 2, 2008"}, {"reviewerID": "APF709VMGOG01", "asin": "B0006JCGUM", "reviewerName": "H. Tebo \"wayward muse\"", "helpful": [0, 0], "reviewText": "I bought this jewelry box to keep my growing trinket collection organized. I face such hardships between an attentive husband who keeps providing me with pretty earrings and sparkly bracelets at random calendar dates. I mean, I can't wear them all at once and leaving them lying around in the open like art pieces or hanging them off my wine glass as is popular was getting a bit perplexing with so many choices. I knew there was a problem when our mischievous cat was using a garnet chandelier earring as a diversion from his premium-grade feather toy.A very nice feature are the many drawers and compact shape that closes up, reminded as I was of one of my mother's beloved jewelry boxes. The folding front and side doors do such a fine job of making it look like I stack black faux-leather boxes on my armoire instead of heaps of gems in a tangle of chains. No longer does the cat careen over the edge in a pile of jewelry when he jumps up where he should not be. The husband appreciates this. The drawers, however, aren't very deep or long. There are two or three dividers at best, wide enough for a necklace or a narrow bracelet. My longer pieces used to lasso the unsuspecting have to be coiled up or hung from the interior pegs on the side doors, the majority hanging in the provided velvet pouch. So it's not very suitable for long necklaces or earrings.The hooks on the doors are okay for shepherd-hook earrings, but they are limited in number and require some fiddling to settle down. A quick trick is to use the plastic backers that come with most mid-range glittery pieces to help secure them. Otherwise assign a servant to reorganize them at your leisure. Larger hands may find placing them difficult. I suppose if you travel with studs and cufflinks, you should be good. Cuff bracelets or substantial pieces are really beyond the spaces except the deep square occupied by the small travel case.For a permanent receptacle for jewelry, it really needs another six inches for length and depth at minimum. The box works fantastic for a confined space and the locking mechanism on the front panel is quite solid and holding the lid and side panels together. A good buy, with a handsome appearance, but I still need something larger for the pile of fine accessories still awaiting a spot.", "overall": 4.0, "summary": "Ideal for compact spaces", "unixReviewTime": 1394064000, "reviewTime": "03 6, 2014"}, {"reviewerID": "A13S0N4A4ZEKZH", "asin": "B0006LJLMG", "reviewerName": "Inspector Nash Bridges", "helpful": [2, 8], "reviewText": "Good pants. One of the better pants out there. They used to be the best. The Levi's 501 set the bar. Not any longer. Now it's made in Mexico. No longer the best, but still better than most.As a kid, we used to buy only Levi's. Back then, they were made right here in the old USA, and they were the best. My folks used to take us kids over to the Levi's building on Valencia Street, and we bought directly from the factory. Today's Levi's just don't measure up to what they used to be.Get an old army surplus wool blanket.Lay out jeans and trace a pattern about 2 inches larger along the entire outline.Cut & sew together into a pair of ugly, green pants with an opening for the fly.Flip your jeans inside out.Insert jeans into army blanket pants.Sew army blanket pants to jeans at the hem & waist.Flip jeans right side out.Wear.You've just made a pair of insulated jeans that's better than anything lined with flannel.  Wool blanket lined jeans.  Nobody sells them.  Nothing store bought will be warmer.", "overall": 5.0, "summary": "Pants!", "unixReviewTime": 1270425600, "reviewTime": "04 5, 2010"}, {"reviewerID": "AI7WXHDA2OJXH", "asin": "B0006LJLMG", "reviewerName": "Quercus Alba", "helpful": [0, 0], "reviewText": "I bought one pair of 501 Shrink-to-fit jeans in Taupe Rigid to see if they would work out.  I got lucky on the size - I ordered one full size larger in the waist than I would do with pre-shrunk jeans and went with the same inseam (which on pre-shrunk jeans is borderline too long on me, I am kinda in-between 32 and 30 on inseam; I went with 32 on these, and they are perfect after shrinkage now).  I have worn and machine-washed and machine-dried 3 or 4 times, and they are just about perfect now.  Like others have said, they arrive new and stiff as a board.  The first wash-and-dry shrinks them and really softens them up.  Now that they have been washed a couple of times, they fit well (still a tad loose in the waist, but that's better than too tight).I LOVE the Taupe Rigid color.  It is just perfect to wear at my office - not blue jeans, but not lame Docker's type material either.  The taupe color is a medium grayish-brown.  It's the color of a wet concrete sidewalk, if that makes sense.  Goes with all of my pique polo shirts in any color.I have now also bought a second Taupe Rigid STF pair and a pair in Silver Rigid.  All three pairs fit about the same after a few washes, which is exactly what I wanted.  The Silver color isn't quite as good (for me) as the Taupe, because it has just a hint of blue in it.  It is a little darker than in the photo on Amazon (but will probably fade to a lighter color like the one in the Amazon photo over time).  The Silver is fine though, and a nice alternate color to have for the office.  The Taupe just rocks, though - my new favorite jeans.The \"Shrink\" in Shrink-to-fit is real, but it wasn't as radical for me as it seems to have been for others.  YMMV, and be sure to know whether you are buying a pair of Shrink-To-Fit (will have \"Rigid\" and/or STF in the name) or pre-shrunk 501's.  If you get a pair of these 501's to Shrink-To-Fit, and fit like you want after shrinkage, they are Jeans Paradise.  They are 5 stars if you get the right size, but I rated them 4 stars here because finding the right size to buy the first pair in involves a little guessing and estimating.  If you are not willing to take a little risk on sizes, stick to pre-shrunk 501's or other Levi's pre-shrunk versions like 505's, etc. The range of colors offered in these 501's is great, though.Amazon should really consider separating this listing into two separate product listings - one for PRE-SHRUNK 501's and one for SHRINK-TO-FIT 501's.  They are really two different products that share the same code number.", "overall": 4.0, "summary": "I love the Taupe Rigid and like the Silver Rigid", "unixReviewTime": 1364601600, "reviewTime": "03 30, 2013"}, {"reviewerID": "A3A90CELVLOUP6", "asin": "B0006LMBJ6", "reviewerName": "Nanciejeanne \"Enjay\"", "helpful": [0, 0], "reviewText": "My teenage son wanted skinny jeans. I never really liked the super big hanging-down look, but was unsure how he would look in skinny jeans. I got him both the Levi's 510 and these 511, both in his \"normal\" size. (29W)When they arrived, he tried on the 510s first, and they looked great! Definitely form fitting, but not too skin tight. He is more or less average build, with maybe slightly thicker thighs, not an overly thin or heavy kid. When he tried on these 511s however, he couldn't button them. Close...but just too small. (I was going to return them but of course he ripped all the tags off and threw them on the floor for 3 days...so I didn't.) I took away one star just for the inconsistency of the sizes between very similar items (both Levi's, both \"skinny\"). It just makes it harder for customers when they are not trying them on in a store.I am here ordering the next size up, hopefully they will fit him. (I am watching this time so he doesn't rip all the tags off!) If you are unsure, please keep your tags and packaging so you can return easily. If you buy from amazon.com as the seller, they are currently listed eligible for free returns.I am not sure why there are two different pages listing these. There is this page:Levi's Men's 511 Skinny Jeanand there is also this page:Levi's Men's 511 Skinny Jean. They appear to have the same items, prices and reviews. Maybe it is just a mistake and amazon will merge the pages. However one page may list different sellers than the other, so if you are looking for a size/color combination on one page and it isn't available, it couldn't hurt to check the other one, just in case another seller might have it. :)", "overall": 4.0, "summary": "Awesome look, run a little small.", "unixReviewTime": 1327968000, "reviewTime": "01 31, 2012"}, {"reviewerID": "AI5EIS34J73QB", "asin": "B0006LMBJ6", "reviewerName": "Sam", "helpful": [0, 0], "reviewText": "I bought 2 pairs of dark blue 511s at Kohls.  They were on sale and with a 30% discount coupon they cost me thirty-one dollars each.When I lost weight, I bought new 505s but they were quite baggy (even though the 505s are now cut tighter than they used to be).Then I bought 514s and while they're cut way smaller, they still get a bit baggy after wearing them for awhile.My wife is complaining that there's too much fabric around my butt so back to Kohls.I try on the 511s and they're too tight around the waist even though they're also 30\" waist.  I have to get a pair 1\" wider around the waist.What I don't like about the jeans is that they're designed to be too long.  Check out Levi's photographs -- the jeans are bunching around the shoes.  Hey, if I was 16 years old, that would be way so cool.  But I ain't that young and it looks stupid and sloppy on me.  I sometimes wear jeans with dress loafers and sometimes with a sports coat. I'll bring them to a tailor and alter the length.I wear the 505s around the house since they're roomier but I look 20 pounds heavier. Ever anxious to keep wiffy happy, I change to better cut jeans when I leave the house.The material is very, very thick and stiff.  I found the material uncomfortable so I turned them inside out and ironed them to remove the wrinkles that chaffed my skin.The Levi jeans I bought are made in Mexico and have the Levi's logo on the inside pockets.  My wife also had great success with her Levi jeans that were made in Mexico.Because of the variations between all of the models, you really have to try them on in a store.  And even with the same model number, there are major style differences.  Some are stone-washed, some fabrics are very thick, others thin.  Try before you buy.", "overall": 5.0, "summary": "If they're made in Mexico, they're great", "unixReviewTime": 1379635200, "reviewTime": "09 20, 2013"}, {"reviewerID": "A1XG0R7GMOVEBZ", "asin": "B0006NWTFU", "reviewerName": "Julie O", "helpful": [4, 5], "reviewText": "I was a lifeguard in high school and college; so TYR was a regular in my life during that time period. I decided to take up swimming, again, this summer; but I wanted a two-piece instead of the Diamondback one-piece style I always wore as a guard. I had worn their reversible two-piece style in high school for a couple of summers; but I decided I wanted to stick with the thinner straps you get from the Diamondback style, and I wanted the material to be PBT instead of a Nylon/Lycra blend.In my years of experience, I had grown to appreciate the longevity of a suit made out of PBT (valuable when you are teaching swimming lessons and water fitness everyday in the water for several months). I'm not sure if anyone agrees with me, but it seems like the PBT material lasts longer.That's what I thought I was getting when I ordered this suit; but I got the Nylon/Lycra version. I didn't give this lower stars because it is still a well-made suit; and the fit was just right for me. However, I had to return it because it was not the material I wanted.I try to order only through Amazon or Amazon fulfilment if I'm on the Amazon.com website because of the shipping and return policies, but I didn't look closely at this order. It was through a different seller. However, when I called Amazon, they were able to help me right away. I got to return it and received a full refund.I still wanted this suit in PBT and the navy color; but I didn't want to re-order it from that same seller; so I had to go through a different website that I've gone through before. I will say that if you are wanting to order this suit, order it in any size and color through Amazon.com only (I've never been shipped the wrong thing from them, and they have a great shipping and return policy).For this suit in PBT, I have to say that it is figure-flattering, comfortable, and durable. I usually wear a medium or 6/8 in clothing; and the medium for this suit fits well, too. I have a larger chest (34D), but this suit holds everything in without looking inappropriate. Definitely a great suit if you want to be able to actually swim some serious laps, horse around, or just look stylish but sporty.", "overall": 4.0, "summary": "Love TYR . . . but I wanted this suit in PBT.", "unixReviewTime": 1342483200, "reviewTime": "07 17, 2012"}, {"reviewerID": "A2SZRY5TFW27TR", "asin": "B0006U68M8", "reviewerName": "Gordon Ewasiuk", "helpful": [1, 1], "reviewText": "Being a Levi customer since forever, I was a bit skeptical about Wrangler.  Will they be as comfortable as Levis?  As durable?  Do guys wear Wrangler jeans?  These jeans answered all my questions and more.Right out of the box, these jeans feel rugged.  The denim feels heavier than the average pair of jeans.As I put them on, the leg cuffs surprised me.  The cuffs are big enough to fit over a pair of work boots.  No tapered legs here.  The cuffs fit nicely over a pair of Timberlands or other heavy-duty work boots.  The cuffs also have some reinforced stitching so they will not fray.This pair of jeans has plenty of belt loops.These jeans were made to fit at the waist.  Regular fit means just that -- regular fit.  These jeans are not baggy and or \"relaxed\".Only complaint (minor one) is the front pockets.  They are small.  A good 2 inches smaller than the front pockets on a pair of average Levis.  Rear pockets are normal and hold a wallet comfortably.Would recommend them to anyone looking for a pair of durable jeans.", "overall": 4.0, "summary": "Durable, rugged, and great workwear", "unixReviewTime": 1230336000, "reviewTime": "12 27, 2008"}, {"reviewerID": "A1J0UVGB72L993", "asin": "B0006UD740", "reviewerName": "Amazon Customer", "helpful": [15, 15], "reviewText": "I'm very happy with this nightgown cover-up!!! That said, it is not exactly what I thought. This isn't a reflection on the company, I should have been more careful reading the description and reviews. I will be keeping this item as a splurge because it's so very pretty and I love it so much. I was, however, looking for something that would cover my short nightgown thoroughly so that when we have overnight guests I could have something pretty and yet modest in case I get caught making the coffee when our guests wake and come out to the living area of the house. I may be able to do that, not sure yet how comfortable I feel about it. I will almost for sure be able to if I am wearing a long nightgown.Things I LOVE about this gown.1. The purple color is stunning, seems true to the picture for me.2. The sleeves are tapered and stretchy so I'm able to push them up to wash my hands or wash dishes.3. The fit is perfect and flattering to my shapely but overly hippy figure.4. It's possibly modest enough for my purpose as it is not overly sheer through and my night gown is not low cut. I am pretty conservative.5. Love the length, not too long for my 5'4\", possibly too short for women over 5'5\" or so.Things I don't like:1. It's a tiny bit too sheer for me.2. Slightly too low cut3. DOES NOT BUTTON ALL THE WAY TO THE BOTTOM (I am using caps to bring this to others who are considering this purchase).", "overall": 4.0, "summary": "Doesn't button all the way down", "unixReviewTime": 1352505600, "reviewTime": "11 10, 2012"}, {"reviewerID": "ABDR6IJ93HFIO", "asin": "B00073ZLIG", "reviewerName": "Daisy \"Daisy S\"", "helpful": [6, 6], "reviewText": "This T-Shirt I found last week in my local store and bought two in white (size Small). This is a very comfortable T-Shirt. Super high quality. Since this T-Shirt has exceeded my expectations, I recommend this to you for the following reasons:1) It washes and dries with no shrinkage (as far as I could tell). Because I have kind of itchy skin, when I purchase new clothing, I always wash it first to get the sizing etc out of the fabric.  For washing this I used Tide Gentle Detergent and washed in warm water. (This made the T-Shirt soft with no perfumes or dyes as they sometimes regular detergents make my skin itch). The dryer - I dried this for 30 minutes on regular.Result is a great and ready to wear T-Shirt after I washed it.2) True to size - Noticed that others said that this T-Shirt runs a little small and short. For me, I found it true to size as I am short at 5 foot 3 and wear a small size. This T-shirt fits me well and it is not too long, not too small - in fact, it fits me somewhat loose because I like some wiggle room in clothes so I can move in comfort).3) Not too thick or too thin - This T-Shirt can be worn year round--In summer I plan to wear it as a regular T-Shirt. In fall and winter, it will be worn under my sweater or hoodie. This is a perfect weight/year round T-Shirt!4) Soft and So Comfortable - I like soft but not limp so this T-Shirt is soft but not limpy soft, this way, it is a stronger and more durable T-Shirt than a super soft one is. This is a comfortable T-Shirt that is not too tight or too loose.5) Price and Value - This is the best price and value I have found, the white ones are found in most stores (I bought white). However, I like this line of T-Shirts so much, I plan on ordering more on Amazon in different colors.***If you are looking for a great quality T-Shirt at a great price, this is the T-Shirt to buy!", "overall": 5.0, "summary": "Very High Quality T-Shirt! Comfortable and Fits Very Well!", "unixReviewTime": 1383264000, "reviewTime": "11 1, 2013"}, {"reviewerID": "A1UBUZFYZ0T9YK", "asin": "B00074HDAO", "reviewerName": "jmoonx14", "helpful": [2, 2], "reviewText": "I bought this watch over 5 years ago. I set it and have not touched it since other than DST one hour changes. It knows how many days in every month and which year is a leap year so you never have to do a thing to it once it is set. Other than daylight savings you never need to adjust a thing on this watch. The eco-drive concept had me concerned back then and I wondered how long it would really charge and discharge before it wore out. Well like I said I have had it over five years and I recently left it in a dark display case for over a month. Took it out and it was still within four seconds of my atomic radio wall clock!The look, color, detail, fit and finish on this Eco-drive is beautiful. The ocean blue face color is very unique and is best appreciated in the bright light of the sun. The band is very solid and comfortable. It has a unique/aggressive design to the links and how they interface. It is a substantial watch on the wrist but it's sleek and does not slide around, pull your hair or cause any discomfort. It fits with activity or as a dress watch.I have over 10 watches in my collection and the Calibre 8700 is at the top. It is my go to watch more than any of the others and I set all my other watches (time and date) by this one. The accuracy is within a handful of seconds per year on mine and I am sure this is pretty common for the Citizen Quartz watches. I sure have my eye on the Eco-drive Diver to go with my two Seiko Monsters but this one keeps me happy in the meantime! The price of this watch makes it a no brainer for me. If I had it to do again I would in a heartbeat.If I were ever stranded on a desert island and had to chose a watch to have with me...this is without a doubt the one.", "overall": 5.0, "summary": "Function and Form...I Love This Watch", "unixReviewTime": 1390262400, "reviewTime": "01 21, 2014"}, {"reviewerID": "A30H8ACW807Q2F", "asin": "B0007CKP42", "reviewerName": "S-N-D \"Layford\"", "helpful": [0, 0], "reviewText": "My inseam is 31 inches. Since I prefer my jeans to cover my ankles completely, I usually order 32 inch inseam. However this actual pair of jeans received has an inseam of 33.25 inches to be exact. This is a bit too much to tolerate. So I had to return it and ordered another pair with 30 inch inseam.The pros: 1. Excellent color; 2. Good material quality and texture; 3. Good style.The cons: 1. Too long for its sizes; 2. A little bit too tight for the so-called \"classic fit\"; 3. The back seat is a bit too high.Update: I bought another pair with 30-inch inseam and waist one size bigger. Now it fits me much better. So the problem is really with the sizing of this particular brand of jeans. I have measured the actual length of the inseam again for this 30-inch inseam jeans. It is a full 32 inches! Glad that Amazon makes it easy to return and re-order. I therefore add one star to my review. Hope this provides a reference for potential buyers of this particular jeans.", "overall": 4.0, "summary": "Long to its size", "unixReviewTime": 1384041600, "reviewTime": "11 10, 2013"}, {"reviewerID": "A2F1V6JKYFP67M", "asin": "B0007MCUTK", "reviewerName": "mofo83", "helpful": [0, 0], "reviewText": "I love these boots. They are lightweight, comfortable, look great, seem well-made, and won't break the bank. The leather seems to be high quality and looks beautiful. Once they're broken in, they feel almost like slippers. The crepe sole is super flexible and springy, and very comfortable to walk on. What more could you ask for?I will undoubtedly wear these until they fall apart, then buy another pair, and repeat!That said, here's some sizing advice: I would suggest ordering these one-half size smaller than you usually wear. Some reviewers say to order a full size smaller, but for me, that would be too much. I usually wear a 10.5, and I bought these in a 10; they seemed quite snug at first, but after a few weeks, they fit like a glove! They also seem to be relatively narrow shoes, so if you usually wear wides, you might want to stay away.The only small negatives: They provide almost no arch support; my feet don't mind this, but yours might. Also, the crepe soles turn black and look filthy after just a week. Oh well - people don't see the bottoms of your feet all that often. Finally, they don't seem to breath all that well, but that might just be the way all-leather shoes are.As far as care goes: I have been inserting Woodlore cedar shoe trees immediately after taking my boots off each day, and I think this will help greatly in keeping them looking great for a long time to come. The Clarks site suggests using a conditioner/protector with oils and lanolin, so I applied some Dr. Martens Wonder Balsam (which contains lanolin, oil and beeswax). It darkened the boots a shade or two, which I'm okay with, though I prefer the original color - so be careful. It did provide the conditioning and protection I was looking for, though.So... buy a pair now - you won't regret it!", "overall": 5.0, "summary": "Fantastic Boots! Order 1/2 Size Smaller Than Usual...", "unixReviewTime": 1389571200, "reviewTime": "01 13, 2014"}, {"reviewerID": "A1CMD08Z49PGKQ", "asin": "B0007MV6PO", "reviewerName": "okiedan \"Pro Bono Publico\"", "helpful": [0, 0], "reviewText": "I purchased this hat to use when riding my TerraTrike and hiking.  The had is top notch.  Very well constructed with no loose ends etc.......  The fabric feels nice and the hat is what I would call a low rider....meaning you do not have a huge top .......I have tried some other outdoor light weight hats and while they were nice they tended to be a little overdone.  A huge brim or a huge cap..... This hat is just right.  I wear a size 8 in official MLB hats..... this is the only truly fitted cap I wear and that size is just a little too big.This XL hat goes down over my big head and when pressed far down the top of my head is actually in contact with it....Which is what I want.  Do not want it blowing away.  You can tighten the leather strap under you chin or you can use it the way I do....as a way to hold the hat on the back of my neck/back when I want to take it off for a short time.Very pleased.  This is my second Henschel hat...the other being the all leather variety.Henschel does not sell direct so I got this one from a company on Amazon called.....Work Wear savings.  In the box they included a fee sample of Allegra and a packet of coupons.....I only saw one thing that interested me.... BUT on the packet there is a coupon code for 10 bucks off on a 99 dollar purchase.  Not bad.....I am off to scope out the sportsman guide web site now.", "overall": 5.0, "summary": "Henschel made in USA hats are great quality", "unixReviewTime": 1395964800, "reviewTime": "03 28, 2014"}, {"reviewerID": "A35W3JQYP0M655", "asin": "B0007OF2QG", "reviewerName": "John Thomas... \"New England...USA\"", "helpful": [38, 39], "reviewText": "I bought this hat a little over a year ago for the coming trout season.  I finally had to put my old hat into retirement after it was practically in pieces.  Most fishing hats, rods, gear etc, are steeped in a lot of tradition and superstition, thus we tend to hang onto things such as hats for as long as we possibly can.  When I decided to buy this one here on Amazon, I admit I was taken in mostly by the price.  I had seen hats very similar to this in places like American Eagle Outfitters and Old Navy for easily twice the price they are asking for it here.  I was pleasantly surprised upon receiving it by the high quality and comfort.  It is a very handsome hat that is extremely comfortable, and functional as well. And the quality of the fabric and stitch is superior considering the price. The hat has too heavy snaps on the side for folding the side brims up for the times when you want to look cool, and a nice rawhide drawstring to keep you from having to chase it down river in the event of an unexpected gust.  I felt as if it had been part of my fishing trips all along from the very first outing with it.  One thing that should be cleared up however is its claim of being water repellent.  This hat is not water repellent but rather weather resistant.  Meaning it won't repel water, but it will not be affected by it either.  This has been rained on, dropped in the water, and been thoroughly soaked and it has neither lost any of its shape or quality feel.  It may get wet if there is enough water, but it is not the least bit at any loss for it after drying out, (which it does very quickly). If you truly want something water repellent, you will just have to move up to a more expensive, (and in my experience more uncomfortable), hat that truly has a repellent lining.  In my opinion unless you love fishing in driving rainstorms or the feel of anything at all wet on your head, I would recommend this fine quality hat.  It is very comfortable, handsome and functional, and comes in a wide variety of colors and sizes that are sure to fit just about anyone.  I love it and feel that its an excellent deal.  Highly recommended...", "overall": 5.0, "summary": "Quality Hat....Excellent Price And Value", "unixReviewTime": 1277942400, "reviewTime": "07 1, 2010"}, {"reviewerID": "AOINAOO0NQRGN", "asin": "B0007PLXO0", "reviewerName": "Sessue", "helpful": [5, 6], "reviewText": "Don't buy these. Unless you can pick them up for $5, they are just likely to be one of those gotcha buys that will haunt your nightmares for years to come.I bought several pairs of these two years ago. They appeared to be part of a product line that had some excellent hoodies which I had purchased initially. I've regretted these sweatpants ever since and have just ended up hiding them under one of the various and sundry heaps in my closet.The worst thing about these pants is the fabric. It is thin, it is SO thin that I can feel even slight breezes coming through the legs. The fleece on the inside of each leg does nothing to help with this or to give the pants a more luxurious feel. When I put these on, the fabric alone screams, \"Cheap!\" at me.But that's not all. The legs are cut too long in proportion to the waistline. This wouldn't be a problem if the result was just a fashionably baggy appearance. However, in both of my pairs of pants, the elastic in the bottoms is weaker than a 10 yo rubber band. As a result, the bottoms are constantly dragging on the floor and getting in the way of my feet. I finally got the clips that cyclists use for their cuffs. This helps a little but is also unnecessarily inconvenient.Last, I have not found the drawstring to be terribly useful. Rather than ending in two strings that I can securely knot, the drawstring is just one continuous loop that is much more difficult to secure. This is perhaps the most minor of the problems, since I can always just cut the drawstring in half. I've been reluctant to do that, though, because this is often just a recipe for losing the string altogether.Companies often modify their styles in the course of different production runs. Possibly the problems I've noted have been corrected. However, this purchase has left me feeling sufficiently burned that I am not likely to make a return to the scene of the crime to try my luck yet again.", "overall": 2.0, "summary": "Buy these, and watch your money fly out the window", "unixReviewTime": 1330473600, "reviewTime": "02 29, 2012"}, {"reviewerID": "A33GYL1LL646XK", "asin": "B0007PN9XI", "reviewerName": "B. Speer", "helpful": [0, 0], "reviewText": "OK, I don't play soccer.  Maybe that is why the big tongue?  In time does it lay down over the front or stay up to keep out dirt?  Must be padding for instep when you kick the ball? It did not work for me.Ordered my size (13) but I could slide my foot so far forward there was room for fingers behind my heel.  Tried heavier socks.  Made shoe too narrow and there was still 1.5 inches in front of my big toe even on the larger foot.  One of my feet is larger which is why I order 13.  Other is maybe 12 or 12.5, same medium (D) width.........at least it's not my ears, LOL.IF shoes were shorter, a proper 13, fit was excellent with light socks.  Construction was above average.  However even if I re-ordered 12s?? that tongue looks and feels dumb.  So today I am sending them back.Incidentally I also received a pair of Samoas in 13 and they fit perfect even though they are also adidas.  So the oversize is just in the Samba?  Overall the shoe is well made.  Ordered second pair of Samoas.", "overall": 3.0, "summary": "Oversize - What's the BIG Tongue for?", "unixReviewTime": 1297728000, "reviewTime": "02 15, 2011"}, {"reviewerID": "A1F7YU6O5RU432", "asin": "B0007PQHXW", "reviewerName": "Angela Streiff", "helpful": [0, 0], "reviewText": "I debated forever on whether to size up in these or not. Some reviews said they were fine, others said they sized up. I even asked a friend of mine who has these in the men's version, and he went against what everyone else said, insisting I should size down. I sit somewhere between 7.5 and 8 and after reading a ton of reviews, I noticed that on the Keen website, they suggest sizing up one half size, so I did. Turns out to have been a good decision. The size 8 was a perfect fit, and I'm pretty sure the size 7.5 would have been too snug.I bought these to wear on vacation, and had never worn them before going, other than to see if I ordered the right size. So the first time I put them on, I wore them all day walking around Busch Gardens in Tampa Bay, Florida. No breaking in time. Just put them on and wore them walking all day long. I was quite pleased to find that my feel took to them well and other than the heels feeling a little tender, after 8 hours of walking and standing lines, my feet didn't hurt the next day.I also wore these out into the ocean several days while on vacation. We stayed at a hotel right on the gulf, and walked along the beach every morning. I wore these when we were out for our morning walks, and then wore them several times when I was swimming and walking out chest deep in the ocean, looking for seashells. After being completely submerged in water, I found they took about a day to fully dry out again. These are great multi-purpose shoes. Water or walking, they work great for both. I bought them in the Bluestone/Neutral Grey color and they are perfect when you wear jeans all the time, like myself. They have a denim look and color to them, so they match perfectly for anything you wear with jeans. I like these so much, I'm hoping to pick up another pair in one of the other fun bright colors as well.", "overall": 5.0, "summary": "Glad I sized up a half size, from 7.5 to 8. Bluestone/Neutral Grey color goes great with jeans", "unixReviewTime": 1367452800, "reviewTime": "05 2, 2013"}, {"reviewerID": "A14DNCG5WHM86Z", "asin": "B0007PQHXW", "reviewerName": "Jennifer", "helpful": [0, 0], "reviewText": "I needed a pair of summer shoes that were comfortable for walking AND could go in the water (I've never had \"water\" shoes and figured that now that we were going to be living closer to the ocean, I wanted to be prepared). I have about 387 pairs of Crocs in different variations (okay, maybe eight), but they aren't THAT comfortable for serious walking (and for me, serious walking means running errands around town for three hours or going to the zoo for a half day) and not all of them are for summer.So I asked my friends for recommendations and a handful of them suggested this exact pair, raving about them. I trusted them, but $80? Really? For a pair of sandals? Lordy. So I kept wearing my Crocs and my feet kept hurting. And then we moved. And I had a week straight of unloading and unpacking at our new house, and my feet and ankles were super sore and super tired from standing on my feet all day every day.So I broke down, bit the bullet, and bought these--bitching and moaning the whole time I was paying $80 for a PAIR OF SANDALS.But wow are they are comfy. And I worked most of the day in them (still unpacking!) and didn't think once about my feet! Two days a row! Then three! And I didn't have to worry about them slipping off! I haven't had them in the water yet, but at this point I don't care because they're just comfy.The only thing that was slightly worrisome was that I have thick ankles and the first time I attempted to put them on, it was a bit difficult--there was lots of tugging and pulling and stretching. I was honestly thinking that I might have to return them, because I was NOT going to like/want to expend that much effort in putting on shoes. But the next time was easier and now it just takes a little oomph but nothing extraordinary so I'm fine with it.So as someone who hates the idea of expensive sandals, I highly recommend these.", "overall": 5.0, "summary": "As someone who hates the idea of expensive sandals, I highly recommend these.", "unixReviewTime": 1312588800, "reviewTime": "08 6, 2011"}, {"reviewerID": "A3J32XYCB1F5U", "asin": "B0007PQHXW", "reviewerName": "P Mason", "helpful": [0, 0], "reviewText": "Originally ordered my usual shoe size 8 because there was *nothing* in the product description indicating to order up a 1/2 size.  I went to the Keen site and discovered it there. Perhaps TMI for some... my second toe on both feet is larger than my big toe. Order arrived and unfortunately it was too small.  Return was easy and painless.  I elected to exchange for an 8.5, same color.  After filling out the RMA request, Amazon emailed return shipping label and clearly explained how credit would be applied to my credit card.  Once amazon received the return and my exchange order had shipped, a full credit was issued.  BTW, the 8.5 fit perfectly.Great shoe!  Solid sole not to be confused with stiff.  Good arch support.  Toe box protection is key for us outdoor types.  Easily accomodates light wool socks.  Easy care.  Love color combination.  Shoes work when going to the office on casual day Friday - Pressed khaki capris and collared button down shirt.Liked the shoes so much, I ordered a pair of Newports (leather).", "overall": 5.0, "summary": "&#8594;  Purchase 1/2 LARGER than usual shoe size", "unixReviewTime": 1374019200, "reviewTime": "07 17, 2013"}, {"reviewerID": "A2E3MDC96N248V", "asin": "B0007PQHXW", "reviewerName": "StephanieC", "helpful": [1, 1], "reviewText": "I have very flat feet and have all my life.  I've had corrective surgery to align my feet, but they're still flat.  Because they're flat, my feet are also prone to ligament inflammation without proper support.  All of these factors considered, I live in a constant struggle to find a comfortable shoe.  I usually wear tennis shoes with custom orthotics in them, but for a day at the beach, this is a problem.  I can't hold flip flops on comfortably (and they have absolutely no support!) so I needed a sandal that could hold itself on.  I tried Columbia Techsun 2 sandals, which I thought would be great, until I walked through the Bahamas in misery and ended up with blisters.I researched walking sandals for hours and hours until I finally settled on the Keens. They are a bit pricey, but any shoe that I can walk in without pain is totally worth it to me.  I've never had a more comfortable pair of shoes straight out of the box.  It's rare that I find shoes that I can wear for miles and not have something rub me or that make my knees and back ache. They'd be cuter without the big black toe guard, but I'll probably come to appreciate that feature of the shoe.  (It would be nicer if it was the same color as the straps of the shoe.)  I bought them to use on trips, but I have a feeling that when summer comes, these will be the only shoes on my feet.  I've already raved so much about them that I'm ordering a pair for my husband right now!My husband and I both wore these on a recent trip to the Caribbean and they were invaluable.  In San Juan, Puerto Rico, I walked at least 8 miles in my Keens and didn't even think about my feet.  They were so comfortable and I was especially impressed with the grip of the soles on wet rocks.  At the end of the day, I was so happy that I didn't have any blisters and my feet still felt good.  I also wore these on the beach in the Bahamas and they dried very quickly in the sun.  I will never take a trip without these shoes again!  I'm now thinking that I need these in other colors!If you have flat feet or fallen arches, I would recommend these shoes for you.  I couldn't be happier with them!", "overall": 5.0, "summary": "Great for flat feet!", "unixReviewTime": 1328054400, "reviewTime": "02 1, 2012"}, {"reviewerID": "A3P8ZDHC7XSKSE", "asin": "B0007QCOTM", "reviewerName": "Ravenskya \"Princess of Horror\"", "helpful": [41, 44], "reviewText": "I have been a Jansport Junkie since I was in High school (Many years ago).  I remember begging my mom for the black backpack with that tapestry looking strip across the front.  I was lucky enough that she bought it for me and thanks to their lifetime warrenty (it has been replaced for free 3 times now) I still have that backpack and it functions as my always packed bathroom travel bag.So I decided to go back to school to get a second major and didn't want to unpack my bathroom bag.  I began hunting for a Jansport.  I ordered this bag in the Tan color with the pink zippers.  I LOVE it.  First of all it came with that wonderful tag that says \"Lifetime warrenty on craftsmanship,\" second, it's larger and much more comfortable them my circa 1993 version.There are WAY more pockets then the old ones had.  Right now in the large main pocket I have a Precalculus book, Chemistry Book, Microbiology book, and chemistry Student guide.  In the second main pocket (the bulk of the packpack is separated into two parts) I have 3 spiral notebooks, 2 composition books, a TI Calculator, and a pair of lab goggles. In the front pouch I have two full boxes of pencils, one box of pens, various items from my purse and two packs of gum.  Then I found two more pockets AND a little webbed thingy on the side for holding a bottle of water.  Also in the front pouch is a little pocket made just for cell phones - nice touch.  I still have plenty of room for adding more crap should I want to... but I don't think I could lift it then.The whole exterior is made in that standard high test canvas that makes Jansport bags last forever.  The inside separator between the two large pockets may be the first thing that goes - it's a much flimsier material.Final verdict - it holds everything I need it to hold, has surprisingly comfortable straps, and appears very durable.  Highly recommended for High school, college, weekend overnight bag, or laptop bag.  I do not recommend it for little ones as my 8 year old put it on and it almost swallowed him.EDIT- I have just ordered 2 more of these - one for each of my stepsons.  The bag has made it through almost a whole college semester with nary a scuff.  I love this bag.  I now have one in this black and white spastic mishmash color that matches my youngest's bike, and the one with the lions on it (looks like old heraldry) they are all shaped exactly the same and made just as durable.", "overall": 5.0, "summary": "Love it", "unixReviewTime": 1263859200, "reviewTime": "01 19, 2010"}, {"reviewerID": "AG6TX1ZJHLMO7", "asin": "B0007QMBBS", "reviewerName": "W. Dietrich \"WD\"", "helpful": [2, 3], "reviewText": "I had a bulova watch that looked very similar for years.  Somehow I broke it while in Jamica (I was very hard on it) and took it to my local repair shop and was told it would cost $100 to fix and there was no gurantee that it would work as well as before.  So of course I took this as a sign to buy a new watch.I went to every store in the mall looking for a replacement.  Each time I left empty handed.  My wife asked what I was looking for and I said my old watch, which appears to be discontinued.  My wife went on Amazon and found the Marine Star Watch that looks similar to my old Bulova Watch.First of all I love the Bulova and have bought 5 watches for myself or gifts in the last 5 years and they all work perfectly.The Pros:1. I know that Bulova is quality and will be maintance free.2. I have a very large wrist and the Bulova fits great (I could even take out a link if need be.3. The price is great and I will not leave Bulova until I am ready to buy a Rolex or other ultra high end brand.4. Keeps great time.The Cons1.My Marine Star appeared to look a little more dull than the picture would suggest.2. It was very hard for me to set the time, I was afraid I was going to break the watch as the knob seemed to stick.  I have never had this problem before so I am chalking it up to specific to my watch only.THe Marine Star is a great watch and a really nice price.  It looks great on a big guy like myself.", "overall": 4.0, "summary": "I finally got my new watch", "unixReviewTime": 1231977600, "reviewTime": "01 15, 2009"}, {"reviewerID": "A3BTI607V9J8BS", "asin": "B0007UA3NC", "reviewerName": "Christine Wilkins", "helpful": [14, 18], "reviewText": "Rainbow is such a great company!!!! I've worn flip flop sandals for years and never come across a brand as good as these!  If you have ANY problems with them contact Rainbow.  They are soooo helpful and courteous!  I can't say enough!  I've had three pairs.  My husband wears them.  My daughter had a pair that was getting really worn out after a few years of wear.  They replaced them!  How cool is that??? No hassle at all!  I do recommend you know your size first.  I personally prefer the wide straps.  I first had the women's fine straps and they wore out a little more quickly.  I am hard on shoes especially if I love them.  This last pair I got was a men's small.  I'm an 8.5 women's size street shoe, and this fits me PERFECTLY!  Also, the womens' sizes are a bit narrower and my foot spilled over the sandal.  The men's is a bit wider.", "overall": 5.0, "summary": "I'd give them 10 stars if I could!", "unixReviewTime": 1335312000, "reviewTime": "04 25, 2012"}, {"reviewerID": "A3HRF5983ABNVU", "asin": "B0007VTPZS", "reviewerName": "VGB", "helpful": [3, 5], "reviewText": "Received these boots and fell in love. Unfortunately, I have to give these boots a low review as, after ordering a size 7 AND size 8, I had to return them both!!! They are SO cute and well made (the soles are pretty flat, not a lot of cushion, but that may not matter to many).  I believe several other reviewers have noted that they run small. That is very true.  I got a size 7 and have a slender foot, but could barely get my foot in. Once in, though, I found the foot part to be too small, however the opening did fit over my calf.I returned the 7 for an 8 and will review that when it arrives.  I LOVE that Amazon does free shipping/free return!  That's the ONLY reason I shop online.UPDATE: I received the size 8 a couple days ago. SO disappointed. The foot part fit well enough - it was a bit big, but I wanted enough room to put in an Insole, BUT I couldn't get the opening over my calf. I have very average sized calves. I decided to measure the opening and to my surprise it was over an inch smaller than the description. The description says around 13\", and the opening was maybe 11.7\". It was also just strange that the size 7 opening was ok, but the size 8 wasn't.  Sadly, I must return them. I then decided to go to the local Nordstrom and buy them there as I could try them on first.  I got a size 8 and the foot AND opening fit great (with an insole)!!!", "overall": 2.0, "summary": "Minnetonka brown, size 7 - run small; size 8- opening too small!", "unixReviewTime": 1358553600, "reviewTime": "01 19, 2013"}, {"reviewerID": "A2A1XYSB692L6J", "asin": "B0007YR8WW", "reviewerName": "Patricia \"A Reader\"", "helpful": [15, 17], "reviewText": "PLAYTEX WOMEN'S 18-HOUR ORIGINAL COMFORT STRAP BRA #4693 has been around a LONG time.  When a product has been around for a long time -- and especially if it comes in many colors -- one knows it is a GOOD product, whatever it is.  It doesn't pay manufacturers to make a product in lots of colours if it won't sell!This bra IS good.  It is comfortable and is easy to \"twist\".  That is, its easy, for people like me, who like a back-fastening bra, but just can't reach the back, to first put the hooks in the front, then twist the closed hooks around to the back.  Smooth process, easily done.The lift is fine.  The fit is fine.  The price isn't bad either.However, this bra comes equipped with \"stretch-ever\" elastic, on the bottom, sides, and back of this bra.  It's a kind of a super stretch-lace -- very pretty and very thick. And, sadly, it eventually stretches TOO much....After about three years of wearing this bra 8 hours a day, (365 x 8 x 3 = 8760),something very STRANGE happens to the \"stretch ever\" elastic.  It changes form!It no longer appears to be \"stretchy lace\", but instead, a grey kind of stickyrubber appears were the white, (in white bras), stretch-lace used to be.  The lace design is still there -- but it now contrasts with the grey, rubber-like backing.This backing almost feels like silly putty, and is malleable between your fingers.Three years is a good life-span for any bra.  It's just this very unpleasant \"surprise\" of a greyish-rubberized semi-goo, suddenly appearing rightbeneaath the pretty flower-lace of my bra that really threw me for a loop, the first time it happened, many years ago.But, hey, the bra fits, it feels great, and it's price is good.  And It lasts approximately three years, before the \"change\" occurs, and the \"grey monster\" suddenly appears.  Just be aware of this fact, and you won't be as shocked as I was.This bra is still my favourite!", "overall": 4.0, "summary": "T H E.....8 7 6 0 -- H O U R.....B R A", "unixReviewTime": 1303516800, "reviewTime": "04 23, 2011"}, {"reviewerID": "A1VKKUCBHZ5J9O", "asin": "B0007YVP1W", "reviewerName": "Robert by the sea", "helpful": [0, 0], "reviewText": "I purchased 2 pairs 36-32 for myself and 2 for my adult son.  These purchases from Amazon were a good experience for us.  I am puzzled by my purchases recently from Levies.com which were completely unsatisfactory and a disappointment.  From Levies direct we purchased 10 pairs of 560 in which the material was completely different than pictured and replacements were the same.  We also tried some 550 black and the same was true with big differences in the sizing.  The sales people were very nice but had no idea of what they were shipping.  If someone showed me these jeans without tags I would think they were knock offs because of the poor quality and off sizing!  I think this is why there is so much difference in what buyers are reporting back.  You can not be sure what you are going to receive and neither does the sales dept. of Levies.com.  At least with Amazon or Zappos if you should receive a bad pair of Levies returns are easy.  With Levies.com. this was not the case for us.  In Levies the good are good and the bad are completely unacceptable. The men's Levis 550 medium stone washed jeans we have recently received from Amazon and Zappos have been well constructed with the good old heavy denim, which we expect and demand from Levi's, and the good correct fit which is not too much to ask for from their loyal old customers.  Otherwise Levi's will lose us! Some people may think Levis should pay more attention to their quality control and less attention to their political advertising concerning social engineering.", "overall": 4.0, "summary": "Good experience", "unixReviewTime": 1391212800, "reviewTime": "02 1, 2014"}, {"reviewerID": "A1ZJJWF69R31ZL", "asin": "B0007YXTOS", "reviewerName": "Kate Fredericks \"Kate\"", "helpful": [5, 5], "reviewText": "It's so difficult to buy a bra online because it is generally one of those clothes items you just need to try on to see if it is a good fit. However, I needed a couple of good bras in different colors and wasn't in the mood to run from store to store so I carefully measured myself - at 5' 5 and a half inches tall and 165 pounds, it appeared I needed a 40B. A very difficult size to find under any circumstances. I read all the reviews and decided to go ahead and order this bra in red and a black and white in another style, the Playtex Women's 18 Hour Smooth N' Stylish Soft Cup 40B.You would think there would not be a lot of difference between the two, right? Wrong. I wish I had ordered all of the colors in the Ultimate Lift and Support Wire Free that I ordered the red bra in. I fully expected the RED bra to not be right. it not only fit me like it was made for me, but it was way more comfortable than the black and white bras! Both the black and white bras were slightly smaller around my diaphragm area, which was uncomfortable. However, I have to add that all three were very beautiful, stylish, feminine bras - not my mother's big old bra!The difference wasn't huge, but there was definitely a better fit in the RED Lift and Support bra. The diaphragm and back lines of this bra seemed slightly longer which meant it supported without suffocating me. I have thought about going up to a 42B, but have learned that when you increase the width of a bra, for a reason that makes no sense to me, they assume you also grow out in bust size as well and you end up with an ill-fitting bra with large gaps under the armpits.I still can't get the black in this bra and that is the color I wear most, but I am going to order another white in this one and probably a black in the original, less comfortable bra because I am too lazy to go looking for the black in this one. All three are really pretty to look at, there is no back flab or overhang - they all do exactly what they are supposed to do. Just this one is a teeny bit more comfortable doing it's job. I highly recommend the 18 Hour Ultimate Lift and Support Wire Free bra in all colors if you can find them. I am very grateful to Playtex and Amazon for making this usually grueling process quite pain free for me and I think I've found a bra I can count on to deliver comfort, support, and a good fit finally, in a very feminine, lovely bra that shows no lines and no sagging even under thin sweaters! Now I shall await them to make it in black!", "overall": 5.0, "summary": "18 Hour Ultimate Lift and Support Wire Free an Excellent Fitting Feminine Bra.", "unixReviewTime": 1355875200, "reviewTime": "12 19, 2012"}, {"reviewerID": "A7EOUGEKABOIT", "asin": "B0007YXTOS", "reviewerName": "Nancy \"nancysings\"", "helpful": [0, 0], "reviewText": "This bra gives better support and overall shape than many name-brand wireless bras that I've tried on in stores.  There is one aspect that could be improved, however.First, I'll give the positive features.  The panel under the breasts gives good support, especially when standing.  The straps are smoothly connected to the cup area, as opposed to being tacked on.  This connection provides better support.  There is enough coverage in the cleavage area so that you don't \"spill out\" of the cups when bending or twisting.  This has been a problem for me with some other bras.Second, there is one thing that could be improved.  The cup area has 2 rather thin layers of soft fabric.  Although it is comfortable, I expected more firmness.  It looks that way in the picture to me.  Some bras have a thicker fabric in the cup area, without being thickly padded.  I would have preferred this.  Also, because it lacks this, the nipples can show through (to be direct about it).  I wear \"nippies\" nipple covers which I purchased here on Amazon.  They are very comfortable and work great.  However, it's not as convenient.  There is sometimes slight puckering of the fabric at the top of the cup area because of the lack of the thicker fabric.  For me, it's not a major problem.I liked the bra enough to order 2 more, but I'm interested in looking at others.  Overall, I recommend it as a good, wireless bra.", "overall": 4.0, "summary": "Good Support for a Wireless Bra", "unixReviewTime": 1397865600, "reviewTime": "04 19, 2014"}, {"reviewerID": "A2AJLQGQY3074X", "asin": "B0007ZDTEM", "reviewerName": "Fun2Drum", "helpful": [0, 1], "reviewText": "I've had mine for several months now and I love it.  Don't be fooled by the low price.  It's just the perfect balance of soft leather and protection from drops and scratches.  It looks very good, too.  My only problem is I lost it somewhere while I was shopping. - it must have come out of my jacket pocket and I didn't notice it until I got out to the parking lot.  Fortunately my glasses were on my face at the time.  I just now ordered another and can't wait until it arrives.Update:  I have downgraded my rating for the product and the manufacturer of it.  I received the second one and I liked it, too.  Then I recently ordered a third for my sunglasses.  It came with a broken hinge which holds the metal spring closure together on the edges.  It was totally separated and makes the case unusable.  I immediately initiated a return request through Amazon and I got a reply from Amazon that the seller had closed the request.  I wondered if that meant they had approved it or not, but I guess the answer was \"not\".  I have received no other communication.  Well, it's just ten bucks down the tube but that's shoddy quality and a lousy customer service attitude on the part of the seller.  I had been happy to buy from a USA manufacturer but I guess that doesn't necessarily mean \"high quality\" anymore.  Just be aware there's a chance you'll get a piece of junk and if you do then you're likely stuck with it.  My other two cases are still okay, but they turned a loyal and referring customer against them on this one.", "overall": 1.0, "summary": "Great little glasses case (updated)", "unixReviewTime": 1385596800, "reviewTime": "11 28, 2013"}, {"reviewerID": "ADYED6Z2R1R0Z", "asin": "B0007ZP30K", "reviewerName": "A. Lee", "helpful": [0, 0], "reviewText": "A couple of reviewers have said the watch stopped working after a while.  Mine is only a week old, so it's shown no problems so far.  I will try and amend or comment on my review if something bad happens.FIT-- This is a bangle/bracelet style band, so it may not fit some wrists that well, due to the shape of the fixed sections.  I have a 6.25&#34; wrist.  I took one segment off and the fit is snug.  The fit is a bit loose with it on, even though the removable segment isn't very big--so there is not much leeway here to make it even smaller, unless you have access to the jeweler's tools to take off one of the 5 little links.  It will be impossible to adjust to a very large wrist.  There is just one easily removable clasp-style link,  I'm guessing that with that link still on, the band is still only about 6.75&#34;... so a 7&#34; wrist may either just fit snugly or be too tight.  Anything above that would be definitely too big.Of course, it's not like this is the most expensive watch around, so I'm not surprised that the fit range is tight.  It is a very nice looking watch.  Light and streamlined, with a low profile.  For me, the fit is a little on the tight side, but I'm not sure I want to use the link I took off... so it's not perfect... but it feels OK and I like the look and feel of it.If it manages to keep going for more than a month, that'll be good.I usually like to pay a little more for a longer-lasting watch.  I've had a Fossil that has worked for 10 years--and the date-thing was damaged during a battery-change once and Fossil repaired it for free, as they have a super-long warranty.  This watch is less than half the price, more a bit of inexpensive jewelry that can tell time... so it's fair enough that it won't last forever, I think.", "overall": 4.0, "summary": "I like it.  Here's how it FITS--->", "unixReviewTime": 1394064000, "reviewTime": "03 6, 2014"}, {"reviewerID": "A34BZM6S9L7QI4", "asin": "B00080FK2U", "reviewerName": "Mandy Payne \"Is it just me?\"", "helpful": [1, 1], "reviewText": "I've never had aviator glasses before. They always remind me of cops. But since moving back to Sunny California, I have been seeing these everywhere. Then I tried on a pair and some guy told me I look like Angie Harmon. So of course I ordered a pair. I love them. Everyone comments on how hot they are. I'm old as dirt, so I will take the \"hot\" comments whenever I can get them.I am 99% sure the lenses in these are glass, not plastic. They're definitely genuine Ray Bans -- I've owned lots of Ray Bans, just never the aviator style. Oh -- I purchased directly from Amazon LLC. I'm not sure I would trust anyone else.There are three basic sizes. 55mm is for pinheads (sorry, smaller people with smaller heads). 58mm is what I wear and I am the size of a large woman or an average man. And 62mm which is for people with enormous heads that they can barely hold up....or maybe just slightly larger people. I was told that most people wear the 58. Small women wear the 55. And large men take the 62 (it may be 61...it is hard to remember all of this information with my average sized head)Great purchase. Great price. I will be buying more...", "overall": 5.0, "summary": "Call Me Rizzo", "unixReviewTime": 1404432000, "reviewTime": "07 4, 2014"}, {"reviewerID": "A2LEIANN1UZTHP", "asin": "B00080LEZM", "reviewerName": "brainout", "helpful": [0, 0], "reviewText": "EDIT:  I just ordered four different pairs of shoes, two Puma, one Arcata Keens, and the SeeVees.  Gave a favorable review to the latter, but fact is the right shoe cuts inward at the heel top, just like the Arcata Keens do.  The Pumas (see my review of June 11 2013) didn't have rubber soles, so I didn't even bother trying them on when they arrived today.  So will get another pair of these Reeboks, to avoid heel chafing.  Everything else, either has those clunky soles which make no sense if you're moving, or if soled LIKE the Reeboks, still lack innersock cushioning at the heel.  Wow, I had no idea shopping for sneakers would become this time-consuming!Original review, follows below, on the Reeboks I had.  Considering the above, the 20-year problem of the soles hardening, is a minor issue.  So I'll just buy another pair of these Club classics, or the gummed red ones.  However, will inspect them in a store prior to buying, if I can.  Not sure the quality will be the same as before.============I was looking for a replacement pair of sneakers here on Amazon, and couldn't find these Reeboks until after I'd bought other shoes.  The ones here, I've owned since sometime in the 1990's.  Had to throw them out a few years back, because the soles became hard and slippery with age (i.e., when walking in Walmart).The only other wear, was on the inside cushioning.  Because it is terry cloth, depending on how your foot moves around, the terry cloth will wear out, so leaves holes from the rubbing.  Else it's a good shoe.What worries me, is that the price here, is nearly the same as what I paid 20 years prior; so I wonder if the quality has declined.  I believe my shoes were made in Korea.  Not sure about the ones here.Would appreciate someone's comment, so that any viewer can be better informed.  I wanted to review these shoes in an older version, so one might have a sense of the longevity.  I used the shoes all the time, and especially for racquetball.", "overall": 3.0, "summary": "Soles harden and become slippery as shoes age", "unixReviewTime": 1370736000, "reviewTime": "06 9, 2013"}]